{"id": "2511.19618", "categories": ["math.RT", "math.AG", "math.KT"], "pdf": "https://arxiv.org/pdf/2511.19618", "abs": "https://arxiv.org/abs/2511.19618", "authors": ["Jens Niklas Eberhardt", "Arnaud Eteve"], "title": "The Parabolic K-motivic Hecke Category", "comment": null, "summary": "We define and study the parabolic K-motivic Hecke category of a (possibly disconnected) Kac-Moody group. Our main result is a combinatorial description via singular K-theory Soergel bimodules which arise from the equivariant algebraic K-theory of parabolic Bott-Samelson resolutions. In the spherical affine case, the K-motivic Hecke category serves as one side of a conjectural quantum K-theoretic derived Satake equivalence, addressing a conjecture of Cautis-Kamnitzer."}
{"id": "2511.19710", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.19710", "abs": "https://arxiv.org/abs/2511.19710", "authors": ["Marlon Estanislau"], "title": "A recognition theorem for permutation modules over $p$-groups extending Weiss' Theorem", "comment": null, "summary": "Let $G$ be a finite $p$-group with normal subgroup $N$, and $R$ a complete discrete valuation ring in mixed characteristic. We characterize permutation $RG$-modules in terms of modules for $RN$ and $R[G/N]$. The result generalizes both the seminal detection theorem for permutation modules due to Weiss, who characterizes those permutation $RG$-modules that are $RN$-free when $R$ is a finite extension of $\\mathbb{Z}_p$, and a more recent result of MacQuarrie and Zalesskii, who prove a characterization of permutation modules when $N$ has order $p$ and $R = \\mathbb{Z}_p$."}
{"id": "2511.19767", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.19767", "abs": "https://arxiv.org/abs/2511.19767", "authors": ["Dragan Miličić", "Anna Romanov"], "title": "On the geometric approach to the discrete series", "comment": "28 pages", "summary": "Harish-Chandra classified discrete series representations of real semisimple Lie groups by describing their characters as tempered distributions with an explicit formula on the elliptic set. His approach was inspired by Weyl's proof of the character formula for irreducible representations of compact Lie groups. Hecht, Miličić, Schmid and Wolf gave an alternative construction using the localization theory of Beilinson and Bernstein: the discrete series are the global sections of standard Harish-Chandra sheaves on the flag variety attached to the closed orbits of the complexification of a maximal compact subgroup. Their approach was inspired by the Borel-Weil theorem. In this paper, we give an explicit correspondence between these parametrizations. First, for a nilpotent radical $\\mathfrak{n}$ of any Borel subalgebra, we establish a geometric formula for the $\\mathfrak{n}$-homology of a module over the universal enveloping algebra of a complex semisimple Lie algebra $\\mathfrak{g}$, in terms of its localization on the flag variety of $\\mathfrak{g}$. Then we give applications of the formula to the discrete series. First, we give a geometric proof of Schmid's result describing the $\\mathfrak{n}$-homology of discrete series representations for the nilpotent radical $\\mathfrak{n}$ attached to a Borel subalgebra containing the Lie algebra of a maximal torus. Using Osborne's formula, this gives the formula for the character on the elliptic set, and leads to the matching of Harish-Chandra's parameters for discrete series representations with the geometric parameters. This gives an alternative approach to the study of the discrete series. As an example, we deduce Blattner's conjecture on the multiplicities of K-types of the discrete series from the Borel-Weil-Bott theorem for the maximal compact subgroup."}
{"id": "2511.19825", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2511.19825", "abs": "https://arxiv.org/abs/2511.19825", "authors": ["Chun-Ju Lai", "Daniel K. Nakano", "Ziqing Xiang"], "title": "Quantum wreath products and Schur--Weyl duality II", "comment": "44 pages", "summary": "We solve the conjecture of Ginzburg, Guay, Opdam, and Rouquier regarding constructing highest weight covers of the Hecke algebra, in type D. Departing from existing Cherednik-algebra techniques, our new theory is based on an interplay between a natural generalization of dual Specht modules, and a Grothendieck spectral sequence for finite-dimensional algebras that admit (inverse) Schur functors. While the main result is regarding type $D_{2m} = G(2,2,2m)$, partial results are proved along the way for complex reflection groups $G(d,d,dm)$ and $G(m,1,d)$. Our framework should extend to all Weyl groups and general $G(m,r,n)$. A key ingredient in our methods is a unifying construction of modules over quantum wreath products, in terms of parabolic inductions on tensor products of the ``wreath modules'' introduced in the article. This construction simultaneously recovers (and hence provides a more transparent realization of) important families of modules in the literature, including simple modules over the Ariki-Koike algebra, (anti)spherical modules and the Kashiwara-Miwa-Stern modules over the affine Hecke algebra, as well as the Specht and simple modules over the Hu algebra."}
{"id": "2511.19502", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.19502", "abs": "https://arxiv.org/abs/2511.19502", "authors": ["Udvas Acharjee", "N. Uday Kiran"], "title": "Some Generalizations of Totient Function with Elementary Symmetric Sums", "comment": null, "summary": "We generalize certain totient functions using elementary symmetric polynomials and derive explicit product forms for the totient functions involving the second elementary symmetric sum. This work follows from the work of Toth [The Ramanujan Journal, 2022] where the totient function was generalized using the first and the kth elementary symmetric polynomial. We also provide some observations on the behavior of the totient function with an arbitrary jth elementary symmetric polynomial. We then outline a method for solving a certain the restricted linear congruence problem with a greatest common divisor constraint on a quadratic form, illustrated by a concrete example. Most importantly, we demonstrate the equivalence between obtaining product forms for generalized totient functions, counting zeros of specific polynomials over finite fields, and resolving a broad class of restricted linear congruence problems ."}
{"id": "2511.20204", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.20204", "abs": "https://arxiv.org/abs/2511.20204", "authors": ["Enrico Sabatini"], "title": "The Balmer spectrum and tensor telescope conjecture for noetherian path algebras", "comment": "18 pages", "summary": "Given a commutative noetherian ring $R$ and a finite acyclic quiver $Q$, we study the tensor triangulated category $\\mathcal{D}(RQ)$ endowed with the vertexwise tensor product. We find a description of the internal hom functor and show that the category is not rigid. We compute its Balmer spectrum and, despite the non-rigidity, we get a classification of all the thick tensor-ideals and a stratification result. After introducing the notion of tensor-t-structure, we give a classification of the compactly generated ones and prove the tensor telescope conjecture."}
{"id": "2511.19503", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.19503", "abs": "https://arxiv.org/abs/2511.19503", "authors": ["Sathyanarayan Narayan", "N. Uday Kiran"], "title": "On Some Generalisations of Gauss Sequences", "comment": null, "summary": "In this paper, we introduce integer sequences satisfying new congruence properties inspired by the Euler and Gauss congruences, which we call Euler-Gauss sequences. Noting that every Gauss sequence is an Euler-Gauss sequence, we compare them with certain generalizations of Gauss sequences and provide several counterexamples. In particular, the important Smallest Prime Factor (SPF) and Greatest Prime Factor (GPF) sequences (suitably defined at 1) are Euler-Gauss sequences but not Gauss sequences. We further extend these congruence-based integer sequences to a q-analog setting and establish characteristic properties that reveal their structure and fill gaps in the literature on q-Gauss sequences. In recent works, q-Gauss sequences have been shown to admit interesting combinatorial interpretations and to exhibit the Cyclic Sieving Phenomenon (CSP). Not only do our q-Euler-Gauss sequences satisfy the standard CSP with some restriction, but we also derive a new CSP condition for the SPF and GPF sequences, not hitherto known in the literature."}
{"id": "2511.19552", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.19552", "abs": "https://arxiv.org/abs/2511.19552", "authors": ["Michael Harris", "Ming-Lun Hsieh", "Shunsuke Yamana"], "title": "$p$-adic $L$-functions for $\\mathrm U(2,1)\\times\\mathrm U(1,1)$", "comment": null, "summary": "We construct the five-variable $p$-adic $L$-function attached to Hida families on $\\mathrm U(2,1)\\times\\mathrm U(1,1)$, interpolating the square-root of Rankin-Selberg $L$-values in the \\emph{shifted piano} range. Our construction relies on a new theta operator and its $p$-adic variation which plays a role analogous to the classical Ramanujan-Serre theta operator in Hida's $p$-adic Rankin-Selberg method. The interpolation formula, including the modified Euler factors at $p$ and at the real place, is consistent with the conjectural shape of $p$-adic $L$-functions predicted by Coates and Perrin-Riou."}
{"id": "2511.19712", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.19712", "abs": "https://arxiv.org/abs/2511.19712", "authors": ["Jonathan Jenvrin"], "title": "Explicit Uniform Lower Bounds for the Canonical Height on Elliptic Curves over Abelian Extensions", "comment": "12 pages", "summary": "We establish an explicit lower bound for the Néron-Tate height on elliptic curves with complex multiplication, for nontorsion points defined over the maximal abelian extension of a number field. Building on a strategy developed by Amoroso, David, and Zannier, we provide an alternative proof of a theorem originally due to Baker. The novelty in our approach is that it produces a lower bound that is fully explicit and independent of the discriminant of the base field."}
{"id": "2511.19744", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.19744", "abs": "https://arxiv.org/abs/2511.19744", "authors": ["Stephen McKean"], "title": "Toda primes", "comment": "15 pages, 3 figures. Comments welcome!", "summary": "A Toda prime of an integer $n$ is an odd prime $p$ such that $4n=(p-1)k$ with $k$ coprime to $p$. We conjecture that every positive integer admits at least two Toda primes. We give a partial proof that every positive integer admits at least one Toda prime. We conclude by discussing connections to denominators of Bernoulli numbers and a generalization of Sophie Germain primes."}
{"id": "2511.19763", "categories": ["math.NT", "math.GR"], "pdf": "https://arxiv.org/pdf/2511.19763", "abs": "https://arxiv.org/abs/2511.19763", "authors": ["Bat-Od Battseren", "Bayarmagnai Gombodorj"], "title": "A quadratic form of $p = 3k + 1$ primes", "comment": null, "summary": "We use Zagier's one-sentence proof approach to show that a prime number $p$ admits a form $p=a^2+ab+b^2$ for some integers $a$ and $b$ if and only if $p=3$ or $p\\equiv 1 \\pmod{3}$."}
{"id": "2511.19921", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.19921", "abs": "https://arxiv.org/abs/2511.19921", "authors": ["Arijit Chakraborty"], "title": "A power-saving error term in counting $C_2 \\wr H$ extensions of an arbitrary base field parametrized by discriminants", "comment": "17 pages", "summary": "We study Malle's conjecture for the group $C_2 \\wr H$ where $H$ is a permutation group. Malle's conjecture for this case was proved by Jürgen Klüners in \\cite{arXiv:1108.5597} under mild conditions for $H$. In this article, we provide an alternative method to obtain the explicit main term and a power-saving error term for $C_2 \\wr H$ extensions of an arbitrary number field. Furthermore, our method allows us to relax the assumptions for $H.$"}
{"id": "2511.20012", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.20012", "abs": "https://arxiv.org/abs/2511.20012", "authors": ["Weronika Czerniawska", "Ivan Fesenko"], "title": "Selective Integration on Higher Adeles and the Euler Characteristic of Surfaces", "comment": null, "summary": "The space of two-dimensional geometric adeles of a surface is far from being a locally compact space and there is no translation countably additive invariant nontrivial measure on it. At the same time, certain subquotients of the adeles are direct limits of compact subquotients or inverse limits of discrete subquotients, compatible in a special way. Using this fact, the paper defines a translation invariant measure and integration on certain subquotients of the geometric adeles of surfaces. This theory is considerably different from the theory of integration on analytic adeles of surfaces. After revising aspects of one-dimensional theory, the paper includes a full definition of two-dimensional geometric adeles. A number of their new topological properties are established. The new translation invariant measure and integration on selective subquotients of the geometric adeles is used for integrals of certain functions in a two-dimensional method describing the size of adelic cohomology groups of surfaces, without using standard adelic complexes. A formula for the Euler characteristic of the surface and its divisor in terms of integrals over subquotients of geometric adeles is proved. Using the Euler characteristic, a new two-dimensional adelic intersection number is introduced. For geometric surfaces it is a positive multiple of the standard intersection number. Several results in the previous study of geometric adeles are given new proofs."}
{"id": "2511.20059", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.20059", "abs": "https://arxiv.org/abs/2511.20059", "authors": ["Daniel A. Goldston", "Ade Irma Suriajaya"], "title": "Zeta Zeros on the Critical Line", "comment": "expository note, content is 6 pages (total 7 pages)", "summary": "Montgomery in 1973 introduced the pair correlation method to study the vertical distribution of Riemann zeta-function zeros. This work assumed the Riemann Hypothesis (RH). One striking application was a short proof that at least 2/3 of zeta-zeros are simple zeros, the first result of its type. Over the last 50 years, most work on pair correlation of zeta-zeros has continued to assume RH. Here we show that if RH could be removed from Montgomery's simple zero proof, then this would also give a proof that 2/3 of the zeros are on the critical line. While at present we cannot unconditionally obtain this result, we have proved in joint work that this is true if we assume all the zeros are in a narrow enough region centered on the critical line. In separate joint work we use the same idea with a related pair correlation method to prove that assuming the Pair Correlation Conjecture, also without the assumption of RH, we obtain 100\\% of the zeros are simple and on the critical line."}
{"id": "2511.20282", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.20282", "abs": "https://arxiv.org/abs/2511.20282", "authors": ["Mathieu Da Silva"], "title": "Solubility of a family of conics with polynomial coefficients in many variables", "comment": null, "summary": "We study the proportion of conics given by $(\\mathcal{C}_{\\mathbf{F}, \\mathbf{y}}) : F_0(\\mathbf{y})x_0^2 + F_1(\\mathbf{y})x_1^2 = F_2( \\mathbf{y})x_2^2 $ which have a rational point $\\mathbf{x} = (x_0 :x_1:x_2) \\in \\mathbb{P}^2(\\mathbb{Q})$, where $\\mathbf{y} = (y_0 : \\dots : y_n)\\in \\mathbb{P}^n(\\mathbb{Q})$ and $F_0,F_1,F_2 \\in \\mathbb{Z}[X_0,\\ldots, X_n]$ are homogeneous polynomials in many variables of the same degree $d$. We provide an asymptotic formula for the number of $\\mathbf{y}$ of bounded height such that the corresponding conic $(\\mathcal{C}_{\\mathbf{F}, \\mathbf{y}})$ has a rational point. In particular, our result agrees with the Loughran--Smeets and the Loughran--Rome--Sofos conjectures. Our strategy is based on a recent result of Destagnol--Lyczak--Sofos relying on the circle method to estimate the average of an arithmetic function over polynomials in many variables. To this end, we study the proportion of conics $t_0x_0^2 + t_1x_1^2 + t_2x_2^2 = 0$ having a rational point, and coefficients $t_0,t_1,t_2$ in arithmetic progressions."}
{"id": "2511.20488", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.20488", "abs": "https://arxiv.org/abs/2511.20488", "authors": ["Yunjian Peng"], "title": "The Weyl bound for Rankin-Selberg $L$-functions with Joint Ramification", "comment": "30 pages", "summary": "In this paper, we establish the Weyl bound for the Rankin-Selberg $L$-function in a certain joint ramification setting. To achieve this result, we employ the refined Petersson trace formula and develop a special Voronoï summation formula. Additionally, we obtain the sharp bound for the integral of products of Whittaker functions via the $p$-adic stationary phase method."}
{"id": "2511.20631", "categories": ["math.NT", "math.AG", "math.AP"], "pdf": "https://arxiv.org/pdf/2511.20631", "abs": "https://arxiv.org/abs/2511.20631", "authors": ["Patrick Erik Bradley", "Ángel Morán Ledezma"], "title": "Hearing the Serre invariant of a compact $p$-adic analytic manifold", "comment": "12 pages", "summary": "Using a previous novel way of defining kernel functions for Laplacian integral operators on a compact $p$-adic analytic manifold $X$, one such operator $Δ_0^s$ with $s\\in\\mathds{R}$ is applied to hearing the Serre invariant $i(X)$ by showing that a wavelet eigenvalue is always congruent to $i(X)$ modulo $q-1$, where $q$ is the cardinality of the residue field $k$ attached to a $p$-adic number field $K$. It is shown how the number of $k$-rational points of the special fibre of the Néron model of an elliptic curve defined over $K$ relates to the wavelet spectrum of $Δ^s_0$, and this then leads to the realisation that the Serre invariant $i(E(X))$ in the case of an elliptic curve $E$ with split multiplicative reduction vanishes modulo $q-1$."}
