{"id": "2511.17289", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.17289", "abs": "https://arxiv.org/abs/2511.17289", "authors": ["Ryuji Tanimoto"], "title": "Exponential matrices, $\\mathbb{G}_a$-actions on projective spaces and modular representations of elementary abelian $p$-groups", "comment": null, "summary": "Let $k$ be an algebraically closed field of positive characteristic $p$ and let $\\mathbb{G}_a$ denote the additive group of $k$. Let $n \\geq 1$ and let ${\\rm Mat}(n, k[T])^E$ denote the set of all exponential matrices of ${\\rm Mat}(n, k[T])$. Let $\\mathbb{E}_{\\geq 0}(n, k)$ denote the set of all group homomorphisms from $(\\mathbb{Z}/p\\mathbb{Z})^r$ to ${\\rm GL}(n, k)$, where $r$ ranges over all non-negative integers. In the first, we show that there exists a one-to-one correspondence between the set ${\\rm Mat}(n, k[T])^E$ and the set of all $\\mathbb{G}_a$-actions on $\\mathbb{P}^{n - 1}$. In the second, we show that there exists a one-to-one correspondence between $\\mathbb{E}_{\\geq 0}(n, k)$ and the set ${\\rm Mat}(n, k[T])^E \\times \\mathbb{Z}_{\\geq 0}$."}
{"id": "2511.16873", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.16873", "abs": "https://arxiv.org/abs/2511.16873", "authors": ["Siddharth Mahendraker"], "title": "The Relative Trace Formula for Galois Periods", "comment": "56 pages. Comments very welcome!", "summary": "Let $E/F$ be a quadratic extension of number fields. We introduce truncated geometric and spectral RTF distributions associated to a Galois symmetric pair $G \\subset \\mathrm{Res}_{E/F} G_E$, subject to the constraint that $G$ and $\\mathrm{Res}_{E/F} G_E$ have the same split rank, and formulate a precise coarse RTF identity. Specializing to $SL_{2, F} \\subset \\mathrm{Res}_{E/F} SL_{2, E}$, we show that the truncated geometric RTF distribution converges, and is given by a linear polynomial in the truncation parameter. We then compute the fine geometric expansion explicitly, including the contribution of the regularized relative unipotent orbital integrals. We propose a geometric viewpoint which guided the computation of these unipotent terms."}
{"id": "2511.16817", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.16817", "abs": "https://arxiv.org/abs/2511.16817", "authors": ["Carl Pomerance", "Andreas Weingartner"], "title": "Exceptions to the Erd\\H os--Straus--Schinzel conjecture", "comment": "25 pages, 1 table", "summary": "A famous conjecture of Erd\\H os and Straus is that for every integer $n\\ge2$, $4/n$ can be represented as $1/x+1/y+1/z$, where $x,y,z$ are positive integers. This conjecture was generalized to $5/n$ by Sierpiński, and then Schinzel conjectured that for every integer $m\\ge4$ there is a bound $n_m$ such that the fraction $m/n$ is the sum of 3 unit fractions for all integers $n\\ge n_m$. Leveraging and generalizing work of Elsholtz and Tao, we show that if $n_m$ exists it must be at least $\\exp(m^{1/3+o(1)})$; that is, there are numbers $n$ this large for which $m/n$ is not the sum of 3 unit fractions. We prove a weaker, but numerically explicit version of this theorem, showing that for $m\\ge 6.52\\times10^9$ there is a prime $p\\in(m^2,2m^2)$ with $m/p$ not the sum of 3 unit fractions, and report on some extensive numerical calculations that support this assertion with the much smaller bound $m\\ge19$. In addition we generalize a result of Vaughan to show that for each $m$, most $n$'s have $m/n$ representable, and we prove a result generalizing the problem to the sum of $j$ unit fractions."}
{"id": "2511.16873", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.16873", "abs": "https://arxiv.org/abs/2511.16873", "authors": ["Siddharth Mahendraker"], "title": "The Relative Trace Formula for Galois Periods", "comment": "56 pages. Comments very welcome!", "summary": "Let $E/F$ be a quadratic extension of number fields. We introduce truncated geometric and spectral RTF distributions associated to a Galois symmetric pair $G \\subset \\mathrm{Res}_{E/F} G_E$, subject to the constraint that $G$ and $\\mathrm{Res}_{E/F} G_E$ have the same split rank, and formulate a precise coarse RTF identity. Specializing to $SL_{2, F} \\subset \\mathrm{Res}_{E/F} SL_{2, E}$, we show that the truncated geometric RTF distribution converges, and is given by a linear polynomial in the truncation parameter. We then compute the fine geometric expansion explicitly, including the contribution of the regularized relative unipotent orbital integrals. We propose a geometric viewpoint which guided the computation of these unipotent terms."}
{"id": "2511.16975", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.16975", "abs": "https://arxiv.org/abs/2511.16975", "authors": ["Hartosh Singh Bal"], "title": "Constancy of an Infinite Cyclotomic Product via Ramanujan Sums", "comment": null, "summary": "We show that the infinite product defined by \\[ P(z) = -\\prod_{n=1}^{\\infty} (Φ_n(z))^{-1/n}, \\] where \\( Φ_n(z) \\) is the \\( n \\)-th cyclotomic polynomial, is constant inside the unit disk. The proof translates a result of Ramanujan on Ramanujan sums, equivalent to the prime number theorem, to the setting of infinite products. We also show that similar identities proved by Ramanujan lead to additional results on infinite cyclotomic products."}
{"id": "2511.17010", "categories": ["math.NT", "math.AG", "math.CV"], "pdf": "https://arxiv.org/pdf/2511.17010", "abs": "https://arxiv.org/abs/2511.17010", "authors": ["Guoquan Gao"], "title": "A complete proof of the geometric Bombieri-Lang conjecture for ramified covers of abelian varieties", "comment": "comments welcome! arXiv admin note: text overlap with arXiv:2305.14789, arXiv:2308.08117 by other authors", "summary": "We prove the geometric Bombieri-Lang conjecture for projective varieties which have finite maps to abelian varieties over function fields of characteristic 0. This generalizes the recent results of Xie-Yuan, which require either the hyperbolicity assumption or the non-isotriviality assumption. The proof is based on their strategy for constructing entire curves, but requires some new ingredients from algebraic geometry and Nevanlinna theory."}
{"id": "2511.17029", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.17029", "abs": "https://arxiv.org/abs/2511.17029", "authors": ["Yijun Yuan"], "title": "Descent of $(\\varphi,τ)$-modules in characteristic $p$", "comment": "17 pages", "summary": "In this article, we study the descent of $(\\varphi,τ)$-modules over perfectoid period rings in characteristic $p$ via Berger and Rozensztajn's theory of super-Hölder vectors. This is a generalization of their work on $(\\varphi,Γ)$-modules. As an application, we answer a question of Caruso regarding the connection between $(\\varphi,τ)$-modules and $(\\varphi,Γ)$-modules without involving Galois representations as intermediaries."}
{"id": "2511.17095", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.17095", "abs": "https://arxiv.org/abs/2511.17095", "authors": ["Ingyu Yang", "Dohyeong Kim"], "title": "The decomposition of primes in nonabelian extensions of Heisenberg type and an analogue of Euler's criterion", "comment": "15 pages", "summary": "For primes $p$ and $\\ell$ such that $\\ell$ divides $p-1$, Hirano and Morishita constructed a nonabelian Galois extension of the function field $\\mathbb{F}_p(t)$ whose degree is $\\ell^3$ and Galois group is of Heisenberg type. Here we analyze how primes of degree one decompose in such extensions. It amounts to investigating the decomposition of the principal ideal $(t-a)$ for $a \\in \\mathbb{F}_p-\\{0,1\\}$ and our main result determines when it decomposes completely in terms of an explicit polynomial in $a$. It is reminiscent of Euler's criterion. The proof relies on both the group structure of the mod-$\\ell$ Heisenberg group and the arithmetic of field extensions."}
{"id": "2511.17414", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.17414", "abs": "https://arxiv.org/abs/2511.17414", "authors": ["Sidney A. Morris", "Marcelo O. Ribeiro", "Diego Marques"], "title": "Perfect Sets of Liouville Numbers with Controlled Self-Powers", "comment": null, "summary": "We study the arithmetic behavior of self-powers $x^x$ when $x$ is a Liouville number. Using recent ideas on strengthened Liouville approximation, we develop flexible constructions that illuminate how transcendence, Liouville properties, and \"large\" topological size interact in this setting. As a concrete outcome, we build a perfect set of Liouville numbers of continuum cardinality whose finite sums, finite products, and self-powers all remain Liouville. These results show that rich algebraic and topological structures persist inside the Liouville universe for the map $x\\mapsto x^x$."}
{"id": "2511.17456", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.17456", "abs": "https://arxiv.org/abs/2511.17456", "authors": ["Jessica Alessandrì", "Daniel Loughran"], "title": "Fermat near misses and the integral Hilbert Property", "comment": null, "summary": "We consider the Diophantine equation $x^4 + y^4 - w^2 = n$ for $n \\in \\mathbb{Z}$, which is related to near misses for the quartic case of Fermat's Last Theorem. For certain $n$ we show that the set of solutions is infinite, or more generally not thin. Our approach is via the geometry of del Pezzo surfaces of degree $2$, and we prove a more general result on non-thinness of integral points on double conic bundle surfaces."}
