{"id": "2512.15035", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.15035", "abs": "https://arxiv.org/abs/2512.15035", "authors": ["Soong Kyum Lee"], "title": "Staircase Minimality and a Proof of Saxl's Conjecture", "comment": "7 pages. Dedicated to the memory of Christine Bessenrodt", "summary": "Saxl's conjecture (2012) asserts that for the staircase partition $ρ_k = (k, k-1, \\ldots, 1)$, the tensor square of the corresponding irreducible representation of the symmetric group $S_{T_k}$ contains every irreducible representation as a constituent, where $T_k = k(k+1)/2$ is the $k$th triangular number. We prove this conjecture unconditionally.\n  Our proof introduces the Staircase Minimality Theorem: among all 2-regular partitions of $T_k$, the staircase $ρ_k$ is the unique dominance-minimal element. Combined with Ikenmeyer's theorem on dominance and Kronecker positivity for staircases, this establishes that every 2-regular partition appears in the tensor square. Modular saturation then follows using only the diagonal entries $d_{μμ} = 1$ of the decomposition matrix, and the Bessenrodt--Bowman--Sutton lifting theorem completes the proof.\n  We further prove that at triangular numbers, staircases are the only Kronecker-universal self-conjugate partitions, providing a complete characterization."}
{"id": "2512.15272", "categories": ["math.RT", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.15272", "abs": "https://arxiv.org/abs/2512.15272", "authors": ["Yoann Demesmay"], "title": "Fused permutations algebras and degenerate affine Hecke algebras", "comment": "36 pages", "summary": "This paper gives an algebraic presentation of an algebra called the fused permutations algebra in the one-boundary case. It is obtained through a detailed study of the degenerate cyclotomic Hecke algebra. In particular, we prove that the fused permutations algebra is a quotient of the degenerate cyclotomic affine Hecke algebra, and we also describe a basis combinatorially in terms of signed permutations with avoiding patterns. In order to understand this quotient, we study the primitive idempotents of this degenerate cyclotomic affine Hecke algebra."}
{"id": "2512.14901", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.14901", "abs": "https://arxiv.org/abs/2512.14901", "authors": ["Marius Fischer", "Peter Vang Uttenthal"], "title": "The spin of prime ideals and level-raising of even Galois representations", "comment": null, "summary": "By extending the notion of spin of prime ideals, we show that a short character sum conjecture implies that the set of primes raising the level of a certain even Galois representation has density 2/3, as conjectured by Ramakrishna in 1998."}
{"id": "2512.14907", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.14907", "abs": "https://arxiv.org/abs/2512.14907", "authors": ["Ghaith Hiary", "Tianyu Zhao"], "title": "Unconditional estimates on the argument of Dirichlet $L$-functions with applications to low-lying zeros", "comment": null, "summary": "We make explicit a result of Selberg on the argument of Dirichlet $L$-functions averaged over non-principal characters modulo a prime $q$. As a corollary, we show for all sufficiently large prime $q$ that the height of the lowest non-trivial zero of the corresponding family of $L$-functions is less than $982\\cdot \\frac{2π}{\\log q}$. Here the scaling factor $\\frac{2π}{\\log q}$ is the average spacing between consecutive low-lying zeros with height at most 1, say. We also obtain a lower bound on the proportion of $L$-functions whose first zero lies within a given multiple of the average spacing. These appear to be the first explicit unconditional results of their kinds."}
{"id": "2512.15012", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.15012", "abs": "https://arxiv.org/abs/2512.15012", "authors": ["Shuichi Hayashida"], "title": "Isomorphism between Jacobi forms of index $D_{2n+1}$ and elliptic modular forms of level $2$", "comment": null, "summary": "There are three aims in this paper: (i) We show an isomorphism between Jacobi forms of index $D_{2n+1}$ (lattice index) and elliptic modular forms of level $2$. (ii) We give an explicit formula of Fourier coefficients of Jacobi-Eisenstein series of index $D_{2n+1}$. (iii) We construct a holomorphic modular form of weight $3/2$ of level $8$ from the Zagier Eisenstein series $\\mathscr{F}$ of weight $3/2$ of level $4$. Moreover, we show that the four functions $E^*_2$, $η^3$, $θ^3$ and $\\mathscr{F}$ have essentially the same Hecke eigenvalue $1+p$ for any odd prime $p$, where $E^*_2$ is the non-holomorphic Eisenstein series of weight $2$, $η$ is the Dedekind eta-function and $θ$ is the usual theta function. This fact follows from a special case of the isomorphism of (i).\n  As an application, we give a formula for a sum of the numbers $r_3(n)$, where $r_3(n)$ is the number of representations of an integer $n \\geq 0$ as a sum of $3$ squares."}
{"id": "2512.15237", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.15237", "abs": "https://arxiv.org/abs/2512.15237", "authors": ["Lorenz Halbeisen", "Norbert Hungerbühler", "Arman Shamsi Zargar"], "title": "Integer triangles with a rational ratio of circumcircle radius to excircle radius", "comment": null, "summary": "We consider the problem of finding integer triangles with $R/r$ a positive rational, where $R$ and $r$ are the radii of the circumcircle and an excircle, respectively. We show that for general triangles $R/r>1/4$ applies. The equation $R/r=N$ turns out to be related to the elliptic curve $\\mathcal{E}_N$ given by $v^2=u^3+2(2N^2+2N-1)u^2-(4N-1)u$. If $N>1/4$ is rational, then the torsion group of $\\mathcal{E}_N$ is $\\mathbb Z/2\\mathbb Z\\times\\mathbb Z/6\\mathbb Z$ if $N(N+2)$ is a square and $\\mathbb Z/6\\mathbb Z$ otherwise. We show that a rational triangle with rational ratio $R/r=N$ exists if and only if $N>1/4$ and there exists a rational non-torsion point on the curve $\\mathcal{E}_N$ which satisfies a certain condition. Furthermore, we show that the rank of $\\mathcal{E}_N$ is positive when $N = m^2 \\pm 1>1/4$ for a rational $m$. We also show that on every curve $\\mathcal{E}_N$ whose rank is positive, there are infinitely many rational points which lead to infinitely many non-similar integer triangles with $R/r=N$."}
{"id": "2512.15293", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.15293", "abs": "https://arxiv.org/abs/2512.15293", "authors": ["Riku Shintani"], "title": "A Generalization of MacMahon Series via Cyclotomic Polynomials", "comment": "12 pages", "summary": "About a century ago, P. A. MacMahon introduced a class of $q$-series, which are nowadays referred to as MacMahon series. More recently, in 2013, G. E. Andrews and S. C. F. Rose revealed the quasimodular property of these series. In this paper, we introduce a generalization of MacMahon series. Specifically, for any positive integers $t, k, N$ and a polynomial $Q(x)$, we define the series $\\mathcal{U}_{t, k; N}(Q; q)$ and $\\mathcal{U}_{t, k; N}^{\\star}(Q; q)$ using the $N$-th cyclotomic polynomial. To investigate these series, we apply a decomposition formula involving the Eulerian polynomials and express the $N$-th roots of unity in terms of Gauss sums. By combining these results to derive explicit representations, we prove that our series arise as quasimodular forms of higher weight and higher level. Furthermore, we show that they can be expressed as isobaric polynomials. In particular, we show that the one-parameter generalization introduced by C. Nazaroglu, B. V. Pandey, and A. Singh arises as a special case of our theory."}
{"id": "2512.15334", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.15334", "abs": "https://arxiv.org/abs/2512.15334", "authors": ["Xiao-Jie Zhu"], "title": "Quadratic Gauss sums over $\\mathbb{Z}^n/c\\mathbb{Z}^n$: explicit formulas, a duality theorem, and applications to Weil representations and cubic hypersurfaces over $\\mathbb{F}_p$", "comment": "61 pages. Comments are welcome", "summary": "We provide explicit formulas for quadratic Gauss sums over $\\mathbb{Z}^n/c\\mathbb{Z}^n$, which generalize some of the existing formulas, e.g., Skoruppa and Zagier's (for $n=2$), and Iwaniec and Kowalski's (for arbitrary $n$). We then give four main applications. As the first application, we prove a duality theorem, which relates a sum over a subgroup of $\\mathbb{Z}^n/c\\mathbb{Z}^n$ to another sum over the orthogonal complement. This allows us to give explicit formulas for quadratic Gauss partial sums over certain subgroups. As the second application, we give an explicit formula for the coefficients of Weil representations of $\\mathrm{Mp}_2(\\mathbb{Z})$, which has the advantage, compared to Scheithauer's, Strömberg's, and Boylan and Skoruppa's formulas, that it involves neither local data nor limits of theta series. As the third application, we provide an explicit formula for the number of solutions of an arbitrary quadratic congruence in $n$ variables modulo a prime, as well as an efficient formula modulo a general integer. As the final application, we give a uniform formula for the number of solutions of the Diophantine equation $dxyz=Q(x,y,z)$ over $\\mathbb{F}_p$, where $Q$ is an arbitrary integral quadratic form with some weak restrictions. This generalizes a result of Baragar regarding the Markoff equation. There is also a formula relating Hecke Gauss sums to sums over $\\mathbb{Z}^n/c\\mathbb{Z}^n$, an explicit formula for Hecke Gauss sums over quadratic fields, and an example of computing a Hecke Gauss sum over a cyclotomic field."}
{"id": "2512.15407", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.15407", "abs": "https://arxiv.org/abs/2512.15407", "authors": ["Yuchen Ding"], "title": "No exact on average additive complements of squares", "comment": null, "summary": "Let $\\mathbb{N}$ be the set of natural numbers and $\\mathcal{S}=\\big\\{1^2, 2^2, 3^2,\\cdots\\big\\}$ the set of squares. Let $\\mathcal{W}$ be an additive complement of $\\mathcal{S}$ and $$ f(n)=\\#\\big\\{(w,m^2)\\in \\mathcal{W}\\times \\mathcal{S}: n=w+m^2\\big\\}. $$ It is proved that there is a positive constant $c_{\\mathcal{W}}$ (depending at most on $\\mathcal{W}$) such that $$ \\sum_{n\\le N}f(n)-N\\ge c_{\\mathcal{W}}N $$ for infinitely many positive integers $N$, which makes some progress on a 1993 conjecture of Cilleruelo. As consequences of the this result, we answer negatively a 2001 problem of Ruzsa as well as a 2017 problem of Ben Green."}
{"id": "2512.15501", "categories": ["math.NT", "math.CO", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.15501", "abs": "https://arxiv.org/abs/2512.15501", "authors": ["Christoph Aistleitner", "Zakhar Kabluchko", "Joscha Prochno"], "title": "Arithmetic sensitivity of cumulant growth in lacunary sums: transcendental versus algebraic ratio limits", "comment": "30 pages", "summary": "We study the asymptotic behavior of cumulants of lacunary trigonometric sums $S_n(ω) := \\sum_{k=1}^n \\cos (2 πa_k ω)$, $ω\\in[0,1]$, and show that cumulant growth is highly sensitive to the arithmetic structure of the sequence $(a_k)_{k \\geq 1}$ of positive integers. In particular, if $\\lim_{k \\to \\infty} a_{k+1}/a_k = η> 1$ for some transcendental number $η$, we prove that for every $m\\in \\mathbb N$ the $m$-th cumulant of $S_n$ is asymptotically equivalent to the $m$-th cumulant of the ``independent model'' $\\widetilde{S}_n := \\sum_{k=1}^n \\cos (2 πa_k U_k)$, where $U_1, U_2, \\dots$ are independent random variables having uniform distribution on $[0,1]$. In particular, the order of growth of the cumulants as $n \\to \\infty$ is linear in this case. We also show that the transcendence condition for $\\lim_{k \\to \\infty} a_{k+1}/a_k$ is in general necessary: when the ratio limit $η$ is algebraic, the cumulants of $S_n$ may have a different asymptotic order from those of $\\widetilde{S}_n$. For instance, for $a_k = 2^k+1$ (with $η= 2$), the sixth cumulant of $S_n$ grows quadratically in $n$. In contrast, for $a_k = 2^k$ (again $η= 2$) or when $(a_k)_{k \\geq 1}$ is the Fibonacci sequence (with $η= (1+\\sqrt 5)/2$), the $m$-th cumulant of $S_n$ grows linearly as $n\\to\\infty$, but with a growth rate that differs from the one of the independent model $\\widetilde{S}_n$. Overall, our results show that the asymptotic behavior of the cumulants of lacunary trigonometric sums depends on arithmetic effects in a very delicate way. This is particularly remarkable since many other probabilistic limit theorems, such as the Central Limit Theorem, hold for lacunary trigonometric sums in a universal way without any such sensitivity towards arithmetic effects."}
{"id": "2512.15664", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.15664", "abs": "https://arxiv.org/abs/2512.15664", "authors": ["Peter Humphries"], "title": "Quantitative Equidistribution on Hyperbolic Surfaces and Arithmetic Applications", "comment": "16 pages", "summary": "The Wasserstein distance quantifies the distance between two probability measures on a metric space. We prove an analogue of the Berry-Esseen inequality for the Wasserstein distance on a finite area hyperbolic surface. This inequality controls the Wasserstein distance via an average of Weyl sums, which are integrals of Maass cusp forms and Eisenstein series with respect to these probability measures. As applications, we prove upper bounds for the Wasserstein distance for some equidistribution problems on the modular surface $\\mathrm{SL}_2(\\mathbb{Z}) \\backslash \\mathbb{H}$, namely Duke's theorems on the equidistribution of Heegner points and of closed geodesics and Watson's theorem on the mass equidistribution of Hecke-Maass cusp forms conditionally under the assumption of the generalised Lindelof hypothesis."}
{"id": "2512.15709", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.15709", "abs": "https://arxiv.org/abs/2512.15709", "authors": ["Andrés Chirre", "Harald Andrés Helfgott"], "title": "Optimal bounds for sums of non-negative arithmetic functions", "comment": "52 pages, 3 figures", "summary": "Let $A(s) = \\sum_n a_n n^{-s}$ be a Dirichlet series admitting meromorphic continuation to the complex plane. Assume we know the location of the poles of $A(s)$ with $|\\Im s| \\leq T$, and their residues, for some large constant $T$. It is natural to ask how such finite spectral information may be best used to estimate partial sums $\\sum_{n\\leq x} a_n$.\n  Here, we prove a sharp, general result on sums $\\sum_{n\\leq x} a_n n^{-σ}$ for $a_n$ non-negative, giving an optimal way to use information on the poles of $A(s)$ with $|\\Im s|\\leq T$, with no need for zero-free regions. We give not just bounds, but an explicit formula with compact support. Our bounds on $ψ(x)-x$ are, unsurprisingly, better and often simpler than a long list of existing explicit versions of the Prime Number Theorem. We treat the case of $M(x)$ and similar functions in a companion paper.\n  Our solution mixes a Fourier-analytic approach in the style of Wiener--Ikehara with contour-shifting, using optimal approximants of Beurling--Selberg type found in (Graham--Vaaler, 1981)."}
