{"id": "2511.20966", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.20966", "abs": "https://arxiv.org/abs/2511.20966", "authors": ["Takeshi Ikeda", "Shinsuke Iwao", "Mark Shimozono"], "title": "Equivariant homology of the symplectic affine Grassmannian and dual affine Schur $P$-functions", "comment": "50 pages, 1 figure", "summary": "We study the torus-equivariant homology $H_*^T(\\mathrm{Gr}_G)$ of the affine Grassmannian $\\mathrm{Gr}_G$, where $G=\\mathrm{Sp}_{2n}(\\mathbb{C})$ is the symplectic group. This homology admits a natural ring structure and a Schubert basis, giving rise to a well-defined Schubert calculus. We realize $H_*^T(\\mathrm{Gr}_G)$ in terms of symmetric functions. Our first main result introduces a new family of symmetric functions, called the \\emph{dual affine Schur $P$-functions}, which represent the Schubert classes. These functions are defined through the action of the affine nil-Hecke algebra, and specialize, in the stable limit as $n\\to \\infty$, to the dual factorial $P$-functions of Nakagawa and Naruse. Our second main result gives a precise comparison between this symmetric function model and the geometric construction of $H_*^T (\\mathrm{Gr}_G)$ due to Ginzburg and Peterson, which identifies it with a coordinate ring of a centralizer family in the Langlands dual group."}
{"id": "2511.21279", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.21279", "abs": "https://arxiv.org/abs/2511.21279", "authors": ["Emanuele Di Bella", "Willem A. de Graaf", "Andrea Santi"], "title": "Classification of nilpotent and semisimple fourvectors of a real eight-dimensional space", "comment": null, "summary": "In 1981 Antonyan classified the orbits of SL$(8,\\mathbb{C})$ on $\\bigwedge^4 \\mathbb{C}^8$. This is an example of a $θ$-group action as introduced and studied by Vinberg. The orbits of a $θ$-group are divided into three classes: nilpotent, semisimple and mixed. We consider the action of SL$(8,\\mathbb{R})$ on $\\bigwedge^4 \\mathbb{R}^8$ and classify the nilpotent and semisimple orbits as well as the Cartan subspaces. The semisimple orbits are divided into 1441 parametrized classes. Due to this high number a classification of the mixed orbits does not seem feasible. Our methods are based on Galois cohomology."}
{"id": "2511.21379", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2511.21379", "abs": "https://arxiv.org/abs/2511.21379", "authors": ["Yixia Zhang", "Panyue Zhou"], "title": "Triangulated categories arising from n-fold matrix factorizations", "comment": "29 pages", "summary": "Let $\\mathcal{A}$ be an additive category and let $T\\colon \\mathcal{A}\\rightarrow \\mathcal{A}$ be an additive functor equipped with a natural transformation $ω\\colon \\mathrm{Id}_{\\mathcal{A}}\\rightarrow T$. We prove that the homotopy category of $n$-fold matrix factorizations of $ω$, denoted ${\\rm HFact}_{n}(\\mathcal{A},T,ω)$, admits a natural structure of a right triangulated category. In particular, when $T$ is an automorphism, the homotopy category ${\\rm HFact}_{n}(\\mathcal{A},T,ω)$ becomes triangulated. Furthermore, if $\\mathcal{A}$ is a Frobenius exact category and $T$ is an autoequivalence, we obtain that the category ${\\rm Fact}_{n}(\\mathcal{A},T,ω)$ of $n$-fold $(\\mathcal{A},T)$-factorizations of $ω$ is a Frobenius exact category. Consequently, the stable category of the Frobenius exact category ${\\rm Fact}_{n}(\\mathcal{A},T,ω)$ is a triangulated category."}
{"id": "2511.21671", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.21671", "abs": "https://arxiv.org/abs/2511.21671", "authors": ["Nicholas Davidson", "Jonathan R. Kujawa", "Robert Muth"], "title": "Superalgebra deformations of web categories: Affine and cyclotomic webs", "comment": null, "summary": "Let $\\mathbb{k}$ be a characteristic zero domain. We define and study a diagrammatic monoidal $\\mathbb{k}$-linear supercategory $\\mathbf{Web}^{aff}_{A}$ associated to any locally unital Frobenius $\\mathbb{k}$-superalgebra $A$. This category can be viewed variously as an affinization of the finite web category $\\mathbf{Web}_{A}$ previously defined by the authors and Zhu, as a thickening of the degenerate affine wreath product algebras defined by Savage, or as a Frobenius deformation of affine web categories defined by Song and Wang. We show that there is an asymptotically faithful family of functors from $\\mathbf{Web}^{aff}_{A}$ to the monoidal supercategory of endofunctors of $\\mathfrak{gl}_n(A)$-modules for every $n \\geq 1$, and use this to establish a basis of `decorated double coset diagrams' for morphism spaces in $\\mathbf{Web}^{aff}_{A}$. We also define and establish basis results for the cyclotomic quotient category $\\mathbf{Web}^Λ_{A}$ associated with a cyclotomic datum $Λ$."}
{"id": "2511.20829", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.20829", "abs": "https://arxiv.org/abs/2511.20829", "authors": ["Robert Schneider"], "title": "Partition-theoretic model of prime distribution, II", "comment": "8 pages, 3 tables, submitted for publication", "summary": "In recent work by Botkin, Dawsey, Hemmer, Just and the present author, a deterministic model of prime number distribution is developed based on properties of integer partitions that gives almost exact estimates for $π(n)$, the number of primes less than or equal to positive integer $n$, up to $n=10{,}000$. In this follow-up paper, the author summarizes the ideas behind this partition-theoretic model of primes and formulates a computational model that is practically exact in its estimates of $π(n)$ up to $n=100,000$."}
{"id": "2511.21102", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21102", "abs": "https://arxiv.org/abs/2511.21102", "authors": ["Narinder Kumar Wadhawan", "Priyanka Wadhawan"], "title": "Approximation Of Logarithm, Factorial And Euler Mascheroni Constant Using Odd Harmonic Series", "comment": "13 pages, 1 figure", "summary": "We have proved in this paper that natural logarithm of consecutive number ratio, x/(x-1) approximates to 2/(2x - 1) where x is a real number except 1. Using this relation, we, then proved, x approximates to double the sum of odd harmonic series having first and last terms 1/3 and 1/(2x - 1) respectively. Thereafter, not limiting to consecutive number ratios, we extended its applicability to all the real numbers. Based on these relations, we, then derived a formula for approximating the value of Factorial x. We could also approximate the value of Euler-Mascheroni constant. In these derivations, we used only and only elementary functions, thus this paper is easily comprehensible to students and scholars."}
{"id": "2511.21137", "categories": ["math.NT", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.21137", "abs": "https://arxiv.org/abs/2511.21137", "authors": ["Yuxuan Yang"], "title": "Maximal orders optimal embedding of central simple algebras over number fields", "comment": null, "summary": "Given a number field $F$ and $R$ be the ring of integers of $F$, the problem of embedding a field extension $K/F$ into a central simple algebra $B$ is classical. This paper proves that when the central simple algebra has degree $p$, the $R$-order $S\\subset K$ can be optimal embedded into all maximal $R$-orders $O\\subset B$, unless satisfies the optimal selectivity condition."}
{"id": "2511.21153", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21153", "abs": "https://arxiv.org/abs/2511.21153", "authors": ["Takashi Goda", "Roswitha Hofer", "Kosuke Suzuki"], "title": "Disproving the quasi-uniformity of the Halton sequences and some of Halton-type sequences", "comment": "13 pages, 1 figure", "summary": "In this short article, we prove that the Halton sequence, one of the most well-known low-discrepancy sequences, is not quasi-uniform in any dimension $d \\ge 2$ with any pairwise relatively prime bases. We further disprove the quasi-uniformity of some Halton-type sequences, including the Faure sequence, which provides an alternative proof of the known results."}
{"id": "2511.21171", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21171", "abs": "https://arxiv.org/abs/2511.21171", "authors": ["Lennart Gehrmann", "Xavier Guitart", "Marc Masdeu"], "title": "Evaluation of Bianchi Rigid Meromorphic Cocycles at Big ATR Points", "comment": "23 pages, 3 tables. Comments welcome!", "summary": "We develop the tools required to effectively evaluate the Bianchi rigid meromorphic cocycles introduced by Darmon-Gehrmann-Lipnowski at big ATR points, and use them to obtain the first numerical verification of the conjectured algebraicity of these special values. Moreover, our computations suggest that these special values exhibit behaviour analogous to that of the special values of Borcherds products on Hilbert modular surfaces at big CM points."}
{"id": "2511.21292", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21292", "abs": "https://arxiv.org/abs/2511.21292", "authors": ["Xubin Hu", "Liming Ma"], "title": "The automorphism groups of a maximal function field with the second largest genus and its algebraic geometry codes", "comment": null, "summary": "In this manuscript, we investigate the automorphism group of a maximal function field with the second largest possible genus over finite field of even characteristic, which is called the Abdón--Torres function field. As an application, we determine the automorphism groups of one-point algebraic geometry codes from such a maximal function field. It turns out that the automorphism groups of one-point algebraic geometry codes agree with that of the Abdón--Torres function field except for the trivial cases. Moreover, we provide a family of maximal function fields with explicit defining equations via considering fixed subfields with respect to some subgroups of automorphism group of the Abdón--Torres function field."}
{"id": "2511.21329", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21329", "abs": "https://arxiv.org/abs/2511.21329", "authors": ["Chien-Hua Chen"], "title": "CM Drinfeld Modules, Self-isogenous Modular Polynomials, and Volcano Structure", "comment": null, "summary": "In this paper, we develop a view of self-isogenous modular polynomials and the $\\mathfrak{l}$-cyclic isogeny graph for CM Drinfeld modules of arbitrary rank $r$. On the computational side, we give an explicit procedure to construct the modular polynomial $Φ_{J,\\mathfrak{a}}(X,X)$ for Drinfeld modules of rank $r\\geqslant 3$ with $\\mathfrak{a}$ a prime ideal of $\\mathbb{F}_q[T]$. When $\\mathfrak{a}=(T)$, we provide an algorithm to compute $Φ_{J,\\mathfrak{a}}(X,X)$; when $\\mathfrak{a}=(T^2+T+1)$, we give an explicit degree bound on $Φ_{J,\\mathfrak{a}}(X,X)$. On the structural side, we formulate a generalized $\\mathfrak{l}$-cyclic volcano structure and prove that the generalized volcano appears in a component of the full $\\mathfrak{l}$-cyclic isogeny graph for rank-$r$ Drinfeld modules with complex multiplication."}
{"id": "2511.21353", "categories": ["math.NT", "math.AG", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.21353", "abs": "https://arxiv.org/abs/2511.21353", "authors": ["V. V. Bavula"], "title": "Analogue of the Galois Theory for arbitrary finite field extensions", "comment": "16 pages. arXiv admin note: substantial text overlap with arXiv:2509.01779; text overlap with arXiv:2509.01284", "summary": "This paper is a finishing touch to the (over 200 years) {\\em classical} `Galois Theory' of {\\em arbitrary} finite field extensions, i.e. the goal of it is to describe intermediate subfields of an arbitrary finite field extension via {\\em invariants} of `natural/obvious' objects that are associated with subfields via two Galois-type correspondences.\n  The classical Galois Theory covers the case of finite Galois field extensions. For finite Galois field extensions the objects are their Galois groups and their invariants.\n  In \\cite{GaloisTh-RingThAp}, we introduce a new (ring theoretic) approach to the Galois Theory which is based on\n  the {\\em principle of maximal symmetry}. In \\cite{AnGaloisTh-NORMAL-Fields}, the maximal symmetry of {\\em normal} finite field extensions yields an analogue of the Galois Theory for them. For a normal finite field extension $L/K$ the `natural/obvious' objects are the subalgebra $\\CD (L/K)\\rtimes G(L/K)$ of $\\End (L/K)$ that is generated by the automorphism group $G(L/K)$ and the algebra $\\CD (L/K)$ of differential operators on $L/K$ and its `invariants'. The `maximal symmetry' means the equality $\\End (L/K)=\\CD (L/K)\\rtimes G(L/K)$ which turns out to be a characteristic property of {\\em normal} finite field extensions, \\cite{AnGaloisTh-NORMAL-Fields}.\n  The aim of this paper is to obtain an analogue of the Galois Theory for {\\em arbitrary} finite field extensions based on results and ideas of \\cite{GaloisTh-RingThAp} and \\cite{AnGaloisTh-NORMAL-Fields}."}
{"id": "2511.21384", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21384", "abs": "https://arxiv.org/abs/2511.21384", "authors": ["Alexandros Groutides"], "title": "Euler systems for $\\mathrm{GSp}(4)$ over imaginary quadratic fields", "comment": "25 pages, comments welcomed", "summary": "We construct an Euler system attached to general-type cohomological cuspidal automorphic representations of $\\mathrm{GSp}(4)$ twisted by a Groessencharacter of an imaginary quadratic field. We then use this to bound strict Selmer groups under standard hypotheses. In addition, our approach gives a way of extending the $\\mathrm{GSp}(4)\\times\\mathrm{GL}(2)$ Euler system of Hsu-Jin-Sakamoto to a motivic statement which also covers certain small weights omitted in op.cit.."}
{"id": "2511.21427", "categories": ["math.NT", "math.AC", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.21427", "abs": "https://arxiv.org/abs/2511.21427", "authors": ["Rishu Garg", "Jitender Singh"], "title": "A generalized Dumas irreducibility criterion", "comment": "9 pages", "summary": "As an extension of the classical irreducibility result of Dumas, a factorization result for polynomials over any valued field with a Krull valuation of arbitrary rank is proved. Further, a lower degree factor bound on factors of a given polynomial over a valued field with a Krull valuation is proved. These factorization results not only unify several known irreducibility results for polynomials over the said domains but also provide us sharp bounds on degrees of irreducible factors of the underlying polynomials."}
{"id": "2511.21617", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21617", "abs": "https://arxiv.org/abs/2511.21617", "authors": ["Peter H. van der Kamp", "Anthony Overmars", "Marcel Jackson", "Andrew Hone"], "title": "On efficient approximation of quadratic irrationals", "comment": "14 pages, no figures", "summary": "We provide efficient algorithms to compute convergents of quadratic irrationals. We show that for square roots, provided Galois' refinement of Lagrange's theorem holds, certain decimations of the sequence of convergents are signed Chebyshev sequences, which can be also be generated by a Householder method."}
{"id": "2511.21648", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.21648", "abs": "https://arxiv.org/abs/2511.21648", "authors": ["Tianchen Zhao"], "title": "Extendability of group actions on K3 or Enriques surfaces", "comment": null, "summary": "Let $X$ be a K3 or Enriques surface with good reduction. Let $G$ be a finite group acting (not necessarily linearly) on $X$. We give a criterion for this group action to extend to a smooth model of $X$ in terms of the action of $G$ on the second $\\ell$-adic cohomology groups. In particular, we generalize the result on the extendability of Galois actions on K3 surfaces by Chiarellotto, Lazda, and Liedtke. As an application, we prove that a symplectic linear group action is extendable if the residue characteristic does not divide its order. Lastly, we relate the good reduction of Enriques surfaces with that of their K3 double covers."}
