{"id": "2511.07465", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07465", "abs": "https://arxiv.org/abs/2511.07465", "authors": ["E. Dyachenko"], "title": "Constructive Proofs of the Erdos-Straus Conjecture for Prime Numbers with P congruent to 1 modulo 4", "comment": null, "summary": "The Erdos-Straus conjecture (ESC) concerns the representation of the fraction 4/P, where P is a prime number, as a sum of three positive unit fractions. The focus here is on the case when P is congruent to 1 modulo 4. Two constructive approaches are proposed. Method ED1 is based on a factorization identity and leads to a nonlinear parameterization in P, which requires divisor enumeration and local filtering. Method ED2 yields a linear system in P for the parameters (delta, b, c), describing the solution set as an affine lattice of finite index in Z^3. The central result states that for every prime P congruent to 1 modulo 4 there exists a representation: 4/P = 1/A + 1/(bP) + 1/(cP), where the triple (delta, b, c) in N^3 is constructed explicitly by method ED2. In addition, algorithms for transforming solutions (convolution and anti-convolution) are introduced, and large-scale computational verification confirms the correctness and efficiency of the proposed methods."}
{"id": "2511.07550", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07550", "abs": "https://arxiv.org/abs/2511.07550", "authors": ["Djordje Milićević", "Xinhua Qin", "Xiaosheng Wu"], "title": "Bilinear forms with Kloosterman sums and moments of twisted L-functions", "comment": "37 pages", "summary": "We establish power-saving estimates for general bilinear forms with Kloosterman sums modulo arbitrary q, including when both variables are shorter than the Polya-Vinogradov range. As an application, we obtain power-saving asymptotics for the second moment of (holomorphic or Maass) modular L-functions twisted with Dirichlet characters to an arbitrary large admissible modulus q. The bounds obtained are independent of the Ramanujan-Petersson conjecture and remove all factorability conditions on q in the work of Blomer, Fouvry, Kowalski, Michel, Milicevic, and Sawin."}
{"id": "2511.07680", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07680", "abs": "https://arxiv.org/abs/2511.07680", "authors": ["Sajad Salami"], "title": "Rank of Jacobian Varieties of Curves $y^s=x(ax^r+b)$", "comment": "SUbmitted", "summary": "Let $k$ be a number field. We investigate the Mordell-Weil ranks of Jacobian varieties $J_C$ associated with algebraic curves $C$ of genus $g \\geq 1$ defined by affine equations of the form $y^s=x(ax^r+b)$, where $a, b \\in k$ ($ab \\neq 0$), and $r \\geq 1, s \\geq 2$ are fixed integers. Assuming the strong version of Lang's conjecture concerning rational points on varieties of general type, we establish that the ranks $r(J_C(k))$ are uniformly bounded as $C$ varies within this family.\n  Our methodology builds upon the geometric approach employed by H. Yamagishi and subsequently adapted by the author for the family $y^s=ax^r+b$. We construct a parameter space $\\mathcal{W}_n$ for curves possessing $n+1$ specified rational points and analyze its birational model $\\mathcal{X}_n$, a complete intersection variety. The geometric properties of the fibers of $\\Xc_n \\to \\text{Sym}^{n+1}(\\mathbb{P}^1)$, specifically their genus and gonality, are studied. Combining these geometric insights with Faltings' theorem, uniformity conjectures stemming from Lang's work, and recent results connecting rank with the number of rational points, we deduce the main boundedness result. In the case of genus one curves $C$, it states that the rank of elliptic curves $y^2=x (x^2+B)$ is uniformly bounded subject to the strong version of Lang's conjecture."}
{"id": "2511.07814", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07814", "abs": "https://arxiv.org/abs/2511.07814", "authors": ["Fangu Chen"], "title": "Superspecial primes for QM abelian surfaces over real number fields", "comment": null, "summary": "Baba and Granath generalize Elkies' theorem on infinitude of supersingular primes for elliptic curves to abelian surfaces with quaternionic multiplication of discriminant $6$, whose field of moduli is $\\mathbb{Q}$ and which is a Jacobian in characteristic $2$ and $3$. We extend the field of moduli to any number field with a real embedding, and weaken the local conditions at $2$ and $3$. The proof relies on the intersection theory of Heegner divisors on Shimura curves."}
{"id": "2511.07478", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.07478", "abs": "https://arxiv.org/abs/2511.07478", "authors": ["Ruide Fu"], "title": "Two Categorifications of the Local Langlands Correspondence for Tori", "comment": null, "summary": "The stack of local Langlands parameters for a torus is a Picard stack. In this article, we explicitly determine its Picard dual and show that the Fourier-Mukai transform gives rise to the integral categorical local Langlands correspondence for the torus. This is the categorification of the local Langlands correspondence and answers a conjecture of X. Zhu. Moreover, we establish a geometric version of this correspondence, whose categorical trace reproduces the previous result."}
{"id": "2511.07828", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07828", "abs": "https://arxiv.org/abs/2511.07828", "authors": ["Makoto Kawashima"], "title": "Hermite's approach to Abelian integrals revisited", "comment": "25 pages", "summary": "In this article, we establish a new linear independence criterion for the values of certain {\\it Lauricella hypergeometric series} $F_D$ with rational parameters, in both the complex and $p$-adic settings, over an algebraic number field. This result generalizes a theorem of C.~Hermite \\cite{Hermite} on the linear independence of certain Abelian integrals. Our proof relies on explicit Padé type approximations to solutions of a reducible Jordan-Pochhammer differential equation, which extends the Padé approximations for certain Abelian integrals in \\cite{Hermite}. The main novelty of our approach lies in the proof of the non-vanishing of the determinants associated with these Padé type approximants."}
{"id": "2511.07849", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.07849", "abs": "https://arxiv.org/abs/2511.07849", "authors": ["Chen-Bo Zhu"], "title": "Lectures on local theta correspondence", "comment": "The manuscript is submitted to the proceedings of the IHP trimester on Representation Theory and Noncommutative Geometry", "summary": "This set of lecture notes on local theta correspondence is the written version of a mini-course the author gave in March of 2025 for the program ``Representation Theory and Noncommutative Geometry\" at the Institut Henri Poincaré, Paris. The emphasis is on the Archimedean theory, which concerns representations of classical Lie groups. Section 1 is about the basic theory, including the Howe Duality Theorem, and the conservation relations. Second 2 highlights the invariant and distributional nature of local theta correspondence via the proof of the conservation relations. Sections 3 and 4 explain how two fundamental invariants of representations behave under local theta correspondence. The final section discusses applications to unitary representation theory."}
{"id": "2511.07945", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07945", "abs": "https://arxiv.org/abs/2511.07945", "authors": ["Rongjie Yin"], "title": "On the exponent of distribution for convolutions of $\\mathrm{GL(2)}$ coefficients to smooth moduli", "comment": null, "summary": "Let $(λ_f(n))_{n\\geqslant1}$ be the Hecke eigenvalues of a holomorphic cusp form $f$. We proved that the exponent of distribution of $λ_f*1$ in arithmetic progressions can be as large as $\\frac{1}{2}+\\frac{1}{46}$, provided that the moduli is square-free."}
{"id": "2511.08157", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.08157", "abs": "https://arxiv.org/abs/2511.08157", "authors": ["Esha Gupta", "Yu Zhou"], "title": "Semibricks and wide subcategories in extended module categories", "comment": null, "summary": "For $d\\geq 1$, we define semibricks and wide subcategories in the $d$-extended hearts of bounded $t$-structures on a triangulated category. We show that these semibricks are in bijection with finite-length wide subcategories. When the $d$-extended heart is the $d$-extended module category $d\\mbox{-}\\mathrm{mod}Λ$ of a finite-dimensional algebra $Λ$ over a field, we define left/right-finite semibricks and left/right-finite wide subcategories in $d\\mbox{-}\\mathrm{mod}Λ$ and show bijections with $(d+1)$-term simple-minded collections, generalising the bijections between $2$-term simple-minded collections, left/right-finite wide subcategories and left/right-finite semibricks in $\\mathrm{mod}Λ$. We use a relation between semibricks and silting complexes to characterise which mutations of $(d+1)$-term silting complexes are again $(d+1)$-term."}
{"id": "2511.07954", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07954", "abs": "https://arxiv.org/abs/2511.07954", "authors": ["Nimish Kumar Mahapatra"], "title": "An Infinite Family of Septic Number Fields with Large Pólya Groups", "comment": "20 pages", "summary": "We investigate a new family of cyclic septic fields $\\{K_t\\}_{t\\in\\mathbb{Z}}$ arising from the Hashimoto--Hoshi construction and characterize their Pólya property under the condition that the polynomial $E(t) = t^{6} + 2t^{5} + 11t^{4} + t^{3} + 16t^{2} + 4t + 8$ takes fifth-power free values. We show that this family contains infinitely many non-Pólya fields for which the cardinality of the Pólya group is unbounded. We also establish that, assuming Bunyakovsky's conjecture for $E(t)$, this family contains infinitely many Pólya fields. We further show that, for any fixed positive integer $m$, there exist infinitely many blocks of $m$ consecutive fields in this family whose cardinality of the Pólya groups can be made arbitrarily large. Finally, we demonstrate that infinitely many fields in this family are non-monogenic with field index one."}
{"id": "2511.08099", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.08099", "abs": "https://arxiv.org/abs/2511.08099", "authors": ["Marija Bliznac Trebješanin", "Pavao Radić"], "title": "Extensions of $D(4)$-pairs $\\{a, ka\\}$ with $k\\in \\{7,8,10,11,12,13\\}$", "comment": "17 pages", "summary": "We study the extensibility of $D(4)$-pairs $\\{a,b\\}$, where $b = ka$ and $k \\in \\{7,8,10,11,12,13\\}$. Firstly, we show that it can be extended to a $D(4)$-triple with an element c, which is a member of a family of positive integers depending on a. Then, we prove that such a triple has a unique extension to a $D(4)$-quadruple."}
{"id": "2511.08100", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.08100", "abs": "https://arxiv.org/abs/2511.08100", "authors": ["Przemysław Koprowski"], "title": "Polynomials assuming only local prime powers", "comment": null, "summary": "We study the class of polynomials that map a local field (i.e., the completion of a number field at a non-Archimedean place) into the subset of its $p$-th powers, where $p$ is the residue characteristic of the field in question. We present a characterization of such polynomials and show that this class is always much broader than the class of $p$-th powers of polynomials."}
{"id": "2511.08445", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.08445", "abs": "https://arxiv.org/abs/2511.08445", "authors": ["Alexandru Pascadi"], "title": "Non-abelian amplification and bilinear forms with Kloosterman sums", "comment": "49 pages; comments welcome!", "summary": "We introduce a new method to bound bilinear (Type II) sums of Kloosterman sums with composite moduli $c$, using Fourier analysis on $\\mathrm{SL}_2(\\mathbb{Z}/c\\mathbb{Z})$ and an amplification argument with non-abelian characters. For sums of length $\\sqrt{c}$, our method produces a non-trivial bound for all moduli except near-primes, saving $c^{-1/12}$ for products of two primes of the same size. Combining this with previous results for prime moduli, we achieve savings beyond the Pólya-Vinogradov range for all moduli. We give applications to moments of twisted cuspidal $L$-functions, and to large sieve inequalities for exceptional cusp forms with composite levels."}
{"id": "2511.08506", "categories": ["math.NT", "math.AG", "math.CV"], "pdf": "https://arxiv.org/pdf/2511.08506", "abs": "https://arxiv.org/abs/2511.08506", "authors": ["Fedor Pakovich"], "title": "Holomorphic maps sharing preimages over finitely generated fields", "comment": null, "summary": "Let $ R$ be a compact Riemann surface, and let $ P: R \\to \\mathbb P^1(\\mathbb C) $ and $ Q: R \\to \\mathbb P^1(\\mathbb C) $ be holomorphic maps. In this paper, we investigate the following problem: under what conditions do the preimages $ P^{-1}(K) $ and $ Q^{-1}(K) $ coincide for some infinite set $K$ contained in $\\mathbb P^1(k)$, where $k$ is a finitely generated subfield of $\\mathbb C$ (e.g., a number field)? Equivalently, we study holomorphic correspondences that admit an infinite completely invariant set contained in $\\mathbb P^1(k)$. We show that if such a set exists, then there is a holomorphic Galois covering $Θ: R_0 \\to \\mathbb P^1(\\mathbb C)$, where $R_0$ has genus zero or one, such that $ P $ and $ Q $ are ``compositional left factors\" of $ Θ.$ We also consider a more general equation $ P^{-1}(K_1) = Q^{-1}(K_2),$ where $K_1$ and $K_2$ are infinite subsets of $\\mathbb P^1(k)$."}
