{"id": "2511.15945", "categories": ["math.RT", "cs.CR", "math.GR"], "pdf": "https://arxiv.org/pdf/2511.15945", "abs": "https://arxiv.org/abs/2511.15945", "authors": ["Jason Liu"], "title": "Representations of Cyclic Diagram Monoids", "comment": "24 pages, many figures, comments welcome", "summary": "We introduce cyclic diagram monoids, a generalisation of classical diagram monoids that adds elements of arbitrary period by including internal components, with a view towards cryptography. We classify their simple representations and compute their dimensions in terms of the underlying diagram algebra. These go towards showing that cyclic diagram monoids possess representation gaps of exponential growth, which quantify their resistance as platforms against linear attacks on cryptographic protocols that exploit small dimensional representations."}
{"id": "2511.16561", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2511.16561", "abs": "https://arxiv.org/abs/2511.16561", "authors": ["Kevin Zwart"], "title": "Mathieu's approach to the Jacobian Conjecture", "comment": null, "summary": "In this paper, we give an expository presentation of the paper of Olivier Mathieu. The paper of Mathieu proves that a Lie group-theoretic conjecture implies the Jacobian Conjecture. To give Mathieu's proof, we first review the required literature on representation theory in an expository way. We continue to prove some results on the irreducible subrepresentations of the tensor algebra of the standard representation of $SL(N,\\mathbb{C})$. The last part of the paper is dedicated to Mathieu's proof."}
{"id": "2511.15962", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.15962", "abs": "https://arxiv.org/abs/2511.15962", "authors": ["Zichuan Wang"], "title": "Change of weights operations for triangulated $({\\varphi},Γ)$-modules", "comment": "43 pages. comments welcome!", "summary": "Zhixiang Wu has shown the existence of \"change of weights\" operation on $(\\varphi,Γ)$-modules in families (arxiv:2405.16637). We interpret it in the trianguline case as pullbacks with a discussion on related stacks. Finally, we prove that it intertwines well with translation functors via a 1-1 correspondence defined by Yiwen Ding (arXiv:2407.21237) in the non-critical crystabelline case."}
{"id": "2511.15827", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.15827", "abs": "https://arxiv.org/abs/2511.15827", "authors": ["Kai Huang", "Yufan Liu"], "title": "Local-global principle for triangularizability and diagonalizability of matrices", "comment": "20 pages, comments are welcome", "summary": "Given a number field $k$ with the ring of integers $\\mathcal{O}_k$ and a matrix $M\\in \\mathrm{M}_{n}(\\mathcal{O}_k)$. We prove that if $\\mathcal{O}_k$ is a principal ideal domain, the local-global principle for triangularizability and diagonalizability of $M$ holds. To explain the possible failures of the local-global principle, we prove that the stratified Brauer--Manin obstruction is the only obstruction to the local-global principle for triangularizability and diagonalizability of $M$ in some special cases."}
{"id": "2511.15850", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.15850", "abs": "https://arxiv.org/abs/2511.15850", "authors": ["David G. Radcliffe"], "title": "Elementary Bounds on Digital Sums of Powers, Factorials, and LCMs", "comment": "10 pages, 1 figure", "summary": "We prove that the sum of the base-$b$ digits of $a^{n}$ grows at least logarithmically in $n$ if $\\log(d)/\\log(b)$ is irrational, where $d$ is the smallest factor of $a$ such that $\\gcd(a/d, b) = 1$. Our approach uses only elementary number theory and applies to a wide class of sequences, including factorials and $Λ(n) = lcm(1, 2, \\ldots, n)$. We conclude with an expository proof of the previously known result that the sum of the base-$b$ digits of $a^{n}$ tends to infinity with $n$ if and only if $\\log(a)/\\log(b)$ is irrational."}
{"id": "2511.15878", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.15878", "abs": "https://arxiv.org/abs/2511.15878", "authors": ["Friedjof Tellkamp"], "title": "A Dirichlet Generating Function for the Coefficients of Euler's Pentagonal Number Theorem", "comment": null, "summary": "We establish an integral representation for the Dirichlet generating function of the coefficients of Euler's pentagonal number theorem. The Bromwich-type integral enables analytic continuation to the entire complex plane, filling a gap in the literature and providing a new framework for studying the sequence's analytic structure. Furthermore, we derive the asymptotic behavior as the variable tends to negative infinity, and give integral representations for the Euler function $φ(q)$ and the Dedekind eta function $η(τ)$. Moreover, we obtain an explicit formula for the Dirichlet generating function at each positive integer, expressed as a finite sum."}
{"id": "2511.15928", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.15928", "abs": "https://arxiv.org/abs/2511.15928", "authors": ["Akash Singha Roy"], "title": "The Landau-Selberg-Delange method for products of Dirichlet $L$-functions, and applications, I", "comment": "41 pages, 4 figures. A more refined version to follow. Comments are welcome", "summary": "The Landau-Selberg-Delange method gives precise asymptotic formulas for the partial sums $\\sum_{n \\le x} \\, a_n$ of a Dirichlet series $\\sum_n \\, a_n/n^s$ that behaves like a complex power of the Riemann zeta function. However, situations often arise when the Dirichlet series behaves like a product of complex powers of several Dirichlet $L$-functions to a modulus $q$. In such situations, one often requires sharp asymptotic formulas for the partial sums $\\sum_{n \\le x} \\, a_n$ that apply in much wider ranges of $q$ than permitted by known forms of the Landau-Selberg-Delange method. In this manuscript, we address this problem, giving new estimates on $\\sum_{n \\le x} \\, a_n$ in ranges of $q$ that are (in most applications) much wider than attainable from previous results. Our results also weaken certain hypotheses on the size of $\\{a_n\\}_n$. As applications of our main theorems, we extend Landau's classical results on the distribution of integers with prime factors restricted to progressions, and improve upon Chang, Martin and Nguyen's work on the distributions of the least invariant factors and least primary factors of multiplicative groups. We also extend the classical Sathe-Selberg theorem and study the local laws of the functions $Ω_a(n)$ and $ω_a(n)$, that count (with and without multiplicity, respectively), the number of prime divisors of $n$ lying in the progression $a$ mod $q$."}
{"id": "2511.15949", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.15949", "abs": "https://arxiv.org/abs/2511.15949", "authors": ["Marius Leonhardt", "Martin Lüdtke"], "title": "Affine Chabauty I", "comment": "36 pages; comments welcome", "summary": "We prove finiteness and give an explicit upper bound on the number of $S$-integral points on affine curves satisfying a certain rank-genus inequality. We achieve this by developing an analogue of the Chabauty method, embedding the curve into its generalised Jacobian and bounding the Abel-Jacobi image of the $S$-integral points using arithmetic intersection theory. Our results also provide the foundations for a computational method to determine the set of $S$-integral points on affine curves which will be presented in a follow-up article."}
{"id": "2511.15951", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.15951", "abs": "https://arxiv.org/abs/2511.15951", "authors": ["Alexander Galarraga", "Alexander Wang"], "title": "Superelliptic degree sets over Henselian fields", "comment": null, "summary": "Let $K$ be a discretely valued Henselian field. Creutz and Viray show that the degree set of a curve $C$ over a $p$-adic field can miss infinitely many multiples of the index of $C$, a phenomenon that cannot occur over finitely generated fields. For curves $C/K$ with a cyclic cover of $\\mathbb{P}^1$ of prime degree, under mild assumptions, we completely characterize how and when this behavior can occur, and give a method for computing degree sets of curves of this type."}
{"id": "2511.15962", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.15962", "abs": "https://arxiv.org/abs/2511.15962", "authors": ["Zichuan Wang"], "title": "Change of weights operations for triangulated $({\\varphi},Γ)$-modules", "comment": "43 pages. comments welcome!", "summary": "Zhixiang Wu has shown the existence of \"change of weights\" operation on $(\\varphi,Γ)$-modules in families (arxiv:2405.16637). We interpret it in the trianguline case as pullbacks with a discussion on related stacks. Finally, we prove that it intertwines well with translation functors via a 1-1 correspondence defined by Yiwen Ding (arXiv:2407.21237) in the non-critical crystabelline case."}
{"id": "2511.16039", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.16039", "abs": "https://arxiv.org/abs/2511.16039", "authors": ["Eddie O'Sullivan", "Henry Stone", "Swati", "Xiaolan Jin"], "title": "Exceptional Congruences for Eta-quotient newforms", "comment": "18 pages, 2 figures. Comments are welcome!", "summary": "In 1973, Swinnerton-Dyer completely classified all congruences for coefficients of normalized eigenforms in weights $k \\in \\{12, 16, 18, 20, 22, 26\\}$ on $Γ_{0}(1) = \\operatorname{SL}_{2}(\\mathbb{Z})$ using the theory of modular Galois representations. In this paper, we classify congruences of Type I and Type II considered by Swinnerton-Dyer for the coefficients of eta-quotient newforms in $S_{k}(N, χ)$. When $k \\geq 2$, we prove them using the theory of modular forms modulo primes. We also prove extensions of these congruences modulo prime powers."}
{"id": "2511.16276", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.16276", "abs": "https://arxiv.org/abs/2511.16276", "authors": ["Bernhard Heim", "Johann Stumpenhusen"], "title": "On the Detection of Non-Roots of D'Arcais Polynomials", "comment": null, "summary": "The Lehmer conjecture states that the non-constant Fourier coefficients of the 24th power of the Dedekind eta function are non-zero. In a recent preprint, Neuhauser and the first author exploited an easily accessible tool from algebraic number theory, namely the Dedekind--Kummer Theorem, to prove the non-vanishing of the Fourier coefficients of certain powers of the Dedekind eta function at roots of unity. We extend the application of this method to enlarge the scope of non-roots of the related D'Arcais polynomials."}
{"id": "2511.16281", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.16281", "abs": "https://arxiv.org/abs/2511.16281", "authors": ["Yu-Feng Wu"], "title": "Gaussian rational numbers in Cantor sets in the complex plane", "comment": null, "summary": "Given $β\\in\\mathbb{Z}[i]$ with $|β|>1$ and a finite set $D\\subset\\mathbb{Q}(i)$, let \\[K_{β, D}=\\left\\{\\sum_{j=1}^{\\infty}\\frac{d_j}{β^j}: d_j\\in D, \\forall j\\geq 1\\right\\}.\\] Let $\\mathcal{S}$ be a finite set of non-associate prime elements in $\\mathbb{Z}[i]$ not dividing $β$. We prove that if the Hausdorff dimension of $K_{β,D}$ is less than $1$, then there are only finitely many Gaussian rational numbers in $K_{β,D}$ whose denominators have all their prime factors in $\\mathcal{S}$."}
{"id": "2511.16396", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.16396", "abs": "https://arxiv.org/abs/2511.16396", "authors": ["Kevin Allen", "Robert Osburn", "Matthias Storzer"], "title": "Generalized rank deviations for overpartitions", "comment": "19 pages", "summary": "We prove formulas for generalized rank deviations for overpartitions. These formulas are in terms of Appell-Lerch series and sums of quotients of theta functions and extend work of Lovejoy and the second author. As an application, we compute a dissection."}
{"id": "2511.16452", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.16452", "abs": "https://arxiv.org/abs/2511.16452", "authors": ["Stelios Sachpazis"], "title": "Primes in arithmetic progressions under the presence of Landau-Siegel zeroes", "comment": "33 pages", "summary": "Let $x\\geqslant 2$ and assume that $a$ and $q$ are coprime positive integers. As usual, $ψ(x;q,a):=\\sum_{n\\leqslant x,n\\equiv a(\\!\\!\\!\\mod{\\!\\!q})}Λ(n)$, where $Λ$ is the von Mangoldt function. In 2003, Friedlander and Iwaniec assumed the existence of exceptional characters corresponding to \"extreme\" Landau-Siegel zeroes and established a meaningful asymptotic formula for $ψ(x;q,a)$ beyond the square-root barrier of the Generalized Riemann Hypothesis. In particular, their asymptotic yields non-trivial information for moduli $q\\leqslant x^{1/2+1/231}$. In this paper, we considerably relax the extremity of the Landau-Siegel zero required in the work of Friedlander and Iwaniec and obtain a conditional asymptotic formula for $ψ(x;q,a)$ in a slightly wider range of $q$."}
{"id": "2511.16647", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.16647", "abs": "https://arxiv.org/abs/2511.16647", "authors": ["Jewel Mahajan"], "title": "The metric theory of small gaps for a sequence of real numbers", "comment": "34 pages", "summary": "Let $(a_n)_{n \\geq 1}$ be a sequence of distinct positive integers. The metric theory of minimal gaps for the sequence $\\{αa_n \\text{ mod }1, 1\\leq n \\leq N\\}$ as $N \\to \\infty$ was initiated by Rudnick, who established that the minimal gap admits an asymptotic upper bound expressible in terms of the additive energy of $\\{a_1,\\ldots,a_N\\}$ for almost every $α$. Later, Aistleitner, El-Baz, and Munsch demonstrated that the metric theory of minimal gaps for such sequences is governed not by the additive energy, but by the cardinality of the difference set of $\\{a_1,\\ldots,a_N\\}$. They established a sharp convergence test for the typical asymptotic order of the minimal gap and proved general upper and lower bounds that are readily applicable. A key element of their proof relies on the resolution of the Duffin--Schaeffer conjecture by Koukoulopoulos and Maynard. In this article, we generalise several results from the article of Aistleitner, El-Baz, and Munsch on \\emph{integer} sequences to the case of \\emph{real} sequences. While an upper bound for $δ_{\\min}^α(N)$ remains elusive, we obtain one for its floored counterpart $\\lfloor δ^α_{\\min} \\rfloor (N)$ for real sequences $(a_n)_{n \\geq 1}$ of distinct numbers. Our theorems recover Theorems 1-3, as well as the result from Section 4.3 of the article by Aistleitner, El-Baz, and Munsch. Furthermore, we establish lower bounds for the minimal gaps of well-spaced sequences and, more generally, of a broader family that contains them."}
