{"id": "2511.08779", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.08779", "abs": "https://arxiv.org/abs/2511.08779", "authors": ["Chris Bowman", "Robert Muth", "Liron Speyer", "Louise Sutton"], "title": "Morita equivalences between cyclotomic KLR algebras in types $\\mathtt{C}_\\infty$ and $\\mathtt{A}_\\infty$", "comment": "16 pages", "summary": "We prove that level one cyclotomic KLR algebras in type $\\mathtt{C}_\\infty$ are graded Morita equivalent to level two cyclotomic KLR algebras in type $\\mathtt{A}_\\infty$. We hence deduce the graded decomposition numbers and full submodule structures of all level one cyclotomic KLR algebras in type $\\mathtt{C}_\\infty$."}
{"id": "2511.09033", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.09033", "abs": "https://arxiv.org/abs/2511.09033", "authors": ["Ekta Tiwari"], "title": "Branching rules for irreducible supercuspidal representations of unramified $\\mathrm{U}(1,1)$", "comment": "37 pages, any feedback or comments are welcome :)", "summary": "Let $G$ denote the unramified quasi-split unitary group $\\mathbb{U}(1,1)(F)$ over a $p$-adic field $F$ with residual characteristic $p \\neq 2$. In this article, we determine the branching rules for all irreducible supercuspidal representations of $G$, that is, we explicitly describe their decomposition upon restriction to a fixed maximal compact subgroup $\\mathcal{K}$ in terms of irreducible representations of $\\mathcal{K}$. We also present two applications of these decompositions, which verify two new conjectures in the literature for $G$. Together with the results from a previous paper by the author, this article completes the description of the branching rules for all irreducible smooth representations of $G$."}
{"id": "2511.08783", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.08783", "abs": "https://arxiv.org/abs/2511.08783", "authors": ["Hua Lin", "Peng-Jie Wong"], "title": "Towards Keating-Snaith's conjecture for cubic Hecke $L$-functions over the Eisenstein field", "comment": "27 pages; comments welcome", "summary": "A famous conjecture of Keating and Snaith asserts that central values of $L$-functions in a given family admit a log-normal distribution with a prescribed mean and variance depending on the symmetry type of the family. Based on a recent work of Radziwill and Soundararajan, we obtain a conditional lower bound towards Keating-Snaith's conjecture for a \"thin\" family of cubic Hecke $L$-functions over the Eisenstein field. A key new input is certain twisted estimates of the 1-level density of zeros of cubic Hecke $L$-functions, extending the previous work of David and Güloğlu, under the Generalised Riemann Hypothesis."}
{"id": "2511.08793", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.08793", "abs": "https://arxiv.org/abs/2511.08793", "authors": ["David Loeffler", "Sarah Livia Zerbes"], "title": "Ultra-Kolyvagin systems and non-ordinary Selmer groups", "comment": "24 pages", "summary": "We develop a machine for bounding Selmer groups of Galois representations via Euler systems in \"non-ordinary\" settings, using Pottharst's definition of Selmer groups via Robba-ring $(\\varphi, Γ)$-modules. Our approach relies on Sweeting's interpretation of Kolyvagin derivative classes via non-principal ultrafilters. We apply these results to prove new cases of the cyclotomic Iwasawa main conjecture for non-ordinary Rankin--Selberg convolutions."}
{"id": "2511.09015", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.09015", "abs": "https://arxiv.org/abs/2511.09015", "authors": ["Maarten Derickx", "Filip Najman"], "title": "Sporadic points on $X_0(N)$", "comment": "17 pages", "summary": "We determine all integers $N$ for which the modular curve $X_0(N)$ admits a sporadic CM point (of any degree), as well as all $N$ for which $X_0(N)$ admits a sporadic point, whether CM or non-CM. In a sense, our results generalize the classification of isogenies of elliptic curves over $\\Q$ due to Mazur and Kenku: their work determines the $X_0(N)$ with degree 1 sporadic points, whereas we classify all $X_0(N)$ that have a sporadic point of arbitrary degree."}
{"id": "2511.09125", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.09125", "abs": "https://arxiv.org/abs/2511.09125", "authors": ["Haocheng Fan"], "title": "Irreducibility of Newton strata in Picard modular surfaces and split local Galois representations", "comment": "25 pages", "summary": "We compute the monodromy group of the closure of the non-ordinary Newton stratum of the special fiber of the Picard modular surface at a split prime and prove the irreducibility of it. As an arithmetic application, we prove that for a Picard modular form, the existence of companion forms is equivalent to the splitting properties of the associated local Galois representation. This is an analogue of a theorem due to Breuil and Emerton on companion forms of modular forms."}
{"id": "2511.09181", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.09181", "abs": "https://arxiv.org/abs/2511.09181", "authors": ["Mounir Hajli"], "title": "Regularized Products over arithmetic Schemes", "comment": null, "summary": "In this paper, we study the closed points of arithmetic schemes. We accomplish this by showing that the product of the cardinals of residue fields of closed points in an arithmetic scheme can be regularized. This regularization yields a new arithmetic invariant attached to the scheme. We compute it explicitly in several cases and find that it is always a transcendental number. This result provides a proof that the set of closed points is infinite. Our main tool is a regularization technique, which generalizes the zeta-regularization method introduced by Muñoz and Pérez."}
{"id": "2511.09365", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.09365", "abs": "https://arxiv.org/abs/2511.09365", "authors": ["Ben Green", "Mehtaab Sawhney"], "title": "Bounds for monochromatic solutions to $\\{x+y,xy\\}$", "comment": "37 pages", "summary": "Let $r$ be a sufficiently large positive integer, and let $N \\ge \\exp\\exp(r^{50})$. Then any $r$-colouring of $[N]$ contains a monochromatic copy of $\\{x+y,xy\\}$ with $x > y > 2$."}
{"id": "2511.09459", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.09459", "abs": "https://arxiv.org/abs/2511.09459", "authors": ["Étienne Fouvry", "Emmanuel Kowalski", "Philippe Michel", "Will Sawin"], "title": "Bilinear forms with trace functions", "comment": "v1; 57 pages", "summary": "We obtain non-trivial bounds for bilinear sums of trace functions below the Pólya-Vinogradov range assuming only that the geometric monodromy group of the underlying ell-adic sheaf satisfies certain simple structural properties, in contrast to previous works which handled only special cases of Kloosterman and hypergeometric sheaves.\n  Our approach builds on a general \"soft\" stratification theorem for sums of products of trace functions, based on an idea of Junyan Xu, combined with a new robust version of the Goursat-Kolchin-Ribet criterion."}
