{"id": "2512.08194", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.08194", "abs": "https://arxiv.org/abs/2512.08194", "authors": ["Jie Li", "Chao Zhang"], "title": "The Locally Complexified-gentle Algebras", "comment": "28 pages, comments welcome!", "summary": "We call an $\\mathbb{R}$-algebra locally complexified-gentle if it becomes a locally gentle $\\mathbb{C}$-algebra up to Morita equivalence after complexification. We use modulated quivers to introduce two types of locally complexified-gentle algebras and show that they are Morita equivalent to some semilinear clannish algebras."}
{"id": "2512.08199", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.08199", "abs": "https://arxiv.org/abs/2512.08199", "authors": ["Zhanqiang Bai", "William Q. Erickson", "Markus Hunziker", "Jing Jiang"], "title": "Unitarity of highest weight Harish-Chandra modules and smoothness of Schubert varieties", "comment": "30 pages, 2 figures, 5 tables", "summary": "Let $G_{\\mathbb{R}}$ be a Lie group of Hermitian type, and $L(λ)$ a highest weight Harish-Chandra module of $G_{\\mathbb{R}}$ with highest weight $λ$. In this article, we exhibit a bijection between the set of connected Dynkin subdiagrams containing the noncompact simple root and the set of unitary highest weight modules $L(-wρ-ρ)$, where $ρ$ is half the sum of positive roots. We find that $L(-wρ-ρ)$ is unitary if and only if the Schubert variety $X(w)$ is smooth. We also give the cardinality of the set of unitary highest weight modules $L(-wρ-ρ)$ for each Kazhdan-Lusztig right cell."}
{"id": "2512.08272", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.08272", "abs": "https://arxiv.org/abs/2512.08272", "authors": ["You-Hung Hsu"], "title": "$0$-affine quantum groups as K-theoretic Hall algebras", "comment": "Comments are welcome", "summary": "In this note, we show that the positive part of Arkhipov-Mazin's $0$-affine quantum group can be realized as the K-theoretic Hall algebra of the type $A$ Dynkin quiver. We then construct a categorical action of this positive part and demonstrate that such an action induces semiorthogonal decompositions on the corresponding weight categories. As a main example, we study the bounded derived category of coherent sheaves on $n$-step partial flag varieties."}
{"id": "2512.08312", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2512.08312", "abs": "https://arxiv.org/abs/2512.08312", "authors": ["Hamilton Wan"], "title": "Fock Space Tensor Product Categorifications and Multiplicities in Complex Rank Parabolic Category O", "comment": "101 pages, comments welcome!", "summary": "We undertake the study of complex rank analogues of parabolic category O defined using Deligne categories. We regard these categories as a family over an affine space, introduce a stratification on this parameter space, and formulate conjectures on the structural constancy of fibers on each stratum. Using the theory of $\\mathfrak{sl}_{\\mathbb{Z}}$-categorification, we prove these conjectures for admissible strata. Namely, we axiomatize the notion of multi-Fock tensor product categorifications (MFTPCs), which are interval finite highest weight categories equipped with a compatible action of commuting copies of $\\mathfrak{sl}_{\\mathbb{Z}}$, categorifying an external tensor product of tensor products of highest and lowest weight Fock space representations. We prove a uniqueness theorem for admissible MFTPCs and show that complex rank parabolic categories O have the structure of MFTPCs. In turn, for suitable choices of parameters, we produce an equivalence of complex rank category O with a stable limit of classical parabolic categories O, resolving our conjecture in the admissible case. These equivalences yield multiplicities of simple objects in Verma modules in terms of stable parabolic Kazhdan--Lusztig polynomials, answering a question posed by Etingof. In particular, for the case of two Levi blocks of non-integral size, we completely describe the structure of the corresponding category O in terms of stable representation theory. As an application, we obtain multiplicities for parabolic analogs of hyperalgebra Verma modules introduced by Haboush in the large rank and large characteristic limit."}
{"id": "2512.08060", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.08060", "abs": "https://arxiv.org/abs/2512.08060", "authors": ["Alexis Lucas"], "title": "Wieferich and Mersenne primes for function fields", "comment": "11 pages", "summary": "We study properties of recently introduced Wieferich primes for Drinfeld modules, as their relation with Fermat equations and finitess or non-finiteness of their number. We also introduce Mersenne numbers for Drinfeld modules, and study the links between these two notions."}
{"id": "2512.08307", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.08307", "abs": "https://arxiv.org/abs/2512.08307", "authors": ["Wee Teck Gan"], "title": "Triality and adjoint lifting for GL(3)", "comment": null, "summary": "Using the stable twisted trace formula for the triality automorphism, we show the adjoint lifting (to GL(8)) of cuspidal representations of GL(3) with a discrete series local component. We also describe the possible isobaric decompositions of the resulting automorphic representations on GL(8)."}
{"id": "2512.08187", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.08187", "abs": "https://arxiv.org/abs/2512.08187", "authors": ["Kazuhide Matsuda"], "title": "Notes on the multiplier systems of $η(τ)$ and $θ(τ)$", "comment": null, "summary": "The multiplier systems of $η^{2k}(τ)$ and $θ^{2k}(τ)$ $(k\\in\\mathbb{Z})$ are characters. In this paper, we determine their kernels, Ker$\\,ν_{η^{2k}}$ and Ker$\\,ν_{ θ^{2k} } $."}
{"id": "2512.08250", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.08250", "abs": "https://arxiv.org/abs/2512.08250", "authors": ["Peter Jaehyun Cho", "Jinjoo Yoo"], "title": "The $L$-polynomial of hyperelliptic function fields and its applications", "comment": null, "summary": "Let $\\ell$ be an odd prime, $q$ an odd prime power such that $q \\not\\equiv 0 \\pmod \\ell$, and $m$ the order of $q$ in $\\F_\\ell^\\times$. We propose an explicit $L$-polynomial of hyperelliptic function field $K:=\\F_q(T, \\sqrt[\\ell]{T^2+aT+b})$ with $a, b \\in \\F_q$ and $a^2-4b \\ne 0$. Using our formula, we obtain the explicit closed formula for the class number of $K$, where $m$ is even or $m=\\frac{\\ell-1}{2}$.As an application, we compute the average class numbers for hyperelliptic function fields with genus up to $3$."}
{"id": "2512.08278", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.08278", "abs": "https://arxiv.org/abs/2512.08278", "authors": ["Takuya Yanagisawa"], "title": "On a bound of $p$-ranks of Iwasawa modules of $\\mathbb{Z}_p$-extensions over a quartic CM-field", "comment": "14 pages", "summary": "Let $p$ be a prime number. If a number field $k$ has at least one complex place, there are infinitely many $\\mathbb{Z}_p$-extensions over $k$, and some authors studied the behavior of Iwasawa invariants of these $\\mathbb{Z}_p$-extensions. In particular, Fujii studied the case where $k$ is an imaginary quadratic field and obtained some results on the boundedness of Iwasawa $λ$-invariants in a certain infinite family of $\\mathbb{Z}_p$-extensions. In the present article, we give analogous theorems in the case where $k$ is a quartic CM-field. One of our main theorems determines all the Iwasawa invariants, including the $ν$-invariants, of a certain infinite family of $\\mathbb{Z}_p$-extensions over a quartic CM-field."}
{"id": "2512.08307", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.08307", "abs": "https://arxiv.org/abs/2512.08307", "authors": ["Wee Teck Gan"], "title": "Triality and adjoint lifting for GL(3)", "comment": null, "summary": "Using the stable twisted trace formula for the triality automorphism, we show the adjoint lifting (to GL(8)) of cuspidal representations of GL(3) with a discrete series local component. We also describe the possible isobaric decompositions of the resulting automorphic representations on GL(8)."}
{"id": "2512.08599", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.08599", "abs": "https://arxiv.org/abs/2512.08599", "authors": ["Qingshen Lv", "Bingyong Xie"], "title": "Comparison of canonical periods under base change", "comment": null, "summary": "In this paper we prove the canonical period of a Hilbert modular form with respect to the base change of a real quadratic extension differs from the square of its own canonical period only by a $p$-adic unit under some conditions. We prove this by proving a specific version of anticyclotomic Iwasawa main conjecture for Hilbert modular forms."}
{"id": "2512.08631", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.08631", "abs": "https://arxiv.org/abs/2512.08631", "authors": ["Desirée Gijón Gómez"], "title": "The Stéphanois theorem with only prime isogenies", "comment": "16 pages, comments welcome!", "summary": "We present a strengthening of the proof of the Stéphanois theorem. We follow the modular version by Waldschmidt, which is based in a suggestion by Daniel Bertrand, but it also applies to the original proof. The improvement is not in the result or the conditions, but in the need of weaker tools on the proof itself. More precisely, we only employ modular polynomials of prime degree, instead of polynomials of arbitrary level. Furthermore, one can restrict to primes in fixed arithmetic sequence.\n  On the proof itself, the only crucial difference appears in Cinquième pas and on the final contradiction in Septième pas of Waldschmidt's proof, but for readability, we present a complete proof with this modification.\n  This is part of a larger project to generalize the Stéphanois theorem to the Igusa invariants of curves of genus two, as the Siegel modular polynomials in the literature are usually only considered for prime levels.\n  The material is part of Chapter 7 of the author's PhD thesis."}
