{"id": "2512.02174", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02174", "abs": "https://arxiv.org/abs/2512.02174", "authors": ["Stephan Baier", "Sayantan Roy"], "title": "Diophantine approximation with primes from short intervals", "comment": "10 pages", "summary": "In this paper, we establish hybrid results on Diophantine approximation with primes from short intervals. In particular, we prove the following result in a slightly modified form: If $α$ is an irrational number having a continued fraction expansion with bounded terms (in particular, if $α$ is a quadratic irrational), then the number of primes $p$ in the interval $(X-Y,X]$ satisfying $||pα||<δ$ is asymptotically equal to $2δY/\\log X$, provided that $X\\ge 10$, $X^{2/3+\\varepsilon}\\le Y\\le X/2$ and $X^{\\varepsilon}\\max\\left\\{X^{1/4}Y^{-1/2},X^{2/3}Y^{-1}\\right\\}\\le δ\\le 1/2$."}
{"id": "2512.02232", "categories": ["math.NT", "math.OA"], "pdf": "https://arxiv.org/pdf/2512.02232", "abs": "https://arxiv.org/abs/2512.02232", "authors": ["Igor V. Nikolaev"], "title": "Lambert $W$-function and Gauss class number one conjecture", "comment": "9 pages", "summary": "We study fixed points of a function arising in a representation theory of the Drinfeld modules by the bounded linear operators on a Hilbert space. We prove that such points correspond to number fields of the class number one. As an application, one gets a solution to the Gauss conjecture for the real quadratic fields of class number one."}
{"id": "2512.02324", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02324", "abs": "https://arxiv.org/abs/2512.02324", "authors": ["Jing Jin", "Huan Xu", "Olivia X. M. Yao"], "title": "Parity results for the reciprocals of false theta functions", "comment": null, "summary": "Recently, Keith investigated arithmetic properties for the reciprocals of some false theta functions and posed several conjectures. In this paper, we prove some parity results\n  for the reciprocals of some false theta functions by using some identities on Ramanujan's general theta function. In particular, our results imply some conjectures of Keith."}
{"id": "2512.02335", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02335", "abs": "https://arxiv.org/abs/2512.02335", "authors": ["Suzuho Osonoe", "Maki Nakasuji"], "title": "$SL_4$-Kloosterman sum via the Bruhat decomposition", "comment": null, "summary": "We define the Kloosterman sum for $SL_4$ over the Kloosterman set via the Bruhat decomposition and stratify the Kloosterman set using the reduced word decomposition of the Weyl group element. The Kloosterman sum for an $SL_4$-long word is decomposed into finer parts (called the fine Kloosterman sum), and can be written as a finite sum of a product of two classical Kloosterman sums."}
{"id": "2512.02218", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.02218", "abs": "https://arxiv.org/abs/2512.02218", "authors": ["Nathan Reading", "Dylan Rupel", "Salvatore Stella"], "title": "Dominance regions for affine cluster algebras", "comment": "53 pages, 4 figures", "summary": "We determine dominance regions associated to cluster algebras of affine type. In the most interesting cases, the dominance region is a line segment, which we describe explicitly. Motivations for this work include a project to determine all pointed bases for cluster algebras of affine type and a separate project to determine all theta functions in the affine case. The proofs draw on known results from the doubled Cambrian fan and almost-positive roots models, as well as a new tool that we develop: a detailed description of neighboring seeds of affine type (seeds that are, in some sense, as close as possible to the boundary of the g-vector fan)."}
{"id": "2512.02343", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.02343", "abs": "https://arxiv.org/abs/2512.02343", "authors": ["Jit Wu Yap", "Tien-Cuong Dinh"], "title": "Lower Bounds for Galois Orbits of periodic points for polarized endomorphisms", "comment": null, "summary": "Let $K$ be a number field, $X$ a smooth projective variety over $K$ and $f: X \\to X$ a polarized endomorphism of degree $d \\geq 2$. We prove an exponential lower bound on $[K(\\Per_n):K]$, where $\\Per_n$ is the set of $n$-periodic points, extending results of [Yap24] to higher dimensions. We also prove a quantitative rate of equidistribution for $\\Per_n$ to the equilibrium measure."}
{"id": "2512.02226", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.02226", "abs": "https://arxiv.org/abs/2512.02226", "authors": ["Nate Harman", "Andrew Snowden", "Elad Zelingher"], "title": "Representations of finite matrix monoids", "comment": "31 pages", "summary": "Let $\\mathfrak{M}_n$ be the multiplicative monoid of $n \\times n$ matrices over a finite field. The monoid algebra $\\mathbf{C}[\\mathfrak{M}_n]$ has been studied for several decades. One of the important early results is Kovács' theorem that the two-sided ideal spanned by matrices of rank at most $r$ has a unit. Our most significant result is an explicit formula for this unit. Prior to our work, such a formula was only known in a few examples. We also study the module theory of $\\mathbf{C}[\\mathfrak{M}_n]$. We explicitly describe the simple modules, and establish induction and restriction rules. We show that the simple decomposition of an arbitrary module can be determined using character theory of finite general linear groups; this relies on a Pieri rule of Gurevich--Howe. We also establish a version of Schur--Weyl duality for $\\mathbf{C}[\\mathfrak{M}_n]$. Many of these results hold over more general coefficient fields."}
{"id": "2512.02345", "categories": ["math.NT", "math.CV"], "pdf": "https://arxiv.org/pdf/2512.02345", "abs": "https://arxiv.org/abs/2512.02345", "authors": ["Barry Brent"], "title": "Ramanujan's function on small primes", "comment": "Nine pages, two figures", "summary": "We study matrices the determinants of which represent $τ(p_n)$, where $τ$ is Ramanujan's function and $p_n$ denotes the $n^{th} rational prime. We also look at certain ``deformations'' of these matrices that exhibit nice regularities within the limited range of our empirical observations. This is an application of methods from our previous article arXiv:math/0405083."}
{"id": "2512.02559", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.02559", "abs": "https://arxiv.org/abs/2512.02559", "authors": ["Bárbara Muniz", "David Plaza", "Claudia Rojas-andías"], "title": "Atomic decomposition for an affine Weyl group of type $G_2$", "comment": "15 pages", "summary": "We show that the elements of the Kazhdan--Lusztig basis of the spherical Hecke algebra of type $G_2$ have an atomic decomposition. As a by-product, we obtain a new algorithm to compute generalized Kostka--Foulkes polynomials in type $G_2$."}
{"id": "2512.02348", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02348", "abs": "https://arxiv.org/abs/2512.02348", "authors": ["Fred Diamond", "Matthias Flach", "Li Guo"], "title": "Adjoint motives of modular forms and the Tamagawa number conjecture", "comment": "109 pages. This is the longer version of the paper with the same title that was published in Ann. Sci. École Norm. Sup. (4) 37 (2004), no. 5, 663-727. This version contains details in the foundational part (Section 1) that were not included in the published version", "summary": "Let $f$ be a newform of weight $k\\geq 2$, level $N$ with coefficients in a number field $K$, and $A$ the adjoint motive of the motive $M$ associated to $f$. We carefully discuss the construction of the realisations of $M$ and $A$, as well as natural integral structures in these realisations. We then use the method of Taylor and Wiles to verify the $λ$-part of the Tamagawa number conjecture of Bloch and Kato for $L(A,0)$ and $L(A,1)$. Here $λ$ is any prime of $K$ not dividing $Nk!$, and so that the mod $λ$ representation associated to $f$ is absolutely irreducible when restricted to the Galois group over $\\mathbb{Q}(\\sqrt{(-1)^{(\\ell-1)/2}\\ell})$ where $λ\\mid \\ell$. The method also establishes modularity of all lifts of the mod $λ$ representation which are crystalline of Hodge-Tate type $(0,k-1)$."}
{"id": "2512.02946", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2512.02946", "abs": "https://arxiv.org/abs/2512.02946", "authors": ["Il-Seung Jang"], "title": "Unipotent quantum coordinate ring and minuscule prefundamental representations: twisted case", "comment": "28 pages", "summary": "We study the prefundamental modules $L_{s,a}^{\\pm}$ over the Borel subalgebras of the twisted quantum loop algebras, which are introduced by Wang. A character formula for $L_{s,a}^{\\pm}$ is obtained from that for the prefundamental modules over the untwisted quantum loop algebras by applying a character folding map. This allows us to realize minuscule prefundamental modules $L_{s,a}^{\\pm}$ for types $A_{2n-1}^{(2)}$ and $D_{n+1}^{(2)}$ in terms of the unipotent quantum coordinate ring associated with the fundamental $s$-th coweight, where $s = 1$ for type $A_{2n-1}^{(2)}$ and $s = n$ for type $D_{n+1}^{(2)}$. This result is a continuation of the realization of (co)minuscule prefundamental modules established by earlier works [J-Kwon-Park, Int. Math. Res. Not., 2023] and [J-Kwon-Park, J. Algebra, 2025]."}
{"id": "2512.02388", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02388", "abs": "https://arxiv.org/abs/2512.02388", "authors": ["Bolun Wei", "Liping Yang"], "title": "Infinite symmetric power L-functions of the hyper-Kloosterman family", "comment": "comments are welcome", "summary": "The infinity symmetric power $L$-functions play a fundamental role in Wan's groundbreaking work on Dwork's conjecture[16]. Building upon this foundation, Haessig[8] established the $p$-adic estimates for these $L$-functions in the case of the one-dimensional Kloosterman family. In this paper, we extend Haessig's results by deriving a uniform lower bound for the $q$-adic Newton polygon of the infinite symmetric power $L$-functions associated with the hyper-Kloosterman family. For the $1$-dimensional Kloosterman family, Haessig[8] showed that there is a $p$-adic cohomology theory for the infinity symmetric power $L$-function. In this paper, we prove there is also a cohomological description of the infinity symmetric power $L$-function for the hyper-Kloosterman family. By applying the Frobenius endomorphism to this cohomology, we derive a uniform lower bound for the corresponding $L$-function."}
{"id": "2512.02428", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02428", "abs": "https://arxiv.org/abs/2512.02428", "authors": ["Keita Nakai"], "title": "Effective hybrid joint universality for Dirichlet $L$-functions and its application", "comment": "29 pages", "summary": "In 2003, Garunkštis provided a lower bound for the lower density of the universality theorem for the Riemann zeta-function. In this paper, we generalize this result for the hybrid joint universality theorem for Dirichlet $L$-functions whose moduli are prime numbers. Furthermore, by its application, we estimate a lower bound of the lower density of the universality theorem for Hurwitz zeta-functions with rational parameters."}
{"id": "2512.02466", "categories": ["math.NT", "math.HO"], "pdf": "https://arxiv.org/pdf/2512.02466", "abs": "https://arxiv.org/abs/2512.02466", "authors": ["Tsogtgerel Gantumur"], "title": "An expository review of the Chebyshev-Sylvester method in prime number theory", "comment": "20 pages, 20 figures", "summary": "This paper provides a detailed expository and computational account of the elementary methods developed by P. L. Chebyshev and J. J. Sylvester to establish explicit bounds on the prime counting function. The core of the method involves replacing the Möbius function with a finitely supported arithmetic function in the convolution identities, relating the Chebyshev function psi(x) to the summatory logarithm function T(x) = log([x]!). We present a comprehensive analysis of the various schemes proposed by Chebyshev and Sylvester, with a central focus on Sylvester's innovative iterative refinement procedure. By implementing this procedure computationally, we replicate, verify, and optimize the historical results, providing a self-contained pedagogical resource for this pivotal technique in analytic number theory."}
{"id": "2512.02548", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.02548", "abs": "https://arxiv.org/abs/2512.02548", "authors": ["Julie Desjardins"], "title": "Moderate rank jumps on rational elliptic surfaces via construction of conics", "comment": "11 pages, comments welcome", "summary": "This note is devoted to studying certain families of elliptic surfaces with infinitely many fibers with rank at least 3 or 4 revisiting and combining ideas from of Gary Walsh, Salgado and Loughran, and the author."}
{"id": "2512.02570", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02570", "abs": "https://arxiv.org/abs/2512.02570", "authors": ["Fred Diamond", "Shu Sasaki"], "title": "On Galois representations associated to mod $p$ Hilbert modular forms", "comment": "81 pages", "summary": "We consider mod $p$ Hilbert modular forms for a totally real field $F$, viewed as sections of automorphic line bundles on Hilbert modular varieties in prime characteristic $p$. For a Hecke eigenform of arbitrary weight, we prove the existence of an associated two-dimensional representation of the absolute Galois group of $F$. Furthermore, for any such irreducible Galois representation, we formulate a conjecture predicting the set of weights of eigenforms from which it arises. This generalizes Edixhoven's variant of the weight part of Serre's Conjecture (in the case $F = \\mathbb{Q}$), and removes the restriction that $p$ be unramified in $F$ from prior work in this direction. We also establish one direction of a conjectural relation with the algebraic analogue of the weight part of Serre's Conjecture in this context. Finally, we prove results towards our conjecture in the case of partial weight one for real quadratic fields $F$ in which $p$ is ramified."}
{"id": "2512.02612", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02612", "abs": "https://arxiv.org/abs/2512.02612", "authors": ["Ludovic Mistiaen"], "title": "Linear independence of values of Dirichlet $L$ functions", "comment": "in French language", "summary": "In this paper, for a given Dirichlet character mod $N$ with $4\\nmid N$, we give a lower bound of order $\\sqrt{s/\\log(s)}$ for the dimension of the $\\mathbb{Q}(e^{2iπ/N})$-vector space spanned by the values of its $L$-function at integers $\\leq s$ of a given parity. We thus generalize a result Fischler proved in 2021, corresponding to the principal character mod 1. To this end, we construct linear combinations of these values of $L$-function with a refined version of Siegel's lemma, and we apply to them a linear independence criterion generalizing the one used by Fischler. To check the assumptions of this criterion, we rely on a ``Shidlovskii's lemma''."}
{"id": "2512.02905", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02905", "abs": "https://arxiv.org/abs/2512.02905", "authors": ["Fabrizio Andreatta", "Massimo Bertolini", "Marco Adamo Seveso", "Rodolfo Venerucci"], "title": "Syntomic formalism with coefficients", "comment": null, "summary": "This paper provides the technical tools needed in ongoing work of the authors to compute p-adic étale Abel-Jacobi maps in order to obtain explicit reciprocity laws for GSp4. In particular, we define and study syntomic polynomial cohomology for filtered Frobenius log-isocrystals over proper and semistable schemes over the ring of integers of a local field, with smooth generic fiber, endowed with horizontal divisors. We introduce syntomic polynomial cohomology with support, we define Kunneth morphisms, trace maps and cup products, Gysin maps with respect to divisors and we study some of their properties. We establish the relation with Hyodo-Kato cohomology of the special fiber and de Rham cohomology of the generic fiber. We also introduce overconvergent variants with and without support by restricting to open smooth formal subschemes. Most of all, in case that the filtered log-isocrystal is associated to a p-adic local system on the generic fiber, we establish comparison morphisms between étale and syntomic cohomology and compatibilities with Hochschild-Serre morphisms and between Gysin morphisms."}
{"id": "2512.02915", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.02915", "abs": "https://arxiv.org/abs/2512.02915", "authors": ["Paweł Nosal"], "title": "On the distribution of very short character sums", "comment": "16 pages. Comments welcome", "summary": "We establish a central limit theorem of $(1/\\sqrt{h_p})\\sum_{X< n \\leq X+h_p}\\big(\\tfrac{n}{p}\\big)$ for almost all the primes $p$, with $X$ uniformly random in $[g(p)]$, $g(p)$ an arbitrary divergent function growing slower than any power of $p$, provided $(\\log h_p)/(\\log g(p))\\rightarrow 0, \\, h_p \\rightarrow \\infty$ as $p \\rightarrow \\infty$. This improves the recent results of Basak, Nath and Zaharescu, who established this for $g(p) = (\\log p)^A, A>1$. We also use the best currently available tools to expand the original central limit theorem of Davenport and Erdős for all the primes to a shorter interval of starting points.\n  In this paper we exploit a Selberg's sieve argument, recently used by Harper, an intersection result due to Evertse and Silverman and some consequences of the Weil bound on general character sums."}
{"id": "2512.02919", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02919", "abs": "https://arxiv.org/abs/2512.02919", "authors": ["P. Narayanan", "A. Raghuram"], "title": "Congruences for the ratios of Rankin--Selberg $L$-functions", "comment": null, "summary": "A well-known principle states that a congruence between objects should give rise to a corresponding congruence between the special values of $L$-functions attached to these objects. In this article we computationally investigate this principle for Rankin--Selberg $L$-functions attached to pairs of holomorphic cuspforms."}
{"id": "2512.02926", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.02926", "abs": "https://arxiv.org/abs/2512.02926", "authors": ["Victor Bernal Ramirez", "Arturo Jaramillo"], "title": "Additive functionals of Harmonic samples: the conditioned Dickman regime", "comment": null, "summary": "We study the distributional behavior of additive arithmetic functions evaluated at integers drawn from the harmonic distribution. Our main result shows that a broad family of such functions converges in law to conditioned Dickman-type limits. This contrasts with the Gaussian limits of the classical Erdös-Kac theorem for uniform samples. Our perspective combines the probabilistic representation of harmonic samples via independent geometric variables with analytic inputs such as Mertens' approximation, together with a Poissonization procedure"}
{"id": "2512.02927", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.02927", "abs": "https://arxiv.org/abs/2512.02927", "authors": ["P. Narayanan", "A. Raghuram"], "title": "Eisenstein cohomology and congruences for the ratios of Rankin--Selberg $L$-functions", "comment": null, "summary": "A well-known principle states that a congruence between objects should give rise to a corresponding congruence between the special values of $L$-functions attached to these objects. In this article, using the machinery of Eisenstein cohomology after refining it for integral cohomology, we prove an instance of this principle for the ratios of critical values for Rankin--Selberg $L$-functions attached to pairs of holomorphic cuspforms."}
