{"id": "2512.11983", "categories": ["math.NT", "math.NA"], "pdf": "https://arxiv.org/pdf/2512.11983", "abs": "https://arxiv.org/abs/2512.11983", "authors": ["Nat Sothanaphan"], "title": "Irregular Stanley sequences plausibly do not have growth $Θ(n^2/\\log n)$", "comment": "10 pages, 3 figures", "summary": "Stanley sequences starting from the set $\\{0, n\\}$ where $n$ is a positive integer have long been conjectured to be divided into two types: the \"regular\" type where the growth rate is $Θ(n^{\\log_2(3)})$, and the \"irregular\" type where the growth rate is thought to be $Θ(n^2/\\log n)$. A paradigmatic case of a candidate irregular type is $n=4$, although to date no value of $n$ has been proven to have such a growth rate. Here, we provide strong numerical evidence against this conjectured growth rate for $n=4$. Specifically, for $n=4$, it seems plausible that the upper bound is $O(n^2/\\log n)$ but that the lower bound is in fact $Ω(n^{2-δ})$ for some $δ> 0$. This appears to be because the sequence is not totally \"random\" as has been assumed. Limitations of the numerical method here is discussed."}
{"id": "2512.11996", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.11996", "abs": "https://arxiv.org/abs/2512.11996", "authors": ["Chris Calger"], "title": "Isolated points on modular curves of prime-power level", "comment": "18 pages", "summary": "An isolated point on an algebraic curve is a closed point not belonging to a collection of points of the same degree parametrized by $\\mathbf{P}^1$ or a positive rank abelian subvariety of the curve's Jacobian. We study the sets of $j$-invariants, in extensions of bounded degree, that arise as the $j$-invariant of an isolated point on a modular curve. We obtain finiteness results on these sets for families of modular curves with prime-power level. This is related to recent work of Bourdon and Ejder, who classified rational $j$-invariants of isolated points on the families $X_1(n)$ and $X_0(n)$, for $n$ a prime power."}
{"id": "2512.12118", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12118", "abs": "https://arxiv.org/abs/2512.12118", "authors": ["Haonan Gu"], "title": "Expository notes on Spectral Reciprocity with Explicit Transform", "comment": null, "summary": "We assemble three basic analytic inputs -- the Kuznetsov trace formula on $\\mathrm{SL}_2(\\mathbb Z)$ with explicit continuous spectrum, the $\\mathrm{GL}_3$ Voronoi formula, and $t$-aspect second-moment bounds for $L(1/2+it,\\varphi)$ -- into a single framework for a smoothed $\\mathrm{GL}_3$ spectral average. For a fixed Hecke-Maass cusp form $\\varphi$ on $\\mathrm{SL}_3(\\mathbb Z)$, we evaluate a weight-$0$ spectral average of $L(1/2,\\varphi\\times f_j)$ over the $\\mathrm{GL}_2$ Maass spectrum. In the Kuznetsov normalization where the diagonal transform has density $t\\tanh(πt)$, the diagonal contributes exactly $2\\mathcal H_0[h]$; the off-diagonal and the continuous spectrum are bounded with power savings consistent with the currently best unconditional second-moment bounds in the $\\mathrm{GL}_3$ $t$-aspect. The argument is organized into a sequence of steps: normalizations and approximate functional equations, insertion into Kuznetsov, Voronoi summation on $\\mathrm{GL}_3$, a bilinear estimate for the off-diagonal, evaluation of the diagonal and the Eisenstein contribution, moment refinements and parameter optimization, and finally plateau-smooth spectral windows and standard generalizations."}
{"id": "2512.12153", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.12153", "abs": "https://arxiv.org/abs/2512.12153", "authors": ["Christophe Breuil", "Yiwen Ding"], "title": "Hodge filtration and crystalline representations of $\\mathrm{GL}_n$", "comment": "135 pages, with an appendix by Zhixiang Wu", "summary": "Let $p$ be a prime number, $n$ an integer $\\geq 2$ and $ρ$ an $n$-dimensional automorphic $p$-adic Galois representation (for a compact unitary group) such that $r:=ρ\\vert_{\\mathrm{Gal}(\\overline{\\mathbb{Q}_p}/\\mathbb{Q}_p)}$ is crystalline. Under a mild assumption on the Frobenius eigenvalues of $D:=D_{\\mathrm{cris}}(r)$ and under the usual Taylor-Wiles conditions, we show that the locally analytic representation of $\\mathrm{GL}_n(\\mathbb{Q}_p)$ associated to $ρ$ in the corresponding Hecke eigenspace of the completed $H^0$ contains an explicit finite length subrepresentation which determines and only depends on $r$. This generalizes previous results of the second author which assumed that the Hodge filtration on $D$ was as generic as possible. Our approach provides a much more explicit link to this Hodge filtration (in all cases), which allows to study the internal structure of this finite length locally analytic subrepresentation."}
{"id": "2512.12247", "categories": ["math.RT", "math.CO", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.12247", "abs": "https://arxiv.org/abs/2512.12247", "authors": ["Azzurra Ciliberti"], "title": "Skew-symmetrizable cluster algebras from surfaces and symmetric quivers", "comment": "29 pages, many figures. Comments welcome", "summary": "We study skew-symmetrizable cluster algebras $\\mathcal{A}$ associated with unpunctured surfaces $\\mathbf{S}$ endowed with an orientation-preserving involution $σ$. Cluster variables of $\\mathcal{A}$ correspond to $σ$-orbits of arcs of $\\mathbf{S}$, while clusters are given by admissible $σ$-invariant ideal triangulations. We provide a cluster expansion formula for any $σ$-orbit $[γ]$ in terms of perfect matchings of some labeled modified snake graphs constructed from the arcs of $[γ]$. Then, we associate a symmetric finite-dimensional algebra $A$ to any seed of $\\mathcal{A}$, such that non-initial cluster variables bijectively correspond to orthogonal indecomposable $A$-modules. Finally, we exhibit a purely representation-theoretic map from the category of orthogonal $A$-modules to $\\mathcal{A}$.\n  If $\\mathbf{S}$ is a regular polygon, we recover the results proved in arXiv:2403.11308, arXiv:2405.14915, and arXiv:2502.06410 for cluster algebras of type B."}
{"id": "2512.12374", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12374", "abs": "https://arxiv.org/abs/2512.12374", "authors": ["Giacomo Micheli"], "title": "On the Riemann Hypothesis for Drinfeld Modules", "comment": null, "summary": "In this paper we provide a short proof of the Riemann Hypothesis for Drinfeld modules which uses only basic notions from the theory of global function fields and of Drinfeld modules."}
{"id": "2512.12915", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.12915", "abs": "https://arxiv.org/abs/2512.12915", "authors": ["Abhik Pal"], "title": "Lie Superalgebras and Generalized Kazhdan-Lusztig Polynomials", "comment": null, "summary": "We present `liesuperalg` a SageMath package for representation-theoretic calculations involving Lie superalgebras in Type A. Our package introduces functionality to calculate invariants of weights and produce the associated cup diagrams. We expose functionality to calculate characters of irreducible representations, work with combinatorics of generalized Kazhdan-Lusztig polynomials, and determine composition factor multiplicities of indecomposable modules. Our package implements an algorithm to decompose arbitrary modules in terms of irreducible ones in the Grothendeick group of Lie superalgebra representations."}
{"id": "2512.12535", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12535", "abs": "https://arxiv.org/abs/2512.12535", "authors": ["Paul Buckingham"], "title": "On $p$-adic incomplete Mellin transforms and $p$-adic incomplete gamma-functions", "comment": "41 pages", "summary": "Let $r$ be a non-zero rational number. In \\cite{o'desky-richman:incomplete-gamma}, a construction was given of a $p$-adic incomplete gamma-function $Γ_p(\\cdot,r)$ for each prime $p$ for which $|r - 1|_p < 1$. Except in the special case where $r = 1$, only finitely many primes satisfy that condition for a given $r$. In the present paper, we give a construction that works under the much weaker condition that $|r|_p = 1$ using a $p$-adic integral transform we introduced in \\cite{buckingham:factorial}. For any given $r$, this weaker condition holds for all except finitely many primes $p$."}
{"id": "2512.13020", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.13020", "abs": "https://arxiv.org/abs/2512.13020", "authors": ["Jia-Jun Ma", "Zhiwei Yun", "Congling Qiu", "Jia-Liang Zou"], "title": "Theta correspondence and Springer correspondence", "comment": "Comments welcome!", "summary": "In this paper, we obtain an explicit formula for the theta correspondence of unipotent principal-series representations between an even orthogonal and a symplectic group or between general linear groups over a finite field. The formula is in terms of the Springer correspondence. Along the way we prove general results about module categories of Hecke categories arising from spherical varieties, and give a similar formula for the multiplicities of the unipotent principal series representations in the function space of the spherical variety in terms of relative Springer theory."}
{"id": "2512.12542", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12542", "abs": "https://arxiv.org/abs/2512.12542", "authors": ["Taekyun Kim", "Dae san Kim"], "title": "Degenerate Euler-Seidel Matrix Method and Their Applications", "comment": "15 pages", "summary": "This paper introduces a degenerate version of the Euler-Seidel matrix method by incorporating a parameter lambda into the classical recurrence relation. The standard Euler-Seidel method relates the generating functions of an initial sequence and its final sequence via Seidel's formula, Our generalized method establishes transformation formulas using lambda-generalized binomial identities and yields a degenerate Seidel's formula for the exponential generating functions. The results are applied to study and derive new combinatorial identities for sequences like the degenerate Bell and Fubini numbers and polynomials."}
{"id": "2512.13218", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.13218", "abs": "https://arxiv.org/abs/2512.13218", "authors": ["Jiaqun Wei", "Yu Zhou"], "title": "AIR tilting subcategories of extended hearts", "comment": "25 pages. Any comments are welcome", "summary": "We introduce the notion of AIR tilting subcategories of extended hearts of $t$-structures on a triangulated category associated with silting subcategories. This notion extends $τ_{[d]}$-tilting pairs of extended finitely generated modules over finite-dimensional algebras to a broader framework, encompassing extended large modules over unitary rings as well as truncated subcategories of finite-dimensional derived categories of proper non-positive differential graded algebras. Within this framework, we establish a bijection between AIR tilting subcategories and silting subcategories. We further define quasi-tilting and tilting subcategories of extended hearts, generalizing the corresponding notions in module categories, and investigate their fundamental properties and the relationships among these three tilting-related concepts."}
{"id": "2512.12546", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12546", "abs": "https://arxiv.org/abs/2512.12546", "authors": ["Andrew R. Booker", "Min Lee"], "title": "Dimensions of spaces of modular forms", "comment": "9 pages", "summary": "We prove a conjecture of Ross concerning the value distribution of $\\dim S_2^{\\rm new}(Γ_0(N))$ for $N\\in\\mathbb{N}$, as well as analogous results for general weight $k\\in2\\mathbb{N}$ and the full and twist-minimal spaces $S_k(Γ_0(N))$, $S_k^{\\rm min}(Γ_0(N))$."}
{"id": "2512.13273", "categories": ["math.RT", "math.CT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.13273", "abs": "https://arxiv.org/abs/2512.13273", "authors": ["Jieyu Chen", "Zengqiang Lin"], "title": "Intervals of torsion pairs and generalized Happel-Reiten-Smalø tilting", "comment": "19 pages", "summary": "Let $\\mathcal{A}$ be an abelian category with a torsion pair $(\\mathcal{T},\\mathcal{F})$. Happel-Reiten-Smalo tilting provides a method to construct a new abelian category $\\mathcal{B}$ with a torsion pair associated to $(\\mathcal{T},\\mathcal{F})$, which is exactly the heart of a certain $t$-structure on the bounded derived category $D^b(\\mathcal{A})$. In this paper, we mainly study generalized HRS tilting. We first show that an interval of torsion pairs in extriangulated categories with negative first extensions is bijectively associated with torsion pairs in the corresponding heart, which yields several new observations in triangulated categories. Then we obtain a generalization of HRS tilting by replacing hearts of $t$-structures with extended hearts. As an application, we show that certain $t$-structures on triangulated subcategories can be extended to $t$-structures on the whole triangulated categories."}
{"id": "2512.12681", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12681", "abs": "https://arxiv.org/abs/2512.12681", "authors": ["Hung Viet Chu", "Steven J. Miller", "Garrett Tresch"], "title": "Problems Regarding a Pair of Diophantine Equations", "comment": "12 pages", "summary": "For two relatively prime positive integers $a, b\\in \\mathbb{N}$, it is known that exactly one of the two Diophantine equations $$ax + by \\ =\\ \\frac{(a-1)(b-1)}{2}\\ \\mbox{ and }\\ 1 + ax + by \\ =\\ \\frac{(a-1)(b-1)}{2}$$ has a nonnegative integral solution $(x, y)$. Furthermore, the solution is unique. In this note, we summarize recent results and some new ones on the solution of the two equations and provide an overview of problems for future investigation, some of which were presented at the 2025 International Conference on Class Groups of Number Fields and Related Topics."}
{"id": "2512.13406", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2512.13406", "abs": "https://arxiv.org/abs/2512.13406", "authors": ["Adele Maltempo", "Carolina Vallejo"], "title": "The McKay conjecture with group automorphisms and the Okuyama-Wajima argument", "comment": "Accepted in the Journal of Pure and Applied Algebra", "summary": "Let $N$ be normal subgroup of a finite group $G$, $p$ be a prime, $P$ be a Sylow $p$-subgroup of $G$ and $θ$ be a $P$-invariant irreducible character of $N$. Suppose that $G/N$ is a $p$-solvable group. In this note we show that, whenever a finite group $A$ acts on $G$ stabilizing $P$, there exists an $A$-equivariant McKay bijection between irreducible characters lying over $θ$ of degree prime to $p$ of $G$ and $\\textbf{N}_G(P)$. This is a consequence of a recent result of D. Rossi. Our approach here is independent from Rossi's and follows the original idea of the proof of the McKay conjecture for $p$-solvable groups. In particular, we rely on the so-called Okuyama-Wajima argument to deal with characters above Glauberman correspondents. For this purpose, we generalize a classical result of P. X. Gallagher on the number of irreducible characters of $G$ lying over $θ$."}
{"id": "2512.12838", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.12838", "abs": "https://arxiv.org/abs/2512.12838", "authors": ["Tim Santens"], "title": "The leading constant in Malle's conjecture over function fields", "comment": "38 pages, comments welcome", "summary": "We prove the analogue of Malle's conjecture for the global function field $\\F_q(t)$ with $q$ sufficiently large, including a precise formula for the leading constant. The main ingredients are the recent breakthrough of Landesman--Levy on the stable homology of Hurwitz spaces, a novel interpretation of the Frobenius fixed components of Hurwitz spaces in terms of the Brauer group of the stack $BG$ and an interpretation of the number of $\\F_q$ points of configuration spaces as a certain Tamagawa volume."}
{"id": "2512.13556", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.13556", "abs": "https://arxiv.org/abs/2512.13556", "authors": ["Sadie Lipman"], "title": "Unipotent groups with trivial $\\mathbb{L}$-packets are easy", "comment": "10 pages", "summary": "In 2006, Boyarchenko and Drinfeld conjectured that for a unipotent algebraic group over $\\overline{\\mathbb{F}}_q$, every geometric point is contained in the neutral connected component of its centralizer if and only if its $\\mathbb{L}$-packets of character sheaves are singletons. In 2013, Boyarchenko proved the \"only if\" direction of this conjecture. In this paper, we complete the proof. Along the way, we explore the relationship between general algebraic groups satisfying this property and their Asai twisting operator."}
{"id": "2512.12841", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.12841", "abs": "https://arxiv.org/abs/2512.12841", "authors": ["Gregory Dresden", "Xiaoya Gao"], "title": "Further Extensions of Sury's Identity", "comment": "22 pages", "summary": "The equation commonly known as Sury's identity is a deceptively simple summation formula that connects the Lucas numbers, Fibonacci numbers, and powers of two. Many authors have given extensions and generalizations over the years; in this paper, we take a different approach that allows us to produce a good number of new summation formulas, all from elementary (but non-trivial) methods."}
{"id": "2512.12153", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.12153", "abs": "https://arxiv.org/abs/2512.12153", "authors": ["Christophe Breuil", "Yiwen Ding"], "title": "Hodge filtration and crystalline representations of $\\mathrm{GL}_n$", "comment": "135 pages, with an appendix by Zhixiang Wu", "summary": "Let $p$ be a prime number, $n$ an integer $\\geq 2$ and $ρ$ an $n$-dimensional automorphic $p$-adic Galois representation (for a compact unitary group) such that $r:=ρ\\vert_{\\mathrm{Gal}(\\overline{\\mathbb{Q}_p}/\\mathbb{Q}_p)}$ is crystalline. Under a mild assumption on the Frobenius eigenvalues of $D:=D_{\\mathrm{cris}}(r)$ and under the usual Taylor-Wiles conditions, we show that the locally analytic representation of $\\mathrm{GL}_n(\\mathbb{Q}_p)$ associated to $ρ$ in the corresponding Hecke eigenspace of the completed $H^0$ contains an explicit finite length subrepresentation which determines and only depends on $r$. This generalizes previous results of the second author which assumed that the Hodge filtration on $D$ was as generic as possible. Our approach provides a much more explicit link to this Hodge filtration (in all cases), which allows to study the internal structure of this finite length locally analytic subrepresentation."}
{"id": "2512.12890", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12890", "abs": "https://arxiv.org/abs/2512.12890", "authors": ["Raffaele Marcovecchio"], "title": "Multiple Legendre polynomials in Diophantine approximation", "comment": "24 pages", "summary": "We construct a class of multiple Legendre polynomials and prove that they satisfy an Apéry-like recurrence. We give new upper bounds of the approximation measures of logarithms of rational numbers by algebraic numbers of bounded degree. We prove e.g. that the nonquadraticity exponent of $\\log 2$ is bounded from above by $12.841618...$, thus improving upon a recent result of the author. Our construction also yields some other known results."}
{"id": "2512.12899", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.12899", "abs": "https://arxiv.org/abs/2512.12899", "authors": ["Lewis Combes"], "title": "Computing Selmer groups associated to mod p Galois representations", "comment": null, "summary": "We present methods to compute Selmer groups associated to mod p Galois representations rho over a number field K, with a particular focus on comparing their ranks with periods coming from cohomology classes associated to rho by Serre's conjecture. This provides evidence for a loose version of a \"mod p Bloch-Kato conjecture\", where the vanishing of a period is predicted to capture the presence of rank in a Selmer group. Our methods are explicit, and implemented in Magma."}
{"id": "2512.13091", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.13091", "abs": "https://arxiv.org/abs/2512.13091", "authors": ["Zhizhong Huang"], "title": "Quantitative strong approximation for ternary quadratic forms III", "comment": null, "summary": "We prove asymptotic formulas for counting (primitive) integral points with local conditions on the (punctured) affine cone defined by a non-singular integral ternary quadratic form, and we relate our results to the Brauer--Manin obstruction. Our approach is based on the $δ$-variant of the Hardy--Littlewood circle method developed by Heath-Brown."}
{"id": "2512.13167", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.13167", "abs": "https://arxiv.org/abs/2512.13167", "authors": ["Kathrin Bringmann", "Jay Jorgenson", "Lejla Smajlović"], "title": "On a generating function of Niebur-Poincaré series", "comment": "24 pages", "summary": "Let $Γ\\subset PSL_2(\\mathbb{R})$ be a Fuchsian group of the first kind which has a cusp $i\\infty$ of width one. In this paper, we first consider a generating function formed with the Niebur--Poincaré series $\\{F_{m,s}(τ)\\}_{m\\ge 1}$ associated to $i\\infty$. We prove a relation between the continuation of this generating function to $s=1$ with the resolvent kernel associated to the hyperbolic Laplacian and the non-holomorphic Eisenstein series associated to $i\\infty$, also at $s=1$. Secondly, we show that, for any $s\\in \\mathbb{N}$, the generating function equals Poincaré type series involving polylogarithms. We also consider a generating function formed with derivatives in $s$ of the Niebur--Poincaré series and prove that the continuation of the generating function at $s=1$ can be expressed in terms of $Γ$-periodization of a point-pair invariant involving the Rogers dilogarithm and the Kronecker limit function associated to the non-holomorphic Eisenstein series."}
{"id": "2512.13180", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.13180", "abs": "https://arxiv.org/abs/2512.13180", "authors": ["Émilie Charlier", "Savinien Kreczman"], "title": "Numeration systems without a dominant root and regularity", "comment": "51 pages, 6 figures", "summary": "Positional numeration systems are a large family of numeration systems used to represent natural numbers. Whether the set of all representations forms a regular language or not is one of the most important questions that can be asked of such a system. This question was investigated in a 1998 article by Hollander. Central to his analysis is a property linking positional numeration systems and Rényi numeration systems, which use a real base to represent real numbers. However, this link only exists when the initial numeration system has a dominant root, which is not a necessary condition for regularity. In this article, we show a more general link between positional numeration systems and alternate base numeration systems, a family generalizing Rényi systems. We then take advantage of this link to provide a full characterization of those numeration systems that generate a regular language. We also discuss the effectiveness of our method, and comment Hollander's results and conjecture in the light of ours."}
{"id": "2512.13312", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.13312", "abs": "https://arxiv.org/abs/2512.13312", "authors": ["Yu Mao", "Mohamed Saidi"], "title": "Open Homomorphisms between $m$-step Solvable Galois Groups Compatible with the Cyclotomic Characters", "comment": null, "summary": "In \\cite{Ho3}, Hoshi proved that open homomorphisms between solvably closed Galois groups of number fields which are compatible with the cyclotomic characters arise from field embeddings. In this paper, we will prove an $m$-step solvable version of Hoshi's result. More precisely, if $K$ and $L$ are number fields, we will prove that given an open homomorphism between the maximal $m+3$-step solvable Galois groups of $K$ and $L$, where $m \\geq 2$, and the induced open homomorphism between the corresponding maximal $m$-step solvable Galois groups, then the latter arises from a field embedding if and only if the open homomorphism between the $m+3$-step solvable (and hence also the $m$-step solvable) Galois groups is compatible with the cyclotomic characters of $K$ and $L$."}
{"id": "2512.13669", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.13669", "abs": "https://arxiv.org/abs/2512.13669", "authors": ["Tony Haddad"], "title": "Poisson--Dirichlet approximation for counting integers with divisors in an interval", "comment": "16 pages", "summary": "We give a simple inequality that compares the laws of two random variables taking values in a convex set of any normed vector space. By combining it with Arratia's coupling, recently refined by Koukoulopoulos and the author, we present a general strategy to reduce the problem of finding an asymptotic formula for the number of integers whose prime factorization falls into any given subset of $\\ell^1(\\mathbb R)$, to finding upper bounds for two key probabilities measuring proximity to the boundary of the subset in question.\n  We apply this strategy to give an asymptotic formula for counting integers in $[1, x]$ that have a divisor in an interval $(y, z)$ with $z/y \\to \\infty$ as $x \\to \\infty$."}
