{"id": "2512.06480", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.06480", "abs": "https://arxiv.org/abs/2512.06480", "authors": ["Shaolong Han"], "title": "Rogers-Ramanujan type identities at $Λ_0$ from perfect crystals of exceptional quantum affine algebras", "comment": null, "summary": "We derive Rogers--Ramanujan type partition identities at the fundamental weight $Λ_0$ for the exceptional affine types $G_2^{(1)}$, $D_4^{(3)}$, $F_4^{(1)}$, $E_6^{(2)}$, $E_6^{(1)}$, $E_7^{(1)}$ and $E_8^{(1)}$. Our starting point is the Dousse--Konan reformulation of the $(\\mathrm{KMN})^2$ crystal character formula, applied to the level-one perfect crystal $B=B(θ)\\sqcup B(0)$ of Benkart--Frenkel--Kang--Lee with ground element $φ\\in B(0)$. This realizes the normalized character $e^{-Λ_0}\\mathrm{ch} L(Λ_0)$ as generating functions of grounded $B$-colored partitions governed locally by the crystal energy. After principal specialization, we obtain a colored partition model subject to explicit difference, congruence, and initial conditions. On the product side, under the same specialization, the Weyl--Kac character formula yields an explicit Euler-type product, equivalently the generating function for partitions with parts in a concrete allowed set. Comparing the two specializations gives coefficientwise equalities of generating functions. A key computational feature is that the difference matrix can be produced from the crystal data without explicitly computing the energy function. For each type we tabulate the congruence data, forbidden initial parts, and the full difference matrix, and we provide reproducible coefficient checks."}
{"id": "2512.06623", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.06623", "abs": "https://arxiv.org/abs/2512.06623", "authors": ["Mohamad Haerizadeh", "Toshiya Yurikusa"], "title": "Stable Brauer-Thrall II' conjecture for finite-dimensional Jacobian algebras", "comment": "12 pages", "summary": "We prove that finite-dimensional Jacobian algebras associated with non-degenerate quivers with potentials satisfy the stable Brauer-Thrall II' conjecture. In particular, this implies that the brick Brauer-Thrall II' conjecture (also known as the $τ$-Brauer-Thrall II' conjecture) holds for finite-dimensional Jacobian algebras."}
{"id": "2512.06680", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.06680", "abs": "https://arxiv.org/abs/2512.06680", "authors": ["Quentin Ehret"], "title": "On Poisson superalgebras in characteristic 2", "comment": null, "summary": "This paper is devoted to the study of Poisson superalgebras over fields of characteristic $2$. We investigate their representations, semidirect products, cohomology, formal deformations, and universal enveloping algebras. We also introduce Lie-Rinehart superalgebras in characteristic $2$ and clarify their connections with Poisson superalgebras. In particular, we show that the universal enveloping algebra of a Poisson superalgebra coincides with the universal enveloping algebra of an associated Lie-Rinehart superalgebra. We also compute examples and initiate the study of pre-Poisson superalgebras."}
{"id": "2512.06856", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2512.06856", "abs": "https://arxiv.org/abs/2512.06856", "authors": ["Xin Huang"], "title": "On stable equivalences of Morita type with twisted diagonal vertices", "comment": null, "summary": "We give a new proof, by using simplified terminology and notation, to a result of Puig stating that if a bimodule of two block algebras of finite groups over an algebraically closed field induces a stable equivalence of Morita type and has a twisted diagonal vertex, then it has an endopermutation module as a source. We also extend this result to arbitrary fields under a mild assumption."}
{"id": "2512.06446", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.06446", "abs": "https://arxiv.org/abs/2512.06446", "authors": ["Scott Duke Kominers"], "title": "Uniform Bounds for Digit-Appending Fibonacci Walks", "comment": "6 pages", "summary": "Building on the work of Miller et al. [Fibonacci Quarterly, 2022], we show that it is impossible to \"walk to infinity\" along the Fibonacci sequence in any integer base $b\\geq 2$ when at most $N$ digits are appended per step. Our proof method is base-independent, yielding the bound \\[L \\;\\leq\\; 2N\\log_\\varphi b \\,+\\, O(1),\\] uniformly in the starting term, without relying on base-specific periodicity computations (here, $\\varphi=\\frac{1+\\sqrt{5}}{2}$). Our approach extends to certain Lucas sequences."}
{"id": "2512.07014", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.07014", "abs": "https://arxiv.org/abs/2512.07014", "authors": ["Leticia Barchini", "András C. Lőrincz"], "title": "Some unipotent Arthur packets for p-adic split F4", "comment": null, "summary": "Let $G(k)$ be the split form of the simple exceptional p-adic group of type $F_4$, and let $\\mathcal O = F_4(a_3)$ be the minimal distinguished nilpotent orbit. Our main result concerns the class of unipotent representations with cuspidal support at infinitesimal character $Λ$ determined by $\\mathcal O$. These representations are parameterized by local systems, $\\{(S, \\mathcal L)\\}$. We compute the characteristic cycles of the perverse sheaves $\\text{IC}(S, \\mathcal L)$ and determine all micro-packets in the sense of [Vo93]. In [CMBO24], the authors introduced a notion of weak Arthur packets in the p-adic setting. They conjectured that weak Arthur packets are unions of Arthur packets, in an appropriate sense. We verify that weak Arthur packets are unions of micro-packets."}
{"id": "2512.06588", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.06588", "abs": "https://arxiv.org/abs/2512.06588", "authors": ["Calvin Yost-Wolff", "Elad Zelingher"], "title": "On Jacobi sums arising from the classical doubling method", "comment": "44 pages. Comments are welcome!", "summary": "We define the notion of a non-abelian Jacobi sum $\\mathcal{J}^{\\mathrm{dbl}}\\left(π, χ\\right)$ attached to an irreducible representation $π$ of a general linear group or a classical group over a finite field and a character $χ$ of the multiplicative group of the finite field or its quadratic extension. These sums emerge in the study of the doubling method of Piatetski-Shapiro--Rallis and Lapid--Rallis. For general linear groups, we express these non-abelian Jacobi sums in terms of Kondo's non-abelian Gauss sums. For classical groups and for characters that are not conjugate-dual, we give an explicit formula for these non-abelian Jacobi sums in terms of Gauss sums attached to the Deligne--Lusztig data of the representation, and we prove that these Jacobi sums are constant on geometric Lusztig series. Our results rely on a multiplicativity result of non-abelian Jacobi sums obtained by Girsch--Zelingher."}
{"id": "2512.07254", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.07254", "abs": "https://arxiv.org/abs/2512.07254", "authors": ["Yi Wen", "Naihuan Jing", "Jiancai Sun", "Honglian Zhang"], "title": "Non-weight modules over generalized Heisenberg-Virasoro algebra of rank two", "comment": "16pp", "summary": "In this paper, we study a class of non-weight modules over the generalized Heisenberg-Virasoro algebra of rank two $\\widetilde{L}(p_1, p_2)$. We construct a family of irreducible\n  $\\widetilde{L}(p_1, p_2)$-modules, determine the isomorphism classes and show that these modules exhaust all the $\\widetilde{L}(p_1, p_2)$-modules that are free modules of rank one over the Cartan subalgebra."}
{"id": "2512.06672", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.06672", "abs": "https://arxiv.org/abs/2512.06672", "authors": ["Yuri Bilu", "Hideaki Ishikawa", "Takao Komatsu"], "title": "Some explicit values of a $q$-multiple zeta function whose denominator power is not uniform", "comment": null, "summary": "One of the generalizations of multiple zeta values is the $q$-version, and in the case of finite sums, they may be expressed explicitly in polynomial form. Several results have been found when the powers of the factors in the denominator are equal and when they are small. In this paper, we give explicit formulas for the case when the powers are unequal and are small."}
{"id": "2512.07369", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2512.07369", "abs": "https://arxiv.org/abs/2512.07369", "authors": ["Xin Huang", "Deniz Yılmaz"], "title": "Alperin's weight conjecture, Galois automorphisms, alternating sums, and functorial equivalences", "comment": null, "summary": "We show that functorial equivalences can offer new insight into the blockwise Galois Alperin weight conjecture (BGAWC). Inspired by Knörr and Robinson's work, we first formulate the BGAWC in terms of alternating sums indexed by chains of $p$-subgroups, and we also give a functorial reformulation in the Grothendieck group of diagonal $p$-permutation functors. We prove that these formulations are equivalent. We further show that if a functorial equivalence between a block with abelian defect group and its Brauer correspondent descends to the minimal field of the block, then the BGAWC holds for that block. Finally, we prove that Galois conjugate blocks are functorially equivalent over an algebraically closed field of characteristic zero."}
{"id": "2512.06741", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.06741", "abs": "https://arxiv.org/abs/2512.06741", "authors": ["Wanjin Cheng", "Xinyun Zhang"], "title": "Hausdorff dimension of the Cartesian product of exact approximation set in $β$-expansions", "comment": null, "summary": "In this paper, we study the metrical theory of Cartesian products of exact approximation sets in $β$-expansions. More precisely, for an integer $d \\ge 2$ and real numbers $β_i > 1$ $(1 \\le i \\le d)$, we consider the set of points $x_i \\in [0,1)$ is approximable by its convergents in the $β_i$-expansion to order $ψ_i$, but not to any better order. For any non-increasing functions $ψ_i$, we determine the Hausdorff dimension of the Cartesian product of these sets."}
{"id": "2512.07586", "categories": ["math.RT", "hep-th", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.07586", "abs": "https://arxiv.org/abs/2512.07586", "authors": ["Hongfei Shu", "Peng Zhao", "Rui-Dong Zhu", "Hao Zou"], "title": "A Difference Formula for Tensor-power Multiplicities", "comment": "27 pages + appendices", "summary": "A novel combinatorial formula is developed for for tensor product multiplicities in representation theory. We introduce a difference formula linking these multiplicities to restricted occupancy coefficients via a shifted operator. This method is extended to derive branching rules for subalgebras and is conjecturally applied to A-type Lie superalgebras."}
{"id": "2512.06937", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.06937", "abs": "https://arxiv.org/abs/2512.06937", "authors": ["S. G. Dani", "Ojas Sahasrabudhe"], "title": "Continued fraction expansions of complex numbers, Lagrange's theorem, and badly approximable numbers", "comment": "This paper represents a part of our unpublished preprint ArXiv (arXiv:2102.11769), developed further and remodelled. Other parts of the preprint are also proposed to be dealt with similarly in future", "summary": "This paper concerns extension of the classical Lagrange theorem, on the eventual periodicity of continued fraction expansions of quadratic surds, and the versions of it found in the literature in the case of complex numbers. In this respect, firstly, we adopt a more general notion of continued fraction expansions, in place of those arising from the nearest integer algorithms. Secondly, the issue is formulated in terms of zeros of quadratic and Hermitian forms, and a result is proved in terms of certain sequences of matrices associated with them, via continued fraction expansions. The result may be considered as a matrix analogue of Lagrange's theorem in the general framework. The unified approach leads to generalizations of the Lagrange theorem on one hand, and an extended version of a result of Hines (2019) on badly approximable complex numbers, on the other hand."}
{"id": "2512.06588", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.06588", "abs": "https://arxiv.org/abs/2512.06588", "authors": ["Calvin Yost-Wolff", "Elad Zelingher"], "title": "On Jacobi sums arising from the classical doubling method", "comment": "44 pages. Comments are welcome!", "summary": "We define the notion of a non-abelian Jacobi sum $\\mathcal{J}^{\\mathrm{dbl}}\\left(π, χ\\right)$ attached to an irreducible representation $π$ of a general linear group or a classical group over a finite field and a character $χ$ of the multiplicative group of the finite field or its quadratic extension. These sums emerge in the study of the doubling method of Piatetski-Shapiro--Rallis and Lapid--Rallis. For general linear groups, we express these non-abelian Jacobi sums in terms of Kondo's non-abelian Gauss sums. For classical groups and for characters that are not conjugate-dual, we give an explicit formula for these non-abelian Jacobi sums in terms of Gauss sums attached to the Deligne--Lusztig data of the representation, and we prove that these Jacobi sums are constant on geometric Lusztig series. Our results rely on a multiplicativity result of non-abelian Jacobi sums obtained by Girsch--Zelingher."}
{"id": "2512.07139", "categories": ["math.NT", "math.CA"], "pdf": "https://arxiv.org/pdf/2512.07139", "abs": "https://arxiv.org/abs/2512.07139", "authors": ["Wenxia Li", "Zhiqiang Wang", "Jiuzhou Zhao"], "title": "Rational points in Cantor sets in the complex plane", "comment": "13 pages", "summary": "Let $K$ be an imaginary quadratic field and let $\\mathcal{O}_K$ be the ring of algebraic integers of $K$. For $α\\in \\mathcal{O}_K$ with $|α| > 1$, define \\[ \\mathcal{D}_α= \\bigcup_{n=0}^\\infty \\frac{\\mathcal{O}_K}{α^n}. \\] For $β\\in \\mathcal{O}_K$ with $|β|>1$ and a finite subset $A \\subset \\mathcal{O}_K$, define \\[ S_{β,A} = \\bigg\\{ \\sum_{k=1}^{\\infty} \\frac{a_k}{β^k}: \\; a_k \\in A \\;\\forall k \\in \\mathbb{N} \\bigg\\}. \\] Suppose that $α$ and $β$ are relatively prime. In this paper, we show that if $\\dim_{\\mathrm{H}} S_{β,A} < 1$, then the intersection $\\mathcal{D}_α\\cap S_{β,A}$ is a finite set. In general, the threshold for the Hausdorff dimension of $S_{β,A}$ is sharp. If we further assume that $\\mathcal{O}_K$ is a unique factorization domain and that $\\overlineα$ and $α$ are relatively prime, then we establish the finiteness of the intersection under the weaker condition $\\dim_{\\mathrm{H}} S_{β,A} < 2$. This extends the previously known results on the real line."}
{"id": "2512.07204", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.07204", "abs": "https://arxiv.org/abs/2512.07204", "authors": ["James Wyatt"], "title": "Metric diophantine approximation on fractals", "comment": null, "summary": "Inspired by a problem proposed by Mahler, we will address the following related question, `How well can irrationals in a missing digit set be approximated by rationals with polynomial denominators?' and prove some related results. To achieve this, we will be closely looking at Khintchine's theorem, particularly the convergence case and aim to prove a Khintchine-like convergence theorem for missing digit sets with large bases and rationals with polynomial denominators."}
{"id": "2512.07336", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.07336", "abs": "https://arxiv.org/abs/2512.07336", "authors": ["Zhen Chen", "Junrong Luo"], "title": "Multiple Mertens theorems for arithmetic progressions", "comment": null, "summary": "We establish asymptotic formulas for sums of reciprocals of primes in arithmetic progressions, generalizing recent results on multiple Mertens evaluations by Tenenbaum, Qi, and Hu. Specifically, for any fixed constant $K>0$, we derive asymptotic expansions for the sums $\n\\sum_{\\substack{p_1\\cdots p_n\\leq x \\\\ p_i\\equiv h_i \\pmod{m_i} \\\\ i=1,\\dots, n}}\\frac{1}{p_1\\cdots p_n} $\nand the corresponding log-weighted sums. A key feature of our results is that the error terms hold \\emph{uniformly} for moduli satisfying $m_i \\le (\\log x)^K$, a range accessible via the Siegel-Walfisz theorem. Furthermore, we identify the coefficients of the asymptotic expansion with the Taylor series of the reciprocal Gamma function, $1/Γ(z)$, providing a structural explanation for the lower-order terms."}
{"id": "2512.07416", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.07416", "abs": "https://arxiv.org/abs/2512.07416", "authors": ["Pınar Akkanat", "Levent Kargın"], "title": "Harmonic Geometric Polynomials via Geometric Polynomials and Their Applications", "comment": "16 pages", "summary": "The aim of this study is to show that harmonic geometric polynomials can be represented in terms of geometric polynomials. This problem was first considered by Keller [14]; however, the corresponding coefficients were not fully determined. In the present work, we provide several explicit representations of harmonic geometric polynomials in terms of geometric polynomials. Moreover, several applications of one of these representations are subsequently developed. In particular, we obtain a generalization of the classical identity for the harmonic numbers, compute an integral involving harmonic geometric polynomials and an integral involving products of harmonic geometric and geometric polynomials in terms of Bernoulli numbers. These integral formulas lead to new explicit expressions for Bernoulli numbers. In addition, we give several recurrence relations for harmonic geometric polynomials and evaluate a finite sum involving harmonic numbers and positive powers of integers."}
{"id": "2512.07438", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.07438", "abs": "https://arxiv.org/abs/2512.07438", "authors": ["Shusei Narumi", "Yohei Tachiya"], "title": "On the number of $k$-full integers between three successive $k$th powers", "comment": "12 pages", "summary": "Let $k\\geq2$ be an integer. The aim of this paper is to investigate the distribution of $k$-full integers in consecutive intervals determined by three successive $k$th powers. More precisely, for any integers $\\ell,m\\ge0$, we establish the explicit asymptotic density for the set of integers $n$ such that the intervals $(n^k, (n+1)^k)$ and $((n+1)^k, (n+2)^k)$ contain exactly $\\ell$ and $m$ $k$-full integers, respectively. As an application, we prove that there are infinitely many integers $n$ for which the interval $(n^k,(n+2)^k)$ contains no $k$-full integer other than the central $k$th power $(n+1)^k$, thereby providing a more general answer to Shiu's question."}
{"id": "2512.07607", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.07607", "abs": "https://arxiv.org/abs/2512.07607", "authors": ["Dawid E. Kędzierski", "Piotr Krasoń"], "title": "Homological Methods in the Generalization of Drinfeld Modules", "comment": "60 pages", "summary": "We introduce and study a natural class of Anderson t- modules, called triangular t-modules, characterized by having Drinfeld modules as their $τ$-composition factors. They form a homologically meaningful generalization of Drinfeld modules and exhibit rich arithmetic structure.\\smallskip\n  We establish criteria for purity, strict and almost strict, and develop a reduction procedure that lowers the degrees of the defining biderivations. As a consequence, every almost strictly pure triangular t-module becomes strictly pure after a finite base extension.\n  We then investigate morphisms and isogenies between triangular t-modules, provide a characterization of triangular isogenies, and describe the algebra of endomorphisms, including a criterion for commutativity. On the analytic side, we show that all triangular t- modules are uniformizable and establish finiteness and purity criteria with consequences for Taelman's conjecture.\n  Finally, we develop a duality theory for triangular t- modules and their biderivations, proving compatibility with $τ$-composition series and establishing analogues of the Cartier-Nishi theorem and the Weil-Barsotti formula."}
{"id": "2512.07654", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.07654", "abs": "https://arxiv.org/abs/2512.07654", "authors": ["Boaz Moerman"], "title": "$\\mathcal{M}$-points of bounded height", "comment": "47 pages", "summary": "We initiate a general quantitative study of sets of $\\mathcal{M}$-points, which are special subsets of rational points, generalizing Campana points, Darmon points, and squarefree solutions of Diophantine equations. We propose an asymptotic formula for the number of $\\mathcal{M}$-points of bounded height on rationally connected varieties, extending Manin's conjecture as well as its generalization to Campana points by Pieropan, Smeets, Tanimoto and Várilly-Alvarado. Finally, we show that the conjecture explains several previously established results in arithmetic statistics."}
{"id": "2512.07655", "categories": ["math.NT", "math.AG", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.07655", "abs": "https://arxiv.org/abs/2512.07655", "authors": ["Niki Myrto Mavraki", "Jit Wu Yap"], "title": "A quantitative dynamical Zhang fundamental inequality and Bogomolov-type problems", "comment": null, "summary": "We prove a quantitative version of Zhang's fundamental inequality for heights attached to polarizable endomorphisms. As an application, we obtain a gap principle for the Néron-Tate height on abelian varieties over function fields of arbitrary transcendence degree and characteristic zero, extending the result of Gao-Ge-Kühne. We also establish instances of effective gap principles for regular polynomial endomorphisms of $\\mathbb{P}^2$, in the sense that all constants can are explicit. These yield effective instances of uniformity in the dynamical Bogomolov conjecture in both the arithmetic and geometric settings, including examples in prime characteristic."}
