{"id": "2511.14180", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.14180", "abs": "https://arxiv.org/abs/2511.14180", "authors": ["Dawei Shen"], "title": "The resolution quiver of Nakayama algebras which are minimal Auslander-Gorenstein", "comment": "13pages", "summary": "Let $A$ be a Nakayama algebra. Using Ringel's resolution quiver, we give a criterion to decide whether $A$ is minimal Auslander-Gorenstein. The criterion strongly relies on the parity of the selfinjective dimension of $A$."}
{"id": "2511.14750", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2511.14750", "abs": "https://arxiv.org/abs/2511.14750", "authors": ["Fan Gao", "Baiying Liu", "Chi-Heng Lo", "Freydoon Shahidi"], "title": "Covering Barbasch-Vogan duality and wavefront sets of genuine representations", "comment": "Comments are welcome", "summary": "In this paper, we start by defining a covering Barbasch-Vogan duality and prove some of its properties. Then, for genuine representations of $p$-adic covering groups we formulate an upper bound conjecture for their wavefront sets using this covering Barbasch-Vogan duality and reduce it to anti-discrete representations. The formulation generalizes that of Ciubotaru-Kim and Hazeltine-Liu-Lo-Shahidi for linear algebraic groups. We prove this upper bound conjecture for Kazhdan-Patterson coverings of general linear groups."}
{"id": "2511.14382", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.14382", "abs": "https://arxiv.org/abs/2511.14382", "authors": ["Eknath Ghate"], "title": "The semi-stable Local Langlands Correspondence", "comment": "45 pages", "summary": "We start with background that goes into an Iwahori-theoretic reformulation of the mod $p$ Local Langlands Correspondence (§2). We then explain some classical $p$-adic functional analytic results (§3) that go into defining the $p$-adic Banach space (§4) attached to a two-dimensional semi-stable representation $V_{k,{\\mathcal L}}$ of the Galois group of ${\\mathbb Q}_p$ of weight $k$ and ${\\mathcal L}$-invariant ${\\mathcal L}$ under the $p$-adic Local Langlands correspondence. We then sketch how to compute the reduction of a lattice in this Banach space, which along with the Iwahori mod $p$ LLC, allows one to completely determine the mod $p$ reduction of $V_{k,{\\mathcal L}}$ for all weights $3 \\leq k \\leq p+1$ and all ${\\mathcal L}$ for $p \\geq 5$ (§5). These notes are a summary of our joint work with Anand Chitrao [CG24]. Emphasis is placed on motivation and background rather than completeness."}
{"id": "2511.13879", "categories": ["math.NT", "math.NA"], "pdf": "https://arxiv.org/pdf/2511.13879", "abs": "https://arxiv.org/abs/2511.13879", "authors": ["Hannah Kravitz"], "title": "Computational study of irrational rotations via exact discontinuity tracking", "comment": "22 pages, 9 figures in main body, 10 figures in appendix", "summary": "The discrepancy sum $D_N(x,ρ)$ for irrational rotations has been of interest to mathematicians for over a century. While historically studied in an ``almost-everywhere'' or asymptotic sense, $D_N$ for finite N is increasingly an object of interest for its nontrivial properties that depend on the Diophantine properties of $ρ$. This behavior is periodic in N with respect to the quotients of the continued fraction convergents, which grow quickly for some irrationals. Thus the stable computation of the sum is necessary for forming conjectures about its properties. However, computing the exact value of the sum and its corresponding probability density function (pdf) is notoriously difficult due to numerical instability in the sum itself and the failure of sampling methods to capture its jump discontinuities. This paper presents a novel computational algorithm that fully defines the discrepancy function and its associated pdf through its discontinuities. This allows the calculation of $D_N(x,ρ)$ to machine precision with minimal storage in O(N) time. This vast improvement in computability over the O(N^2) naive version enables, for the first time, the direct computation of the exact pdf up to machine precision in O(N log N) time, and with it, key properties of the discrepancy: $ \\|D_N \\|_{\\infty}$ (half of the support of the pdf), $ \\|D_N \\|_{2}^2$ (the variance of the pdf), and the kurtosis of the pdf. A key strength of the algorithm lies in its ability to produce clear, exact figures, allowing the development of mathematical intuition and the quick testing of conjectures. As an example, a newly conjectured pattern is presented: when $ρ$ is well-approximated by rational $\\frac{p_n}{q_n}$, the pdf exhibits a predictable spiked-trapezoidal pattern when $N=kq_n$. These shapes degrade as $k$ increases, at a speed depending on how well $\\frac{p_n}{q_n}$ approximates $ρ$."}
{"id": "2511.13898", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13898", "abs": "https://arxiv.org/abs/2511.13898", "authors": ["Tianyu Zhao"], "title": "Upper bounds on gaps between zeros of $L$-functions", "comment": null, "summary": "We prove two unconditional upper bounds on the gaps between ordinates of consecutive non-trivial zeros of a general $L$-function $L(s)$. This extends previous work of Hall and Hayman (2000) on the Riemann zeta-function and work of Siegel (1945) on Dirichlet $L$-functions. Interestingly, we observe that while Hall and Hayman's method gives a sharper estimate when the degree of $L(s)$ is sufficiently small compared to the analytic conductor, Siegel's method does better in the other regime."}
{"id": "2511.13966", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13966", "abs": "https://arxiv.org/abs/2511.13966", "authors": ["Erick Ross"], "title": "Hecke Eigenvalue Equidistribution over the Newspaces with Nebentypus", "comment": null, "summary": "Fix a prime $p$, and let $\\widehat T_p^{\\mathrm{new}}(N,k,χ) := χ(p)^{-1/2} p^{-(k-1)/2} T_p^{\\mathrm{new}}(N,k,χ)$ denote the normalized $p$'th Hecke operator over the newspace with nenbentypus $S_k^{\\mathrm{new}}(N,χ)$. In this paper, we determine the distribution of the eigenvalues of $\\widehat T_p^{\\mathrm{new}}(N,k,χ)$ as $N+k \\to \\infty$."}
{"id": "2511.13969", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13969", "abs": "https://arxiv.org/abs/2511.13969", "authors": ["Erick Ross", "Alexandre van Lidth", "Martha Rose Wolf", "Hui Xue"], "title": "Proportion of Atkin-Lehner sign patterns and Hecke Eigenvalue Equidistribution", "comment": null, "summary": "Let $N \\ge 1$, $k \\ge 2$ even, and $σ$ denote a sign pattern for $N$. In this paper, we first determine the exact proportion of forms in $S_k(N)$ and $S_k^\\mathrm{new}(N)$ with a given Atkin-Lehner sign pattern $σ$. Then we study the asymptotic behavior of the Hecke operators $T_p$ over the subspaces of $S_k(N)$ and $S_k^{\\mathrm{new}}(N)$ with Atkin-Lehner sign pattern $σ$. In particular, for the $p$-adic Plancherel measure $μ_p$, we show that the Hecke eigenvalues for $T_p$ over these subspaces are $μ_p$-equidistributed as $N+k \\to \\infty$."}
{"id": "2511.13986", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13986", "abs": "https://arxiv.org/abs/2511.13986", "authors": ["Pierre Colmez"], "title": "Théorie locale du corps de classes et $(\\varphi,Γ)$-modules Lubin-Tate", "comment": "in French language", "summary": "We show how to deduce the determination of the maximal abelian extension of $F$, with $[F:{\\mathbf Q}_p]<\\infty$, from the theory of Lubin-Tate $(\\varphi,Γ)$-modules."}
{"id": "2511.14012", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14012", "abs": "https://arxiv.org/abs/2511.14012", "authors": ["Pranendu Darbar"], "title": "On the Distribution and Maximal Behavior of $L(1, χ_D)$ over Hyperelliptic Curves", "comment": "20 pages; Comments are welcome", "summary": "We improve the range of uniformity in the double-exponential decay of the tail of the distribution established by Lumley~\\cite{Lumley} for the quadratic Dirichlet $L$-function $L(1, χ_D)$ over the ensemble of hyperelliptic curves of genus~$g$ defined over a fixed finite field~$\\mathbb{F}_q$, in the limit as $g \\to \\infty$. Furthermore, we apply a long resonator method to show that this range of uniformity may persist up to its conjectural level by establishing a double-exponential decay lower bound for the corresponding distribution function."}
{"id": "2511.14234", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14234", "abs": "https://arxiv.org/abs/2511.14234", "authors": ["Michael Cranston", "Mariia Khodiakova"], "title": "Large deviations for number of irreducible divisors of the Dirichlet series distribution", "comment": "35 pages", "summary": "In this paper we produce precise large deviation estimates through the lens of mod-Poisson convergence. We apply a general result to various examples from number theory, Dedekind domains and polynomials over finite fields when an element is selected using a distribution based on a Dirichlet series."}
{"id": "2511.14316", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14316", "abs": "https://arxiv.org/abs/2511.14316", "authors": ["Hua-Lin Huang", "Haoran Miao", "Yu Ye"], "title": "The Waring Problem of Complex Binary Forms", "comment": null, "summary": "The Waring problem of forms concerns the expression of homogeneous multivariate polynomials as sums of powers of linear forms. This paper focuses on complex binary forms, and we solve the Waring problem for them using basic tools in algebra and analysis. In particular, we present elementary treatments of the Apolarity Lemma and Sylvester's 1851 Theorem, which are easily accessible and will provide an ideal approach for future extension to the general case."}
{"id": "2511.14382", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.14382", "abs": "https://arxiv.org/abs/2511.14382", "authors": ["Eknath Ghate"], "title": "The semi-stable Local Langlands Correspondence", "comment": "45 pages", "summary": "We start with background that goes into an Iwahori-theoretic reformulation of the mod $p$ Local Langlands Correspondence (§2). We then explain some classical $p$-adic functional analytic results (§3) that go into defining the $p$-adic Banach space (§4) attached to a two-dimensional semi-stable representation $V_{k,{\\mathcal L}}$ of the Galois group of ${\\mathbb Q}_p$ of weight $k$ and ${\\mathcal L}$-invariant ${\\mathcal L}$ under the $p$-adic Local Langlands correspondence. We then sketch how to compute the reduction of a lattice in this Banach space, which along with the Iwahori mod $p$ LLC, allows one to completely determine the mod $p$ reduction of $V_{k,{\\mathcal L}}$ for all weights $3 \\leq k \\leq p+1$ and all ${\\mathcal L}$ for $p \\geq 5$ (§5). These notes are a summary of our joint work with Anand Chitrao [CG24]. Emphasis is placed on motivation and background rather than completeness."}
{"id": "2511.14415", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14415", "abs": "https://arxiv.org/abs/2511.14415", "authors": ["Hung M. Bui", "Richard R. Hall", "Martin Subira Jorge"], "title": "Amplified Fourth Moment of the Riemann Zeta-Function and Applications", "comment": "19 pages, 0 figures", "summary": "The twisted fourth moment of the Riemann zeta-function was established by Hughes and Young [J. Reine Angew. Math. 641 (2010), 203--236] and later improved by Bettin, Bui, Li and Radziwill [J. Eur. Math. Soc. (JEMS) 22 (2020), 3953--3980]. In applications one would often like to take the Dirichlet polynomial to mimic either $1/ζ^r(s)$ (a mollifier) or $ζ(s)^r$ (an amplifier) for some $r>0$. Previous known results include the mean value of the fourth power of $ζ(s)$ times the square or the fourth power of a mollifier, or the square of an amplifier. In this paper we obtain the asymptotic formula for the fourth moment of the Riemann zeta-function times the fourth power of an amplifier. This has various applications to the theory of the Riemann zeta-function, e.g. gaps between zeros of $ζ(s)$ and lower bounds for moments."}
{"id": "2511.14563", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14563", "abs": "https://arxiv.org/abs/2511.14563", "authors": ["Fatma Çiçek", "Pranendu Darbar", "Allysa Lumley"], "title": "Linear Combinations of Logarithms of $L$-functions over Function Fields at Microscopic Shifts and Beyond", "comment": null, "summary": "In the function field setting with a fixed characteristic, it was proven by the second and third authors that the values $\\log \\big|L\\big(\\frac12, χ_D\\big)\\big|$ as $D$ varies over monic and square-free polynomials are asymptotically Gaussian distributed on the assumption of a low lying zeros hypothesis as the degree of $D$ tends to $\\infty$. For real distinct shifts $t_j$ all of microscopic size or all of nonmicroscopic size relative to the genus, we consider linear combinations of $\\log\\big|L\\big(\\frac12+it_j, χ_D\\big)\\big|$ with real coefficients, and separately, of $\\arg L\\big(\\frac12+it_j, χ_D\\big).$ We provide estimates for their distribution functions under the low lying zeros hypothesis. We similarly study distribution functions of linear combinations of $\\log\\big|L\\big(\\frac12+it_j, E\\otimes χ_D\\big)\\big|$, and separately $\\arg L\\big(\\frac12+it_j, E\\otimesχ_D\\big)$, for quadratic twists of elliptic curves $E$ with root number one as the conductor gets large. As an application of these results, we prove a central limit theorem for the fluctuation of the number of nontrivial zeros of such $L$-functions from its mean, and thus recover previous results by Faifman and Rudnick. Correlations of such fluctuations are in harmony with the results of Bourgade, Coram and Diaconis, and Wieand for zeros of the Riemann zeta function and for eigenangles of unitary random matrices."}
{"id": "2511.14568", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14568", "abs": "https://arxiv.org/abs/2511.14568", "authors": ["Dae San Kim", "Taekyun Kim"], "title": "Probabilistic Stirling numbers associated with sequences", "comment": "29 pages", "summary": "Let Y be a random variable whose moment generating function exists in a neighborhood of the origin. Recently, probabilistic Stirling numbers of the first kind and of the second kind associated with Y have been introduced. However, probabilistic stirling number of the first kind based on the cumulant generating function of Y, and probabilistic stirling number of the second kind do not satisfy orthogonality and inverse relations. This paper aims to redefine the probabilistic stirling numbers of the first kind associated with Y such that probabilistic stiirling number of the first kind and probabilistic stirling number of the second kind do satisfy these crucial relations. Furthermore, we investigate their degenerate counterparts, the probabilistic degenerate Stirling numbers of both kinds. We explicitly compute probabilistic stiirling number of the first kind and probabilistic stirling number of the second kind ."}
{"id": "2511.14576", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14576", "abs": "https://arxiv.org/abs/2511.14576", "authors": ["Victor Ahlquist"], "title": "Non-vanishing of Artin $L$-functions associated with $D_4$-quartic function fields ordered by conductor", "comment": "34 pages", "summary": "We study the low-lying zeros of certain Artin $L$-functions associated with $D_4$-quartic function fields. Specifically, we prove that when ordered by conductor, at least $77\\%$ of these $L$-functions are non-vanishing at the central point. This generalises and extends results over $\\mathbb{Q}$ due to Durlanik, proving that an infinite number of these $L$-functions are non-vanishing.\n  We obtain these results by examining the low-lying zeros of the $L$-functions using the one-level density. Specifically, we apply and extend a method used by Rudnick, who studied Dirichlet $L$-functions associated with quadratic function field extensions, to the $D_4$-case. The main difficulty is studying $L$-functions which are associated to $D_4$-fields whose quadratic subfield is of large discriminant. These $L$-functions are studied by utilising the so-called flipped field of a $D_4$ extension, combining a method introduced by Friedrichsen for counting $D_4$-fields, with explicit ramification theory in such fields provided by Altuğ, Shankar, Varma and Wilson."}
{"id": "2511.14587", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14587", "abs": "https://arxiv.org/abs/2511.14587", "authors": ["Andrew Knightly", "Kimball Martin"], "title": "Counting newforms with prescribed ramified supercuspidal components", "comment": "22 pages", "summary": "We give a formula for the number of newforms in $S_k^{\\mathrm{new}}(N)$ that have prescribed ramified supercuspidal components $π_p$ at a set $T$ of primes dividing $N$. This dimension is given in terms of the trace of the Atkin--Lehner operator at $T$ on $S_k^{\\mathrm{new}}(N)$. It depends only upon the weight, the level, the ramified quadratic extensions $E_p/{\\mathbb Q}_p$ attached to the $π_p$, and the root number of each $π_p$. The formula is completely explicit when $T$ consists of either a single prime or all prime factors of $N$."}
{"id": "2511.14736", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.14736", "abs": "https://arxiv.org/abs/2511.14736", "authors": ["Andrés Chirre", "Harald Andrés Helfgott"], "title": "Optimal bounds for sums of bounded arithmetic functions", "comment": "44 pages, 4 figures", "summary": "Let $A(s) = \\sum_n a_n n^{-s}$ be a Dirichlet series with meromorphic continuation. Say we are given information on the poles of $A(s)$ with $|\\Im s| \\leq T$ for some large constant $T$. What is the best way to use such finite spectral data to give explicit estimates on sums $\\sum_{n\\leq x} a_n$?\n  The problem of giving explicit bounds on the Mertens function $M(x) = \\sum_{n\\leq x} μ(n)$ illustrates how open this basic question was. Bounding $M(x)$ might seem equivalent to estimating $ψ(x) = \\sum_{n\\leq x} Λ(n)$ or the number of primes $\\leq x$. However, we have long had fairly good explicit bounds on prime counts, while bounding $M(x)$ remained a notoriously stubborn problem.\n  We prove a sharp, general result on sums $\\sum_{n\\leq x} a_n n^{-σ}$ for $a_n$ bounded, giving an optimal way to use information on the poles of $A(s)$ with $|\\Im s|\\leq T$ and no data on the poles above. Our bounds on $M(x)$ are stronger than previous ones by many orders of magnitude. (Similar results for $ψ(x)$ are given in a companion paper.) Using rigorous residue computations by D. Platt, we obtain, for $x\\geq 1$, $$|M(x)|\\leq \\frac{3}{π\\cdot 10^{10}}\\cdot x + 11.39 \\sqrt{x}.$$ This is a corollary of our main result, essentially an explicit formula with the contribution of each pole clearly stated; we shall discuss how this finer structure can be useful.\n  Our proof mixes a Fourier-analytic approach in the style of Wiener--Ikehara with contour-shifting, using optimal approximants of Beurling--Selberg type (Carneiro--Littmann, 2013); for $σ=1$, the approximant in (Vaaler, 1985) reappears. While we proceed independently of existing explicit work on $M(x)$ and $ψ(x)$, our method has an important step in common with work on another problem by (Ramana--Ramaré, 2020)."}
{"id": "2511.14750", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2511.14750", "abs": "https://arxiv.org/abs/2511.14750", "authors": ["Fan Gao", "Baiying Liu", "Chi-Heng Lo", "Freydoon Shahidi"], "title": "Covering Barbasch-Vogan duality and wavefront sets of genuine representations", "comment": "Comments are welcome", "summary": "In this paper, we start by defining a covering Barbasch-Vogan duality and prove some of its properties. Then, for genuine representations of $p$-adic covering groups we formulate an upper bound conjecture for their wavefront sets using this covering Barbasch-Vogan duality and reduce it to anti-discrete representations. The formulation generalizes that of Ciubotaru-Kim and Hazeltine-Liu-Lo-Shahidi for linear algebraic groups. We prove this upper bound conjecture for Kazhdan-Patterson coverings of general linear groups."}
