{"id": "2510.20910", "categories": ["math.NT", "11G10, 11G05"], "pdf": "https://arxiv.org/pdf/2510.20910", "abs": "https://arxiv.org/abs/2510.20910", "authors": ["Alina Cojocaru", "Frederick Saia"], "title": "Explicit surjectivity of Galois representations of products of elliptic curves over function fields", "comment": "18 pages. Comments are welcome!", "summary": "We prove an explicit surjectivity result for products of non-isotrivial,\nnon-isogenous elliptic curves over a function field of arbitrary\ncharacteristic. This is by way of an isogeny degree bound in this setting,\ngenerated from bounds for elliptic curves by Griffon--Pazuki, and techniques\noriginated by Serre and Masser--W\\\"{u}stholz in the number field setting. We\napply our result to prove that most members of a family of products of elliptic\ncurves over $\\mathbb{Q}$ with no extra endomorphisms have no exceptional primes\nabove a specified constant which depends neither on the elliptic curve factors\nnor on the dimension of the product."}
{"id": "2510.21157", "categories": ["math.NT", "math.CO", "11B65, 11F27, 11F37"], "pdf": "https://arxiv.org/pdf/2510.21157", "abs": "https://arxiv.org/abs/2510.21157", "authors": ["Frank Garvan", "Avi Mukhopadhyay"], "title": "Transformation of Third Order Mock Theta Functions and New $q$-Series Identities", "comment": "19 pages. Comments are welcome!", "summary": "Ramanujan introduced mock theta functions in his last letter to G.H.Hardy. He\nprovided examples and various relations between them. G.N.Watson found\ntransformations for the third order mock theta functions $f(q)$ and\n$\\omega$(q). Zwegers in 2000 built on Watson's techniques to complete these\nmock theta functions and connected them to real analytic modular forms. We show\nhow to derive these transformations using Lerch sums. To show the equivalence\nof the results involves some new $q$-series identities thus resulting in a new\nproof of Zwegers' theorem."}
{"id": "2510.21169", "categories": ["math.NT", "math.RT", "11F27, 11F46, 11F55, 11F66, 11F70, 11F80, 11R39, 20G41, 20E50, 20E55"], "pdf": "https://arxiv.org/pdf/2510.21169", "abs": "https://arxiv.org/abs/2510.21169", "authors": ["Gaëtan Chenevier", "Wee Teck Gan"], "title": "Triality and Functoriality", "comment": "46 pages", "summary": "We use the triality automorphism of simple algebraic groups of type $D_4$ to\nprove some new instances of global Langlands functorial lifting. In particular,\nwe prove the (weak) spin lifting from ${\\rm GSp}_6$ to ${\\rm GL}_8$ and the\ntensor product lifting from ${\\rm GL}_2 \\times {\\rm GSp}_4$ to ${\\rm GL}_8$. As\nan arithmetic application, we establish the expected properties of the spinor\nL-function attached to an arbitrary Siegel modular cusp form for ${\\rm\nSp}_6(\\mathbb{Z})$ generating a holomorphic discrete series."}
{"id": "2510.21247", "categories": ["math.NT", "math.AG", "Primary: 11F80, Secondary: 11G15, 14C30, 11Y40, 14K20"], "pdf": "https://arxiv.org/pdf/2510.21247", "abs": "https://arxiv.org/abs/2510.21247", "authors": ["Andrea Gallese", "Davide Lombardo"], "title": "Connected monodromy fields of Jacobians with complex multiplication", "comment": "24 pages, comments are welcome", "summary": "We describe an algorithm to compute the minimal field of definition of the\nTate classes on powers of a Jacobian $J$ with potential complex multiplication.\nThis field arises as a natural invariant of the Galois representations attached\nto $J$. We also give closed formulas expressing the periods of anti-holomorphic\ndifferential forms on $J$ in terms of the periods of the holomorphic ones."}
{"id": "2510.21035", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2510.21035", "abs": "https://arxiv.org/abs/2510.21035", "authors": ["Wagner Cortes", "Eduardo N. Marcos"], "title": "Partial actions of groups on quivers and path algebras", "comment": null, "summary": "In this article, we introduce the concept of partial actions of a group $G$\non quivers and demonstrate that for any given partial action of G on a quiver\n$\\Gamma$, there exists another quiver, $\\Gamma'$ with a full $G$-action. This\nis an enveloping action of the partial action of $G$ on $\\Gamma$. We also\nintroduce partial actions of groups on algebras by subalgebras instead of\nideals and we define enveloping actions in this case. We show that any partial\naction of a group on a path algebra that is induced by a partial action on a\nquiver has an enveloping action."}
{"id": "2510.21492", "categories": ["math.NT", "11F41"], "pdf": "https://arxiv.org/pdf/2510.21492", "abs": "https://arxiv.org/abs/2510.21492", "authors": ["Mathieu Dutour"], "title": "A Minkowski-type theorem on distances to cusps: the general case", "comment": "The term \"previous paper\" in the abstract refers to \"A Minkowski-type\n  theorem on distances to cusps: the class number one case\"", "summary": "In a previous paper, we studied the connection between points in\n$\\mathbb{H}^n$ and $2$-dimensional rigid adelic spaces on a totally real number\nfield $K$ with class number $h_K = 1$. This last assumption was needed to link\nheights and distances to cusps. In this paper, we remove this hypothesis to\nobtain, without restriction on $K$ totally real, an analogue of Minkowski's\nsecond theorem on the Roy--Thunder minima of a $2$-dimensional rigid adelic\nspace in the framework of distances between a point $\\tau \\in \\mathbb{H}^n$ and\nits two closest cusps."}
{"id": "2510.21319", "categories": ["math.RT", "math.AG", "math.CO"], "pdf": "https://arxiv.org/pdf/2510.21319", "abs": "https://arxiv.org/abs/2510.21319", "authors": ["Evgeny Feigin", "Markus Reineke"], "title": "From brick manifolds to Grassmannians of bimodules", "comment": "17 pages", "summary": "We study a class of Grassmannians of sub-bimodules over the path algebras of\nquivers. Our quiver Grassmannians include Escobar's brick manifolds as well as\nLabelle's generalizations. We give an explicit construction of the varieties in\nquestion, provide examples and clarify connection with the quiver\nrepresentation spaces. We also prove smoothness of our Grassmannians, construct\ncellular decompositions and derive a realization as framed moduli spaces. The\nframed moduli realization leads to a recursive formula for the motives."}
{"id": "2510.21515", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2510.21515", "abs": "https://arxiv.org/abs/2510.21515", "authors": ["Wei He", "Jungwon Lee"], "title": "Mahler measure, motivic regulators and Dirichlet $L$-values", "comment": "22 pages", "summary": "Inspired by the work of Deninger, we present a formula that relates the\nMahler measure of a two-variable variant of cyclotomic polynomial to regulator\nof class in motivic cohomology associated to cyclotomic fields and linear\ncombination of special values of the derivative of Dirichlet $L$-functions. The\nformula is derived by studying the Beilinson regulator map applied to\nsystematically constructed elements in the motivic cohomology group. Under\nlinear independence hypothesis on the derivative of partial Dirichlet\n$L$-values at $s=0$ and $-1$, we study a Galois module structure of the\nrelevant motivic cohomology and obtain the refined identity for a single\n$L$-value."}
{"id": "2510.21477", "categories": ["math.RT", "17B10 (Primary), 17B20, 17B30 (Secondary)"], "pdf": "https://arxiv.org/pdf/2510.21477", "abs": "https://arxiv.org/abs/2510.21477", "authors": ["Junseo Ko"], "title": "Odd nilpotent element and $\\mathfrak{osp}(1|2)$-subalgebra in $\\mathfrak{gl}(m|n)$", "comment": "25 pages", "summary": "In this paper, we investigate the conditions under which an odd nilpotent\nelement in $\\mathfrak{gl}(m|n)$ lies inside an\n$\\mathfrak{osp}(1|2)$-subalgebra. In the case of the classical Lie algebra\n$\\mathfrak{gl}_m$, every nilpotent element can be embedded into an\n$\\mathfrak{sl}_2$-subalgebra, which is the result of the Jacobson-Morozov\nTheorem. In the case of the Lie superalgebra $\\mathfrak{gl}(m|n)$, we define\nsuper Jordan matrices and prove that an odd nilpotent element $e$ is contained\nin an $\\mathfrak{osp}(1|2)$-subalgebra if and only if $e$ lies in the orbit of\na super Jordan matrix consisting only of super Jordan blocks of odd size."}
{"id": "2510.21558", "categories": ["math.NT", "math.PR", "05A19, 05A40, 11B68, 11B73, 11B83, 60-08"], "pdf": "https://arxiv.org/pdf/2510.21558", "abs": "https://arxiv.org/abs/2510.21558", "authors": ["Dae san Kim", "Taekyun Kim"], "title": "Representations by probabilistic Bernoulli and degenerate Bernoulli polynomials", "comment": "28 pages", "summary": "We investigate the representation of arbitrary polynomials using\nprobabilistic Bernoulli and degenerate Bernoulli polynomials associated with a\nrandom variable $Y$, whose moment generating function exists in a neighborhood\nof the origin. In addition, this paper explores the problem of representing\narbitrary polynomials in terms of their higher-order counterparts. We develop\nexplicit formulas for those representations with the help of umbral calculus\nand illustrate our results for several discrete and continuous random variables\nY."}
{"id": "2510.21499", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2510.21499", "abs": "https://arxiv.org/abs/2510.21499", "authors": ["G. Lusztig"], "title": "Positivity for certain Weyl group representations", "comment": "10 pages", "summary": "Let W be a Weyl group. We can define the notion of positivity of a W-module\nin terms of the corresponding module over the asymptotic Iwahori-Hecke algebra.\nWe state a conjecture which says that certain explicit W-modules are positive\nand we provide evidence for it."}
{"id": "2510.21644", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2510.21644", "abs": "https://arxiv.org/abs/2510.21644", "authors": ["Zheng Liu"], "title": "Test Schwartz functions at $p$ for theta lifts of Hida families", "comment": null, "summary": "We construct Hida families of theta lifts from definite orthogonal and\nunitary groups. A major ingredient of the construction is the choice of test\nSchwartz functions at places dividing $p$. We select a special type of Schwartz\nfunctions endowed with the equivariance property for the action of\n$\\mathbb{U}_p$-operators."}
{"id": "2510.21169", "categories": ["math.NT", "math.RT", "11F27, 11F46, 11F55, 11F66, 11F70, 11F80, 11R39, 20G41, 20E50, 20E55"], "pdf": "https://arxiv.org/pdf/2510.21169", "abs": "https://arxiv.org/abs/2510.21169", "authors": ["Gaëtan Chenevier", "Wee Teck Gan"], "title": "Triality and Functoriality", "comment": "46 pages", "summary": "We use the triality automorphism of simple algebraic groups of type $D_4$ to\nprove some new instances of global Langlands functorial lifting. In particular,\nwe prove the (weak) spin lifting from ${\\rm GSp}_6$ to ${\\rm GL}_8$ and the\ntensor product lifting from ${\\rm GL}_2 \\times {\\rm GSp}_4$ to ${\\rm GL}_8$. As\nan arithmetic application, we establish the expected properties of the spinor\nL-function attached to an arbitrary Siegel modular cusp form for ${\\rm\nSp}_6(\\mathbb{Z})$ generating a holomorphic discrete series."}
{"id": "2510.21658", "categories": ["math.NT", "math.AC", "math.AG"], "pdf": "https://arxiv.org/pdf/2510.21658", "abs": "https://arxiv.org/abs/2510.21658", "authors": ["Alexander Lai De Oliveira"], "title": "Lazardian Witt vectors", "comment": null, "summary": "We use Lazard's universal $\\pi$-ring to construct a variation of the\n$\\pi$-typical ramified Witt vector functors, which we call the Lazardian Witt\nvector functor. We then use the Lazardian Witt vector functor to construct the\nuniversal residual perfection of a Lazardian algebra."}
{"id": "2510.21702", "categories": ["math.NT", "Primary: 52C26, 11D99, Secondary: 20H10, 11E12, 11A15, 11B99"], "pdf": "https://arxiv.org/pdf/2510.21702", "abs": "https://arxiv.org/abs/2510.21702", "authors": ["Hanqi Shi", "Wenyuan Shi", "Ian Whitehead", "Ham Williams-Tracy", "Jeffrey Zhirui Zhang"], "title": "The Local-Global Conjecture is False for Generalized Circle Packings", "comment": "42 pages, 12 figures", "summary": "Haag, Kertzer, Rickards, and Stange disprove the Local-Global Conjecture for\nApollonian circle packings. We extend their disproof to four more types of\nintegral circle packing: the octahedral, cubic, square, and triangular\npackings. In each case, we find quadratic invariants which imply quadratic\nreciprocity obstructions to the conjecture in certain packings. We utilize an\nexplicit parametrization of circles tangent to a fixed circle in each packing\ntype, and a quadratic reciprocity argument. Even in the packings where we do\nnot find quadratic obstructions, the curvatures exhibit a predictable\nreciprocity structure. This leads to partial obstructions on integers appearing\nas curvatures in subsets of the packing."}
