{"id": "2508.20283", "categories": ["math.RT", "math.AC", "math.CT", "18G80 (Primary) 13D09, 16E35, 16G10 (Secondary)"], "pdf": "https://arxiv.org/pdf/2508.20283", "abs": "https://arxiv.org/abs/2508.20283", "authors": ["Cyril Matoušek"], "title": "Metric completions of triangulated categories from hereditary rings", "comment": "30 pages", "summary": "The focus of this article is on metric completions of triangulated categories\narising in the representation theory of hereditary finite dimensional algebras\nand commutative rings. We explicitly describe all completions of bounded\nderived categories with respect to additive good metrics for two classes of\nrings - hereditary commutative noetherian rings and hereditary algebras of tame\nrepresentation type over an algebraically closed field. To that end, we develop\nand study the lattice theory of metrics on triangulated categories. Moreover,\nwe establish a link between metric completions of bounded derived categories of\na ring and the ring's universal localisations."}
{"id": "2508.20331", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2508.20331", "abs": "https://arxiv.org/abs/2508.20331", "authors": ["Xin Ma", "Panyue Zhou"], "title": "$n$-cotorsion pairs in a recollement of extriangulated categories", "comment": "15 pages", "summary": "Let $(\\mathcal{A}, \\mathcal{B}, \\mathcal{C})$ be a recollement of\nextriangulated categories.In this paper, we first show how to obtain an\n$n$-cotorsion pair in $\\mathcal{B}$ from given $n$-cotorsion pairs in\n$\\mathcal{A}$ and $\\mathcal{C}$. Conversely, we prove that an $n$-cotorsion\npair in $\\mathcal{B}$ can induce $n$-cotorsion pairs in $\\mathcal{A}$ and\n$\\mathcal{C}$ under suitable conditions. As applications, several related\nresults are provided to illustrate our construction."}
{"id": "2508.20382", "categories": ["math.RT", "Primary: 20G05 Secondary: 15A15, 17B35, 05E10"], "pdf": "https://arxiv.org/pdf/2508.20382", "abs": "https://arxiv.org/abs/2508.20382", "authors": ["Naihuan Jing", "Yinlong Liu", "Jian Zhang"], "title": "Immanant inequalities and weight spaces", "comment": null, "summary": "We first obtain a trace formula for immanants of generalized principal\nsubmatrix of any complex matrix based on any weight space for finite\ndimensional representations of the general linear group. Our trace formula\ncontains Kostant's famous formula for immanants on $0$-weight spaces as special\ncase. We then present a criterion for non-vanishing immanants for any\ngeneralized principal submatrix of positive definite Hermitian or nonsingular\ntotally nonnegative matrices, which strengthened the well-known results of\nSchur and Stembridge. Furthermore, we present an inequality that contains\nKostant, Schur and Stembridge's famous inequalities as special cases."}
{"id": "2508.20192", "categories": ["math.NT", "11G20, 11G25, 12E05"], "pdf": "https://arxiv.org/pdf/2508.20192", "abs": "https://arxiv.org/abs/2508.20192", "authors": ["Lea Beneish", "Christopher Keyes"], "title": "Effective Bertini theorems and zeros of $p$-adic forms of degree 7", "comment": "14 pages, comments welcome", "summary": "We establish an effective Bertini-type theorem for hypersurfaces $X_f \\colon\nf = 0$ defined over a finite field $k$ for which $f$ has no linear factors over\nthe algebraic closure $\\overline{k}$. Given a line $L$ defined over $k$ and a\nnonreduced $\\overline{k}$-point $x$ on $X_f \\cap L$, we give an upper bound on\nthe number of planes $P$ containing $L$ for which $X_f \\cap P$ contains a line\nthrough $x$. Underlying this result is a factorization algorithm for bivariate\npolynomials originally due to Kaltofen, which we present with slightly relaxed\nhypotheses. Our primary application is to Artin's conjecture on $p$-adic forms\nof degree 7: if $K/\\mathbb{Q}_p$ is a finite extension with residue field\nisomorphic to $\\mathbb{F}_q$ and $F(x_0, \\ldots, x_n) \\in K[x_0, \\ldots,\nx_{49}]$ is a homogeneous form of degree 7, then there exists a $K$-solution to\n$F=0$ whenever $q>679$. This improves on a result of Wooley."}
{"id": "2508.20222", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2508.20222", "abs": "https://arxiv.org/abs/2508.20222", "authors": ["Ivan Bortnovskyi", "Michael Lucas", "Steven J. Miller", "Iana Vranesko", "Ren Watson", "Cameron White"], "title": "The Ordered Zeckendorf Game", "comment": "16 pages, 4 figures", "summary": "We introduce and analyze the ordered Zeckendorf game, a novel combinatorial\ntwo-player game inspired by Zeckendorf's Theorem, which guarantees a unique\ndecomposition of every positive integer as a sum of non-consecutive Fibonacci\nnumbers. Building on the original Zeckendorf game\\ -- previously studied in the\ncontext of unordered multisets\\ -- we impose a new constraint: all moves must\nrespect the order of summands. The result is a richer and more nuanced\nstrategic landscape that significantly alters game dynamics.\n  Unlike the classical version, where Player 2 has a dominant strategy for all\n$n > 2$, our ordered variant reveals a more balanced and unpredictable\nstructure. In particular, we find that Player 1 wins for nearly all values $n\n\\leq 25$, with a single exception at $n = 18$. This shift in strategic outcomes\nis driven by our game's key features: adjacency constraints that limit\nallowable merges and splits to neighboring terms, and the introduction of a\nswitching move that reorders pairs.\n  We prove that the game always terminates in the Zeckendorf decomposition\\ --\nnow in ascending order\\ -- by constructing a strictly decreasing monovariant.\nWe further establish bounds on game complexity: the shortest possible game has\nlength exactly $n - Z(n)$, where $Z(n)$ is the number of summands in the\nZeckendorf decomposition of $n$, while the longest game exhibits quadratic\ngrowth, with $M(n) \\sim \\frac{n^2}{2}$ as $n \\to \\infty$.\n  Empirical simulations suggest that random game trajectories exhibit\nlog-normal convergence in their move distributions. Overall, the ordered\nZeckendorf game enriches the landscape of number-theoretic games, posing new\nalgorithmic challenges and offering fertile ground for future exploration into\nstrategic complexity, probabilistic behavior, and generalizations to other\nrecurrence relations."}
{"id": "2508.20270", "categories": ["math.NT", "nlin.SI"], "pdf": "https://arxiv.org/pdf/2508.20270", "abs": "https://arxiv.org/abs/2508.20270", "authors": ["Prakash Belkale", "Evgeny Mukhin", "Alexander Varchenko"], "title": "$p$-curvature operators and Satake-type phenomenon for $\\frak{sl}_2$ KZ equations with $κ=\\pm 2$", "comment": null, "summary": "The $\\frak{sl}_2$ KZ differential equations with values in the tensor power\nof the fundamental representation with parameter $\\kappa=\\pm 2$ are considered.\nA Satake-type correspondence is established over complex numbers and\nsubsequently reduced to finite characteristic. This correspondence enables the\nstudy of the KZ equations on the lower weight subspaces of the tensor power in\nterms of the wedge powers of the weight subspace of the weight just below the\nhighest weight.\n  We apply this approach to analyze the $p$-curvature operators associated with\nour KZ equations, evaluate the dimension of the solution space in\ncharacteristic $p$, and determine whether all solutions are generated by the\nso-called $p$-hypergeometric solutions. In particular, we show that not all\nsolutions of the KZ equations with $\\kappa=2$ in characteristic $p$ are\ngenerated by $p$-hypergeometric solutions. Previously, no such examples were\nknown."}
{"id": "2508.20387", "categories": ["math.NT", "math.CO", "11M32 (Primary) 16T05, 05C05 (Secondary)"], "pdf": "https://arxiv.org/pdf/2508.20387", "abs": "https://arxiv.org/abs/2508.20387", "authors": ["Ku-Yu Fan"], "title": "A map between arborifications of multiple zeta values", "comment": "18 pages", "summary": "Arborified multiple zeta values are a generalization of multiple zeta values\nassociated with rooted trees. There are two types of decorated rooted trees,\ncorresponding respectively to the series and the integral expressions. Manchon\nintroduces the contracting arborification (resp. the simple arborification),\nwhich is maps from the BCK Hopf algebras of the decorated rooted trees\ncorresponding to the series expression (resp. the integral expression) to the\nnon-commutative polynomial algebras of the set $\\mathbb{N}$ (resp. the set\n$\\{0,1\\}$). There is a natural map between the two non-commutative polynomial\nalgebras. Manchon posed the question of finding a natural map between the two\nBCK Hopf algebras that would make the diagram commutative. In this paper, we\nconsider planar rooted trees and use a recursive method to construct such a map\nbetween the two BCK Hopf algebras, making the diagram commutative."}
{"id": "2508.20573", "categories": ["math.NT", "math.CO", "05A17, 11P81, 11P83, 11F11"], "pdf": "https://arxiv.org/pdf/2508.20573", "abs": "https://arxiv.org/abs/2508.20573", "authors": ["Debika Banerjee", "Ben Kane"], "title": "Divisibility properties of weighted $k$ regular partitions", "comment": null, "summary": "We study a generalized class of weighted $k$-regular partitions defined by \\[\n\\sum_{n=0}^{\\infty} c_{k, r_1, r_2}(n) q^n = \\prod_{n=1}^{\\infty} \\frac{(1 -\nq^{nk})^{r_1}}{(1 - q^n)^{r_2}}, \\] which extends the classical $k$-regular\npartition function $b_k(n)$. We establish new infinite families of\nRamanujan-type congruences, divisibility results, and positive-density prime\nsets for which $c_{k, r_1, r_2}(n)$ vanishes modulo a given prime. These\nresults generalize recent work on $5$-regular partitions and reveal deeper\nmodular and combinatorial structures underlying weighted partition functions."}
{"id": "2508.20576", "categories": ["math.NT", "hep-th", "11F67, 11F70"], "pdf": "https://arxiv.org/pdf/2508.20576", "abs": "https://arxiv.org/abs/2508.20576", "authors": ["Anshul Adve", "James Bonifacio", "Petr Kravchuk", "Dalimil Mazac", "Sridip Pal", "Alex Radcliffe", "Gordon Rogelberg"], "title": "Weyl bound for trilinear periods via conformal bootstrap", "comment": "54 pages", "summary": "Let $f_1,f_2$ be holomorphic modular forms of the same weight for a cocompact\nlattice $\\Gamma < \\mathrm{PSL}_2(\\mathbf{R})$. We estimate the rate of decay of\nthe coefficients in the expansion of $f_1\\overline{f_2}$ in a Laplace\neigenbasis. By specializing our main theorem to the case where $\\Gamma$ is\narithmetic, we obtain new instances of the Weyl bound for triple product\n$L$-functions in the spectral aspect. Our method builds on the conformal\nbootstrap in physics."}
{"id": "2508.20719", "categories": ["math.NT", "11H31, 11H55, 05E18"], "pdf": "https://arxiv.org/pdf/2508.20719", "abs": "https://arxiv.org/abs/2508.20719", "authors": ["Mathieu Dutour Sikirić", "Wessel van Woerden"], "title": "The lattice packing problem in dimension 9 by Voronoi's algorithm", "comment": null, "summary": "In 1908, Voronoi introduced an algorithm that solves the lattice packing\nproblem in any dimension in finite time. Voronoi showed that any lattice with\noptimal packing density must be a so-called perfect lattice, and his algorithm\nenumerates the finitely many perfect lattices up to similarity in a fixed\ndimension. However, due to the high complexity of the algorithm this\nenumeration had, until now, only been completed up to dimension 8.\n  In this work we compute all 2237251040 perfect lattices in dimension 9 via\nVoronoi's algorithm. As a corollary, this shows that the laminated lattice\n$\\Lambda_9$ gives the densest lattice packing in dimension 9. Equivalently, we\nshow that the Hermite constant $\\gamma_9$ in dimension 9 equals $2$.\nFurthermore, we extend a result by Watson (1971) and show that the set of\npossible kissing numbers in dimension 9 is precisely $2 \\cdot \\{ 1, \\ldots, 91,\n99, 120, \\ldots, 129, 136 \\}$."}
{"id": "2508.20733", "categories": ["math.NT", "11D72, 11E12 (Primary) 05E99, 14G05 (Secondary)"], "pdf": "https://arxiv.org/pdf/2508.20733", "abs": "https://arxiv.org/abs/2508.20733", "authors": ["Munenori Inagaki", "Hideki Matsumura", "Masanori Sawa", "Yukihiro Uchida"], "title": "On a group of normalized solutions of the higher-dimensional Prouhet--Tarry--Escott problem", "comment": "6 pages", "summary": "We elucidate, for the first time, a novel group-theoretic structure that\narises from certain solutions of the $n$-dimensional Prouhet--Tarry--Escott\nproblem of degree $2$ and size $n$. We prove that the group is isomorphic to\nthe orthogonal group for a certain quadratic form."}
{"id": "2508.20814", "categories": ["math.NT", "11M45, 40E05, 11N37, 11N45, 11R20"], "pdf": "https://arxiv.org/pdf/2508.20814", "abs": "https://arxiv.org/abs/2508.20814", "authors": ["Brandon Alberts"], "title": "An Explicit Tauberian Theorem taking Averaged Inputs with an Application to Counting Abelian Number Fields", "comment": null, "summary": "Given a Dirichlet series $L(s) = \\sum a_n n^{-s}$, the asymptotic growth rate\nof $\\sum_{n\\le X} a_n$ can be determined by a Tauberian theorem. Bounds on the\nerror term are typically controlled by the size of $|L(\\sigma+it)|$ for fixed\nreal part $\\sigma$. We modify this approach to prove new Tauberian theorems\nwith error terms depending only on the average size of $L(\\sigma+it)$ as $t$\nvaries, and we take care to track explicit dependence on various parameters.\nThis often leads to stronger error bounds, and introduces strong connections\nbetween asymptotic counting problems and moments of $L$-functions.\n  We provide self-contained statements of Tauberian theorems in anticipation\nthat these results can be used ``out of the box'' to prove new asymptotic\nexpansions. We demonstrate this by proving square root saving error bounds for\nthe number of $C_n$-extensions of $\\mathbb{Q}$ of bounded discriminant when\n$n=3$, $4$, $8$, $16$, or $2p$ for $p$ an odd prime."}
{"id": "2508.20853", "categories": ["math.NT", "11N37, 11A07, 11B83"], "pdf": "https://arxiv.org/pdf/2508.20853", "abs": "https://arxiv.org/abs/2508.20853", "authors": ["Omkar Baraskar", "Ingrid Vukusic"], "title": "Bounds for sets of remainders", "comment": "13 pages; comments welcome!", "summary": "Let $s(n)$ be the number of different remainders $n \\bmod k$, where $1 \\leq k\n\\leq \\lfloor n/2 \\rfloor$. This rather natural sequence is sequence A283190 in\nthe OEIS and while some basic facts are known, it seems that surprisingly it\nhas barely been studied. First, we prove that $s(n) = c \\cdot n + O(n/(\\log n\n\\log \\log n))$, where $c$ is an explicit constant. Then we focus on differences\nbetween consecutive terms $s(n)$ and $s(n+1)$. It turns out that the value can\nalways increase by at most one, but there exist arbitrarily large decreases. We\nshow that the differences are bounded by $O(\\log \\log n)$. Finally, we consider\n''iterated remainder sets''. These are related to a problem arising from Pierce\nexpansions, and we prove bounds for the size of these sets as well."}
