{"id": "2511.05101", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.05101", "abs": "https://arxiv.org/abs/2511.05101", "authors": ["Yu Mao", "Xiao Wang"], "title": "Mono-anabelian Reconstruction of Number Fields with Restricted Ramification", "comment": null, "summary": "In this paper, we apply Hoshi's mono-anabelian reconstruction of number\nfields to establish a group-theoretic reconstruction of a number field K\ntogether with its maximal unramified outside S extension K_S for a density 1\nsubset of primes of K starting from the profinite group G_{K,S}."}
{"id": "2511.05127", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.05127", "abs": "https://arxiv.org/abs/2511.05127", "authors": ["Séverin Philip"], "title": "The local obstruction to semi-stable reduction for abelian varieties", "comment": "Comments are welcome", "summary": "Grothendieck defined a group that represents the local obstruction for an\nabelian variety to have semi-stable reduction. These groups were studied by\nSilverberg and Zarhin and more recently by the author in order to give a group\ntheoretic characterization of them depending only on the dimension. We give an\noverview of the developments since Grothendieck's definition with the added\nnovelty of the case of equal characteristic local fields."}
{"id": "2511.05192", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.05192", "abs": "https://arxiv.org/abs/2511.05192", "authors": ["Yu Mao", "Mohamed Saidi"], "title": "The m-step Solvable Mono-anabelian Geometry of Number Fields", "comment": null, "summary": "The goal of this paper is to develop a group-theoretic algorithm, to\nreconstruct a number field (together with its maximal m-step solvable ex-\ntension for some positive integer m \\geq 3) from the maximal m+9-step solv-\nable quotient of its absolute Galois group. If K is an imaginary quadratic\nfield or Q, we establish a group-theoretic reconstruction algorithm of K from\nthe maximal 6-step solvable quotient of its absolute Galois group."}
{"id": "2511.05198", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.05198", "abs": "https://arxiv.org/abs/2511.05198", "authors": ["Guido Kings", "Johannes Sprang"], "title": "Algebraicity of critical Hecke $L$-values", "comment": "8 pages, survey article written for the proceedings of the 2025\n  International Congress of Basic Science (ICBS)", "summary": "In this survey, we review the known results on the algebraicity of critical\nvalues of Hecke $L$-functions and explain the new developments in\n\\cite{Kings-Sprang}."}
{"id": "2511.05063", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.05063", "abs": "https://arxiv.org/abs/2511.05063", "authors": ["Pramod N. Achar", "Simon Riche"], "title": "Tilting modules for reductive algebraic groups: characters and support varieties", "comment": "26 pages", "summary": "These notes are our contribution to the Proceedings of the ICM 2026. We\ndiscuss some results we have obtained (in part jointly with coauthors)\nregarding the representation theory of reductive algebraic groups over\nalgebraically closed fields of positive characteristic. These statements mainly\nconcern tilting modules, in particular their characters and support varieties."}
{"id": "2511.05201", "categories": ["math.NT", "math.AG", "math.KT", "11E76, 11G20, 12G05, 12G10, 14G05, 14G27, 14J70, 19C99"], "pdf": "https://arxiv.org/pdf/2511.05201", "abs": "https://arxiv.org/abs/2511.05201", "authors": ["Felipe Gambardella", "Harry C. Shaw"], "title": "Stability of the $C^q_i$ properties under field extensions", "comment": "Any comments are welcome!", "summary": "In this paper we study the stability of variations of Kato-Kuzumaki's $C_i^q$\nproperty under transcendental and algebraic field extensions. As an\napplication, we obtain the $C_n^1$ property for the field ${\\bf\nF}_p(x_1,\\dots,x_n)$."}
{"id": "2511.05140", "categories": ["math.RT", "math.RA", "16S37 (Primary) 16D90, 18G80, 20C08 (Secondary)"], "pdf": "https://arxiv.org/pdf/2511.05140", "abs": "https://arxiv.org/abs/2511.05140", "authors": ["Gwyn Bellamy", "Simone Castellan", "Isambard Goodbody"], "title": "Non-homogeneous Koszul duality in representation theory", "comment": "45 pages", "summary": "Motivated by the representation theory of symplectic reflection algebras,\ndeformed preprojective algebras, and graded Hecke algebras, we consider\nfiltered algebras $U$ whose associated graded is Koszul. The Koszul dual of\n$U$, as defined by Positselski, is a curved dg-algebra. We establish an exact\nequivalence between the unbounded derived category of $U$ and an explicit\nquotient of the homotopy category of injective modules over the dual curved\ndg-algebra. This recovers a special case of a result of Positselski. In the\ncase where $U$ has finite global dimension, the quotient is trivial and hence\nthe unbounded derived category of $U$ is equivalent to the homotopy category of\ninjective modules over the dual curved dg-algebra."}
{"id": "2511.05272", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.05272", "abs": "https://arxiv.org/abs/2511.05272", "authors": ["Nitin Saxena", "Madhavan Venkatesh"], "title": "Counting points on surfaces in polynomial time", "comment": null, "summary": "We present a randomised algorithm to compute the local zeta function of a\nfixed smooth, projective surface over $\\mathbb{Q}$, at any large prime $p$ of\ngood reduction. The runtime of our algorithm is polynomial in $\\log p$,\nresolving a conjecture of Couveignes and Edixhoven."}
{"id": "2511.05287", "categories": ["math.NT", "math.AC", "11R09, 11C08, 30B50 (Primary) 13P05, 13A05, 13F15 (Secondary)"], "pdf": "https://arxiv.org/pdf/2511.05287", "abs": "https://arxiv.org/abs/2511.05287", "authors": ["Nicolae Ciprian Bonciocat"], "title": "Logarithmic Newton polygons and polytopes, and the factorization of Dirichlet polynomials", "comment": "88 pages, 18 figures", "summary": "To study a Dirichlet polynomial $f(s)=\\frac{a_{m}}{m^{s}}+\\cdots\n+\\frac{a_{n}}{n^{s}}$ by regarding it as a multivariate polynomial via the\ncanonical map $\\phi$ sending $p_i^{-s}$ to an indeterminate $X_i$, with $p_i$\nthe $i$th prime number, requires knowing the prime factorizations of all the\nintegers in the support of $f$. We devise several methods to study the\nfactorization of Dirichlet polynomials over unique factorization domains that\ncircumvent the use of $\\phi$, and obtain irreducibility criteria that are\nanalogous to the classical results of Sch\\\"onemann, Eisenstein, Dumas,\nSt\\\"ackel, Ore and Weisner for polynomials, and to more recent results of\nFilaseta and Cavachi. Some of the proofs rely on logarithmic versions of the\nclassical Newton polygons. Criteria that use two or more $p$-adic valuations by\ncombining information from different logarithmic Newton polygons of $f$, as\nwell as irreducibility conditions for Dirichlet polynomials that assume a prime\nor a prime power value are also obtained. We also find excluding intervals for\nthe relative degrees of the factors of a Dirichlet polynomial, and upper bounds\nfor the multiplicities of the irreducible factors, in particular square-free\ncriteria, that use no derivatives. Criteria of absolute irreducibility\nanalogous to results of Ostrowski, Gao and Stepanov-Schmidt are finally\nprovided in the multivariate case by using logarithmic Newton polytopes and\nlogarithmic upper Newton polygons."}
{"id": "2511.05322", "categories": ["math.NT", "math.AG", "11F06, 11G15, 11G18, 11M38, 14G35, 11E12, 11R29, 14H10, 14K22, 32M15"], "pdf": "https://arxiv.org/pdf/2511.05322", "abs": "https://arxiv.org/abs/2511.05322", "authors": ["Wanlin Li", "Elena Mantovan", "Rachel Pries", "Yunqing Tang"], "title": "Infinitely many primes of basic reduction for some abelian fourfolds", "comment": "53 pages, 4 figures", "summary": "If $E$ is an elliptic curve, defined over $\\mathbb{Q}$ or a number field\nhaving at least one real embedding, then Elkies proved that $E$ has\nsupersingular reduction at infinitely many primes $p$. Baba and Granath\nextended this result to certain curves $C$ of genus $2$ with field of moduli\n$\\mathbb{Q}$, under a condition on the endomorphism ring of the Jacobian. In\nthis paper, we extend these results to certain curves of genus $4$ having an\nautomorphism of order $5$, proving that the Jacobians of these curves have\nbasic reduction (as defined by Kottwitz) for infinitely many primes $p$.\n  To do this, we study the complex uniformization of the Deligne--Mostow\nShimura variety $\\mathrm{Sh}$ associated with the one dimensional family of\nthese curves. By analyzing the real points on $\\mathrm{Sh}$, we compute three\ngeodesics in the upper half plane that are edges of a fundamental triangle for\nthe action of the unitary similitude group. Using representations of quadratic\nforms, we determine the points on $\\mathrm{Sh}$ which represent curves whose\nJacobians have complex multiplication by certain quadratic extensions of the\ncyclotomic field $\\mathbb{Q}(\\zeta_5)$. We conclude by studying the\nequidistribution of these points and the reduction of these CM cycles on the\nShimura variety."}
{"id": "2511.05377", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.05377", "abs": "https://arxiv.org/abs/2511.05377", "authors": ["Zhaolin Li"], "title": "Fundamental Lemma for Rank One Spherical Varieties of Classical Types", "comment": null, "summary": "According to the relative Langlands functoriality conjecture, an admissible\nmorphism between the $L$-groups of spherical varieties should induce a\nfunctorial transfer of the corresponding local and global automorphic spectra.\nVia the relative trace formula approach, two basic problems are the fundamental\nlemma and the local transfer on the geometric side of the relative trace\nformulas. In this paper, we consider the rank-one spherical variety case, where\nthe admissible morphism between the $L$-groups is the identity morphism, in\nwhich case, Y. Sakellaridis has already established the local transfer\n(\\cite{Sak21}). We formulate the statement of the fundamental lemma for the\ngeneral rank-one spherical variety case and prove the fundamental lemma for the\nrank-one spherical varieties of classical types."}
