{"id": "2512.19814", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.19814", "abs": "https://arxiv.org/abs/2512.19814", "authors": ["Sami Assaf", "Nicolle González"], "title": "A Local Characterization of Unions of Demazure Crystals", "comment": "15 pages, 1 figure", "summary": "We characterize subsets of highest weight $\\mathfrak{g}$-crystals that arise as unions of Demazure crystals, for any symmetrizable Kac-Moody Lie algebra $\\mathfrak{g}$. We provide a local characterization for these subsets and prove they admit disjoint decompositions into Demazure atoms. As a consequence, we give a new characterization for when a subset of a highest weight crystal is a Demazure crystal as well as a crystal-theoretic proof that any Polo module admits a relative Schubert filtration."}
{"id": "2512.19873", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.19873", "abs": "https://arxiv.org/abs/2512.19873", "authors": ["Calvin Pfeifer"], "title": "Serre cyclotomic algebras", "comment": "14 pages. Comments welcome!", "summary": "We introduce a class of proper differential graded algebras which we call Serre cyclotomic. They generalize fractionally Calabi-Yau algebras and categorify de la Peña's algebras of cyclotomic type. Path algebras of affine type and (higher) canonical algebras are examples of Serre cyclotomic algebras. Our definition is related to Elias-Hogancamp's theory of categorical diagonalization. We compute the categorical entropy of their Serre functors, in the sense of Dimitrov-Haiden-Katzarkov-Kontsevich, and use this to determine which graded path algebras and which homologically smooth graded gentle algebras are Serre cyclotomic. Finally, we show that trivial extension algebras of Serre cyclotomic algebras have finite global complexity."}
{"id": "2512.19998", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2512.19998", "abs": "https://arxiv.org/abs/2512.19998", "authors": ["Kang Lu", "Weiqiang Wang", "Alex Weekes"], "title": "Shifted twisted Yangians of quasi-split ADE types", "comment": "38 pages, this is separated from Part 1 of arXiv:2510.10652 v1", "summary": "Associated to all quasi-split Satake diagrams of type ADE and even spherical coweights $μ$, we introduce the shifted iYangians ${}^\\imath Y_μ$ and establish their PBW bases. We construct the iGKLO representations of ${}^\\imath Y_μ$, which factor through quotients called truncated shifted iYangians ${}^\\imath Y_μ^λ$. In type AI with $μ$ dominant, a variant of ${}^\\imath Y_μ^{N\\varpi_1^\\vee}$ is identified with the truncated shifted iYangians in another definition, which are isomorphic to finite W-algebras of type BCD. These new family of algebras has connections and applications to fixed point loci of affine Grassmannian slices which will be developed in a sequel."}
{"id": "2512.20434", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.20434", "abs": "https://arxiv.org/abs/2512.20434", "authors": ["José Cantarero", "Higinio Serrano Garcia"], "title": "Grupos magnéticos finitos y sus representaciones", "comment": "24 pages, 1 figure, in Spanish", "summary": "In this article we give an elementary introduction to the representation theory of finite magnetic groups from a purely mathematical point of view.\n  --\n  En este artículo damos una introducción elemental a la teoría de representaciones de grupos magnéticos finitos desde un punto de vista puramente matemático."}
{"id": "2512.19831", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.19831", "abs": "https://arxiv.org/abs/2512.19831", "authors": ["Nadir Matringe"], "title": "Epsilon dichotomy via root numbers of intertwining periods", "comment": null, "summary": "We give a new proof of the epsilon dichotomy conjecture, stated by Prasad and Takloo-Bighash, for non Archimedean local fields of characteristic zero, when the twisting character is trivial. Our method relies on the functional equation and the analytic properties of intertwining periods, instead of trace formula and type theory. It removes the odd residual characteristic restriction in the previous proof, coming from type theory."}
{"id": "2512.20472", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.20472", "abs": "https://arxiv.org/abs/2512.20472", "authors": ["Wille Liu", "Kari Vilonen", "Ting Xue"], "title": "Cuspidal character sheaves on graded Lie algebras II", "comment": null, "summary": "In this paper we give a complete classification of cyclically graded semisimple Lie algebras that afford cuspidal character sheaves and determine the support of the cuspidal character sheaves. This constitutes a major step towards the explicit classification of cuspidal character sheaves for graded Lie algebras."}
{"id": "2512.19952", "categories": ["math.NT", "math.CA", "math.HO"], "pdf": "https://arxiv.org/pdf/2512.19952", "abs": "https://arxiv.org/abs/2512.19952", "authors": ["Bruce C. Berndt", "Örs Rebák"], "title": "The Rogers--Ramanujan continued fraction", "comment": "12 pages, submitted", "summary": "The primary purpose of this paper is to provide a survey of properties, values, identities, and generalizations of the Rogers--Ramanujan continued fraction, which is closely related to the Rogers--Ramanujan identities. Many of these results are found in Ramanujan's first two letters to Hardy, Ramanujan's notebooks, and his lost notebook. Short historical accounts are provided for both the notebooks and lost notebook."}
{"id": "2512.20525", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2512.20525", "abs": "https://arxiv.org/abs/2512.20525", "authors": ["Masao Oi"], "title": "Twisted character formula for toral supercuspidal representations", "comment": "68 pages", "summary": "We establish an explicit formula for twisted Harish-Chandra characters of toral supercuspidal representations of p-adic reductive groups under several technical assumptions. Our setup especially includes the case of a quasi-split group equipped with a involution."}
{"id": "2512.20023", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20023", "abs": "https://arxiv.org/abs/2512.20023", "authors": ["Shi-Chao Chen", "Chuan-Chuan Wu"], "title": "On the 3-rank of the class group of quadratic fields", "comment": null, "summary": "Let $n\\ge1$, $r\\ge0$ and $s\\ge0$ be integers satisfying $4+r+3 s\\le3^{n+1}$. Given linear polynomials $f_{i}(x)=m_{i} x+n_{i}$ for $1 \\le i \\le r+s$, where the coefficients $m_{i} , n_{i}$ are positive integers satisfying certain conditions, we prove that there exist infinitely many fundamental discriminants $D>0$ such that the 3-rank of the class group of each quadratic fields $\\mathbb{Q}(\\sqrt{f_1(D)}), \\ldots, \\mathbb{Q}(\\sqrt{f_r(D)})$ and $\\mathbb{Q}(\\sqrt{-f_{r+1}(D)}), \\ldots, \\mathbb{Q}(\\sqrt{-f_{r+s}(D)})$ is simultaneously less than $n$. Moreover, for any positive integer $k$, there exist positive integers $a, d$ such that the 3-rank of the class group of each quadratic fields $\\mathbb{Q}(\\sqrt{a+g_1(d)}), \\ldots,\\mathbb{Q}(\\sqrt{a+g_k(d)})$ is simultaneously less than $n$ for polynomials $g_1(x), g_2(x), \\ldots, g_k(x)$ that take integer values at the integers and have no constant terms."}
{"id": "2512.19831", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.19831", "abs": "https://arxiv.org/abs/2512.19831", "authors": ["Nadir Matringe"], "title": "Epsilon dichotomy via root numbers of intertwining periods", "comment": null, "summary": "We give a new proof of the epsilon dichotomy conjecture, stated by Prasad and Takloo-Bighash, for non Archimedean local fields of characteristic zero, when the twisting character is trivial. Our method relies on the functional equation and the analytic properties of intertwining periods, instead of trace formula and type theory. It removes the odd residual characteristic restriction in the previous proof, coming from type theory."}
{"id": "2512.20055", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.20055", "abs": "https://arxiv.org/abs/2512.20055", "authors": ["Quanyu Tang", "Shengtong Zhang"], "title": "Harmonic LCM patterns and sunflower-free capacity", "comment": "19 pages. Comments and suggestions are welcome", "summary": "Fix an integer $k\\ge 3$. Call a set $A\\subseteq [N]$ LCM-$k$-free if it does not contain distinct $a_1,\\dots,a_k$ such that $\\mathrm{lcm}(a_i,a_j)$ is the same for all $1\\le i<j\\le k$. Define $$ f_k(N):=\\max\\left\\{\\sum_{a\\in A}\\frac1a: A\\subseteq [N] \\text{ is LCM-$k$-free}\\right\\}. $$ Addressing a problem of Erdős, we prove an explicit unconditional lower bound $$ f_k(N)\\ge (\\log N)^{c_k-o(1)}, \\qquad c_k:=\\frac{k-2}{e((k-2)!)^{1/(k-2)}}. $$ Let $F_k(n)$ denote the maximum size of a $k$-sunflower-free family of subsets of $[n]$, and define the Erdős--Szemerédi $k$-sunflower-free capacity by $μ_k^{\\mathrm S}:=\\limsup_{n\\to\\infty}F_k(n)^{1/n}$. Motivated by a remark of Erdős relating this problem to the sunflower conjecture, we show that $$ (\\log N)^{\\logμ_k^{\\mathrm S}-o(1)} \\le f_k(N) \\ll (\\log N)^{μ_k^{\\mathrm S}-1+o(1)}. $$ Furthermore, we show that the Erdős--Szemerédi sunflower conjecture fails for this fixed $k$ (i.e. $μ_k^{\\mathrm S}=2$) if and only if $f_k(N)=(\\log N)^{1-o(1)}$."}
{"id": "2512.20066", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20066", "abs": "https://arxiv.org/abs/2512.20066", "authors": ["Arijit Paul"], "title": "One-level density of zeros of $Γ_1(q)$ $L$-functions", "comment": null, "summary": "We study the one-level density of zeros for a family of $Γ_1(q)$ $L$-functions. Assuming GRH, we are able to extend the support of the Fourier transform of the test function to $\\left(-\\frac{8}{3},\\frac{8}{3}\\right)$ and verify the Katz-Sarnak prediction for our unitary family. As an application, we obtain that the proportion of forms in the family with non-vanishing at the central point is at least $62.5\\%$, assuming GRH. This is the highest non-vanishing proportion for any family associated with a unitary group. Moreover, this result indicates that the structural properties of $L$-functions play a more important role in extending the support than the associated symmetry group."}
{"id": "2512.20078", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20078", "abs": "https://arxiv.org/abs/2512.20078", "authors": ["Taekyun Kim", "Dae San Kim", "Hyunseok Lee", "Kyo-Shin Hwang"], "title": "Degenerate Euler- Seidel Method for degenerate Bernoulli, Euler, and Genocchi polynomials", "comment": "10 pages", "summary": "This paper introduces a degenerate version of the Euler-Seidel method by incorporating a parameter lambda into the classical recurrence relation. We define a degenerate Euler-Seidel matrix associated with an initial sequence and establish corresponding lambda-generalized binomial identities and generating function relations. By applying this method to the degenerate Bernoulli, Euler, and Genocchi polynomials, we derive several new combinatorial identities. This work extends the classical Euler-Seidel method to the domain of degenerate special polynomials and numbers, providing a new framework for studying their properties."}
{"id": "2512.20262", "categories": ["math.NT", "math.AC", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.20262", "abs": "https://arxiv.org/abs/2512.20262", "authors": ["Rishu Garg", "Jitender Singh"], "title": "On irreducible factors of polynomials over integers", "comment": "14 Pages", "summary": "In this paper, we obtain several new factorization results for certain classes of polynomials having integer coefficients. In doing so, we use the information about prime factorization of the value taken up by such polynomials and their higher order formal derivatives at sufficiently large integer arguments. If a lower bound for the minimum possible degree of a factor of such a polynomial is known a priori, then the integer argument becomes significantly smaller, which makes the underlying factorization result easier to apply. A result on explicit lower degree factor bound for the classes of polynomials considered in this paper is also proved via Newton polygons."}
{"id": "2512.20384", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20384", "abs": "https://arxiv.org/abs/2512.20384", "authors": ["Darsana N", "Sudhansu Sekhar Rout"], "title": "Diophantine Equations for Polynomial Recursive Sequences", "comment": "24 pages", "summary": "We study the Diophantine equation of type $U_n(x)=V_m(y)$, where $(U_n)_{n\\geq 0}$ and $(V_m)_{m\\geq 0}$ are polynomial power sums defined over a number field $K$. By applying the finiteness criterion of Bilu and Tichy, we show under appropriate assumptions that equation $U_n(x)=V_m(y)$ has infinitely many solutions with bounded $\\mathcal{O}_S$-denominator. We also study decomposable polynomials in third and second order linear recurrence sequences. In particular, we show that if $W_n(x)=g(h(x))$ for a simple third order linear recurrence sequence $(W_n(x))_{n\\geq 0}$ of complex polynomials, then deg $g$ is bounded. Furthermore, we show that if $(u_{n_1}+u_{n_2})(x)=g(h(x))$ for a binary recurrence sequence $(u_n(x))_{n\\geq 0}$ then deg $g$ is bounded."}
{"id": "2512.20398", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20398", "abs": "https://arxiv.org/abs/2512.20398", "authors": ["Boris Y. Rubinstein"], "title": "On the Sylvester waves in partition function", "comment": "4 pages", "summary": "Sylvester showed that the partition function can be written as a sum of the polynomial term and quasiperiodic components called the Sylvester waves. Recently an explicit expression of the Sylvester wave as a finite sum over the Bernoulli polynomials of higher order with periodic coefficients was found. This expression can be also written as the weighted sum of the polynomial terms with shifted arguments and this manuscript presents a formal proof for validity of such representation."}
{"id": "2512.20413", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20413", "abs": "https://arxiv.org/abs/2512.20413", "authors": ["Peter Vang Uttenthal"], "title": "Parameters of solvable automorphic forms", "comment": null, "summary": "In a letter from Tate to Serre dated March 26, 1974, Tate suggested a classification of weight one modular forms of prime level in terms of their associated odd Artin representations. This paper carries out an analogous classification of Maass wave forms of prime power level in terms of complex even representations. The parameters are identified with techniques from class field theory and Galois representations. The classification reveals that there exist distinct Maass cusp forms of tetrahedral type on $Γ_1(\\ell)$ that remain inequivalent modulo $3$ for $\\ell = 7687, 16363$ and $20887$, and that these $\\ell$ are the three smallest such primes."}
{"id": "2512.20461", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20461", "abs": "https://arxiv.org/abs/2512.20461", "authors": ["Peter Vang Uttenthal"], "title": "A classification of even representations onto 3-adic SL(2)", "comment": null, "summary": "This paper gives a classification of even representations onto $\\operatorname{SL}(2,\\mathbb{Z}_3)$ of prime conductor. In addition, an explicit algorithm based on global class field theory is exhibited, computing an exhaustive series of such even representations."}
{"id": "2512.20483", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20483", "abs": "https://arxiv.org/abs/2512.20483", "authors": ["Steven Creech", "Henry Twiss", "Zhining Wei", "Peter Zenz"], "title": "Second Moment of Central Values of Half-Integral Weight Modular Forms and Subconvexity", "comment": null, "summary": "We let $f$ be a half-integral weight modular form of weight $κ>4$ on $Γ_0(4)$ that is an eigenfunction of all Hecke operators $T_n$, so that $T_nf = Λ_f(n)n^{\\frac{κ-1}{2}}f$. Let $\\|f\\|$ denote the Petersson norm of $f$. We study a weighted second moment of the central value of the $L$-function associated to $f$ over an orthogonal basis $H_κ(4)$ of $S_κ(Γ_0(4))$. This corresponds to studying the following sum:\n  $$\\sum_{f\\in H_κ(4)}\\frac{Λ_f(n)\\vert L(1/2,f)\\vert^2}{\\|f\\|^2}.$$\n  Using the relative trace formula, we obtain an asymptotic formula for the second moment. We then use the method of amplification to get the subconvexity bound\n  $$L(1/2,f)\\ll_{\\varepsilon} (κ^2)^{\\frac{1}{4}-\\frac{1}{40}+\\varepsilon}.$$\n  This is the first subconvexity result for half-integral weight modular forms in the weight aspect. We also apply our second moment result to get a quantitative simultaneous non-vanishing result for central values of $L$-functions."}
{"id": "2512.20542", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.20542", "abs": "https://arxiv.org/abs/2512.20542", "authors": ["Yerko Torres-Nova"], "title": "Reciprocity For Dedekind Sums via Conical Zeta Values", "comment": null, "summary": "We study reciprocity formulas for Dedekind sums associated with absolutely continuous functions, extending the classical Dedekind-Rademacher reciprocity formula. In particular, we treat the case of periodic Bernoulli functions. Our approach generalizes an integral method and uses Fourier analysis to show that the reciprocity for polynomial-type functions admits a geometric interpretation in terms of conical zeta values."}
{"id": "2512.20525", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2512.20525", "abs": "https://arxiv.org/abs/2512.20525", "authors": ["Masao Oi"], "title": "Twisted character formula for toral supercuspidal representations", "comment": "68 pages", "summary": "We establish an explicit formula for twisted Harish-Chandra characters of toral supercuspidal representations of p-adic reductive groups under several technical assumptions. Our setup especially includes the case of a quasi-split group equipped with a involution."}
