{"id": "2512.18121", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.18121", "abs": "https://arxiv.org/abs/2512.18121", "authors": ["Ce Xu"], "title": "Classical Apéry-Like Series and Their Cyclotomic Parametric Analogues via Contour Integration", "comment": "18 pages", "summary": "In this paper, we present a method based on contour integration to investigate a class of cyclotomic parametric Apéry-like series. The general term of such series involves a parametric central binomial coefficient, which is defined via the Gamma function. Using this approach, we express a family of cyclotomic Apéry-like series in terms of multiple polylogarithms, cyclotomic Hurwitz zeta values, Riemann zeta values and $\\log(2)$. In particular, we provide several illustrative examples and corollaries, which enable us to recover a number of known results on Apéry-like series. At the same time, we have also left open two questions regarding Apéry-like series. Moreover, by considering integrals of the generating function for Fuss-Catalan numbers, we derive an alternative expression for a classical Apéry-like series. Combining this with known results allows us to establish several identities for multiple polylogarithm functions."}
{"id": "2512.18233", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.18233", "abs": "https://arxiv.org/abs/2512.18233", "authors": ["Anup B. Dixit", "Nikhil S Kumar"], "title": "How often are $ \\lfloor {n^α} \\rfloor $ and $ \\lfloor {n^β} \\rfloor $ simultaneously primes?", "comment": "11 pages", "summary": "Let $ \\lfloor {x} \\rfloor $ denote the greatest integer less than or equal to a real number $x$. Given real numbers $0<α_1 < α_2 < \\cdots< α_k < 1$ satisfying a certain condition, we show that there are infinitely many positive integers $n$ for which all of $ \\lfloor{n^{α_1}}\\rfloor, \\lfloor{n^{α_2}}\\rfloor,\\ldots, \\lfloor{n^{α_k}}\\rfloor $ are prime numbers. Our approach relies on establishing a simultaneous equidistribution theorem for $ \\lfloor{n^{α_i}}\\rfloor $ across $k$-many arithmetic progressions."}
{"id": "2512.18424", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.18424", "abs": "https://arxiv.org/abs/2512.18424", "authors": ["Scott Duke Kominers"], "title": "A Flanking Pattern in a Sum-of-Divisors Congruence", "comment": "8 pages, 2 tables, plus source code appendix", "summary": "We consider composite $n$ satisfying the congruence $$n \\cdot σ_k(n) \\equiv 2 \\pmod{φ(n)},$$ and show a \"flanking\" structure: $14$ appears in both $S_{k-1}$ and $S_{k+1}$ whenever certain values of $n$ appear in $S_k$; and, moreover, $14$ is the only (nontrivial) case of this property. Along the way, we derive a new characterization of the $n$ that appear in the sets $S_{k}$."}
{"id": "2512.18502", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.18502", "abs": "https://arxiv.org/abs/2512.18502", "authors": ["Mahipal Gurram"], "title": "Explicit Lower Bounds for Dirichlet Series of Higher Power Representation Functions", "comment": null, "summary": "We investigate Dirichlet-type series generated by representation functions that count the number of ways an integer can be expressed as a sum of 'k' signed higher even powers. By combining generalized theta generating functions with a family of generalized cotangent series introduced in previous work, we derive two distinct explicit lower bounds for these series. The first estimate arises from a geometric restriction of the lattice to its diagonal, while the second utilizes Holder's inequality on the integral representation of the series. The methods presented here avoid modular techniques and offer a flexible analytic framework for higher-power representation problems."}
{"id": "2512.18042", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2512.18042", "abs": "https://arxiv.org/abs/2512.18042", "authors": ["Nguyen N. Hung"], "title": "Problems on the conductor of finite group characters", "comment": "18 pages", "summary": "This paper reviews recent results and open problems on the conductor of finite group characters, highlighting their connections to one another and to broader topics in the representation theory of finite groups."}
{"id": "2512.18581", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.18581", "abs": "https://arxiv.org/abs/2512.18581", "authors": ["Liwen Gao", "Xuejun Guo"], "title": "Trigonometric Determinants via special values of Dirichlet $L$-Functions", "comment": null, "summary": "In this paper, we investigate the determinants involving some trigonometric functions. We establish a connection between these determinants and the special values of Dirichlet L-functions, thereby extending Guo's results to arbitrary positive integers n. In addition, we also prove a conjecture raised by Zhi-Wei Sun. Our main tool is the spectral decomposition of some linear operators. By the same method we obtain an explicit formula for the determinants of sine matrices. This formula is expressed as a product of Gauss sums attached to Dirichlet characters."}
{"id": "2512.18150", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.18150", "abs": "https://arxiv.org/abs/2512.18150", "authors": ["Robert Boltje", "John Revere McHugh"], "title": "Fixed points of extended tensor products", "comment": null, "summary": "For a $p$-permutation equivalence between two block algebras of finite groups, we introduce new square diagrams that link the $p$-permutation equivalence via the Brauer construction to local equivalences between stabilizers of corresponding Brauer pairs. These diagrams can be viewed as lifts of the square diagrams in the definition of isotypies. The proof of the commutativity requires new technical tools, namely a formula for how taking fixed points commutes with extended tensor products of finite sets with group actions and how the Brauer construction commutes with taking extended tensor products of $p$-permutation modules. These fundamental formulas, generalizing earlier results by Boltje-Danz and by Boltje-Perepelitsky, should be of independent interest."}
{"id": "2512.18677", "categories": ["math.NT", "math.CA"], "pdf": "https://arxiv.org/pdf/2512.18677", "abs": "https://arxiv.org/abs/2512.18677", "authors": ["David Berghaus", "Andriy Bondarenko", "Danylo Radchenko", "Kristian Seip", "Qihang Sun"], "title": "The basis functions of Fourier interpolation", "comment": null, "summary": "The basis functions of the Fourier interpolation formula of Radchenko and Viazovska, constructed by means of weakly holomorphic modular forms for the Hecke theta group, are entire functions of order $2$ having interesting time-frequency properties. We give precise size estimates and study the distribution of zeros of these functions. We give in particular asymptotic estimates for the location and the number of extraneous zeros on or close to the real line. This result reveals the surprising existence of Fourier nonuniqueness pairs whose apparent ``excess'' compared to the Fourier uniqueness pair of Radchenko and Viazovska may be made arbitrarily large. Our estimates also show that the basis functions fail to yield a Riesz basis in the Hilbert space used by Kulikov, Nazarov, and Sodin in their recent study of Fourier uniqueness pairs. Some numerical data are presented, suggesting additional fine scale properties."}
{"id": "2512.18417", "categories": ["math.RT", "math.CT", "math.KT"], "pdf": "https://arxiv.org/pdf/2512.18417", "abs": "https://arxiv.org/abs/2512.18417", "authors": ["Panagiotis Kostas", "Chrysostomos Psaroudakis", "Jorge Vitória"], "title": "Intrinsic homological algebra for triangulated categories", "comment": "28 pages, comments are welcome", "summary": "We propose a new framework for the study of homological properties for (compactly generated) triangulated categories such as regularity, finiteness of global or finitistic dimension, gorensteinness or injective generation and the relation between them. Our approach focuses on distinguished, intrinsically defined, subcategories and our main tool is the new notion of far-away orthogonality. We observe that these homological properties generalise previously studied properties on derived categories of modules over rings, and we use the generality of our theory to also examine those same attributes for the homotopy category of injectives and the big singularity category (in the sense of Krause) of an Artin algebra, as well as the derived category of a non-positive differential graded algebra. Finally, using our theory we recover and generalise various results in the theory of recollements of triangulated categories."}
{"id": "2512.18825", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.18825", "abs": "https://arxiv.org/abs/2512.18825", "authors": ["Chifan Leung", "Clayton Petsche"], "title": "The Minkowski dimension of the image of an arboreal Galois representation", "comment": null, "summary": "Let $f:\\mathbb{P}^1\\to\\mathbb{P}^1$ be a rational map of degree $d\\geq2$ defined over a number field $K$ and let $α\\in\\mathbb{P}^1(K)$. We consider the lower and upper Minkowski dimensions of the arboreal Galois group $G_{f,α}$ associated to the pair $(f,α)$, which is naturally a subgroup of the automorphism group of the infinite $d$-ary rooted tree whose vertices are indexed by the backward orbit $f^{-\\infty}(α)$. We state conjectures on the existence of Minkowski dimension, as well as proposed characterizations of cases in which it takes its minimal and maximal values. We establish basic cases in which the upper Minkowski dimension of $G_{f,α}$ is not maximal, and we establish basic cases in which it is minimal. We show that abelian automorphism groups always have vanishing Minkowski dimension, and as a consequence, that one of our conjectures implies a conjecture of Andrews-Petsche on pairs $(f,α)$ with abelian arboreal Galois group."}
{"id": "2512.18668", "categories": ["math.RT", "math.CO", "math.GR"], "pdf": "https://arxiv.org/pdf/2512.18668", "abs": "https://arxiv.org/abs/2512.18668", "authors": ["Dibyendu Biswas"], "title": "Pieri rule for classical groups, a new perspective", "comment": "19 pages, comments and suggestions are welcome", "summary": "We study a new perspective on a certain Pieri rules for classical groups. Furthermore, we extend a fundamental theorem of Kostant concerning tensor products for classical groups. We show that a certain form of the Pieri rule is equivalent to the converse of this extended version of Kostant's theorem. In addition, we show an equivalence between the Pieri rule and the branching rule for general linear groups."}
{"id": "2512.18936", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.18936", "abs": "https://arxiv.org/abs/2512.18936", "authors": ["Ali Saraeb"], "title": "Fake Mobius-type Functions on the Unit Circle", "comment": null, "summary": "We study \\emph{fake Mobius-type functions on the unit circle}: multiplicative functions $\\mathfrak f$ determined by prime-power data $\\mathfrak f(p^k)=\\varepsilon_k\\in\\mathbb S^1\\cup\\{0\\}$, independent of $p$. Their Dirichlet series admits the Euler product \\[ F_{\\mathfrak f}(s)=\\sum_{n\\ge1}\\frac{\\mathfrak f(n)}{n^s} =\\prod_p g(p^{-s}),\\qquad g(u)=\\sum_{k\\ge0}\\varepsilon_k u^k, \\] and a canonical zeta-factorization \\[ F_{\\mathfrak f}(s)=ζ(s)^{\\,z}\\,ζ(2s)^{\\,w}\\,G_{\\mathfrak f}(s), \\qquad z=\\varepsilon_1,\\ \\ w=\\varepsilon_2-\\frac{\\varepsilon_1(\\varepsilon_1+1)}{2}, \\] where $G_{\\mathfrak f}(s)$ is a holomorphic Euler product on $\\Re s>1/3$.\n  Assuming the Riemann hypothesis and simplicity of zeros, we derive a general explicit and asymptotic formula for the summatory functions $A_{\\mathfrak f}^{\\exp}(x)$ of the form \\[ A_{\\mathfrak f}^{\\exp}(x) -Δ_1(x;z,w) = Δ_{1/2}(x;z,w)\\;+\\;\\sum_ρΔ_ρ(x;z,w,\\mathfrak f)\\;+\\;\\mathcal E(x), \\] where $Δ_1(x;z,w)$ is the main term coming from the $s=1$ singularity of $ζ(s)^z$, $Δ_{1/2}(x;z,w)$ is the secondary term coming from the $s=1/2$ singularity of $ζ(2s)^w$, the terms $Δ_ρ(x;z,w,\\mathfrak f)$ arise from the singularities of $ζ(s)^z$ at nontrivial zeros $ρ$ of $ζ(s)$, and $\\mathcal E(x)$ is an error term. Furthermore, we introduce a notion of \\emph{bias} at the natural scale $x^{1/2}(\\Log x)^{w-1}$ and obtain an explicit criteria distinguishing persistent, apparent, and unbiased behavior in this regime.\n  The present paper treats the major parameter region \\[ -1\\le\\Re(z)\\le1,\\qquad -2\\le\\Re(w)<1, \\] and we choose to defer the complementary ranges of $(z,w)$ to a future paper as a different analytic approach is required there."}
{"id": "2512.18685", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.18685", "abs": "https://arxiv.org/abs/2512.18685", "authors": ["Maarten Solleveld"], "title": "Standard modules and intertwining operators for reductive p-adic groups", "comment": null, "summary": "Consider a reductive group G over a non-archimedean local field. The Galois group Gal(C/Q) acts naturally on the category of smooth complex G-representations. We prove that this action stabilizes the class of standard modules. This generalizes and relies on an analogous result about essentially square-integrable representations.\n  Other important objects in the proof of our main result are intertwining operators between parabolically induced G-representations, and the associated Harish-Chandra μ-functions. We determine an explicit formula for the μ-function of any irreducible representation of any Levi subgroup of G."}
{"id": "2512.19076", "categories": ["math.NT", "cs.DS"], "pdf": "https://arxiv.org/pdf/2512.19076", "abs": "https://arxiv.org/abs/2512.19076", "authors": ["Yiming Gao", "Yansong Feng", "Honggang Hu", "Yanbin Pan"], "title": "On Factoring and Power Divisor Problems via Rank-3 Lattices and the Second Vector", "comment": null, "summary": "We propose a deterministic algorithm based on Coppersmith's method that employs a rank-3 lattice to address factoring-related problems. An interesting aspect of our approach is that we utilize the second vector in the LLL-reduced basis to avoid trivial collisions in the Baby-step Giant-step method, rather than the shortest vector as is commonly used in the literature. Our results are as follows:\n  1. Compared to the result by Harvey and Hittmeir (Math. Comp. 91 (2022), 1367 - 1379), who achieved a complexity of O( N^(1/5) log^(16/5) N / (log log N)^(3/5)) for factoring a semiprime N = pq, we demonstrate that in the balanced p and q case, the complexity can be improved to O( N^(1/5) log^(13/5) N / (log log N)^(3/5) ).\n  2. For factoring sums and differences of powers, that is, numbers of the form N = a^n plus or minus b^n, we improve Hittmeir's result (Math. Comp. 86 (2017), 2947 - 2954) from O( N^(1/4) log^(3/2) N ) to O( N^(1/5) log^(13/5) N ).\n  3. For the problem of finding r-power divisors, that is, finding all integers p such that p^r divides N, Harvey and Hittmeir (Proceedings of ANTS XV, Research in Number Theory 8 (2022), no. 4, Paper No. 94) recently directly applied Coppersmith's method and achieved a complexity of O( N^(1/(4r)) log^(10+epsilon) N / r^3 ). By using faster LLL-type algorithms and sieving on small primes, we improve their result to O( N^(1/(4r)) log^(7+3 epsilon) N / ((log log N minus log(4r)) r^(2+epsilon)) ). The worst-case running time for their algorithm occurs when N = p^r q with q on the order of N^(1/2). By focusing on this case and employing our rank-3 lattice approach, we achieve a complexity of O( r^(1/4) N^(1/(4r)) log^(5/2) N ).\n  In conclusion, we offer a new perspective on these problems, which we hope will provide further insights."}
{"id": "2512.18704", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2512.18704", "abs": "https://arxiv.org/abs/2512.18704", "authors": ["Mariagrazia Bianchi", "Nicola Sambonet"], "title": "A note on the projective representations of $p$-solvable and $π$-separable group", "comment": "11 pages", "summary": "Following Gluck and Wolf we complete the Itô--Michler's Theorem for the projective representations of a $p$-solvable or $π$-separable group, and then we relate the projective irreducible modules of such a group with those of its Sylow $p$-subroups and Hall $π$-subgroups."}
{"id": "2512.19518", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.19518", "abs": "https://arxiv.org/abs/2512.19518", "authors": ["Frauke M. Bleher", "Ted Chinburg", "Xuxi Ding", "Nadia Heninger", "Daniele Micciancio"], "title": "On the radii of Voronoi cells of rings of integers", "comment": "19 pages", "summary": "Since the time of Minkowski a basic problem in number theory has been to find lower bounds for the absolute value $Δ(K)$ of the discriminant of a number field $K$ in terms of the degree $n(K)$ of $K$. In this paper we study another measure of the size of $K$ given by the covering radius $μ(K)$ of the ring of integers $O_K$ of $K$. Here $μ(K)$ is the $L^2$ radius $||V_2(K)||_2$ of the $L^2$ Voronoi cell $V_2(K)$ of $O_K$, where $V_2(K)$ is the set of points in $\\mathbb{R} \\otimes_{\\mathbb{Q}} K$ that are at least as close to the origin as they are to any non-zero element of $O_K$. To put a limit on what lower bounds one can prove for $μ(K)$ in terms of $n(K)$, we study infinite families of $K$ of increasing degree for which $μ(K)$ can be bounded above by an explicit power of $n(K)$. We also study analogous questions when the $L^2$ norm is replaced by the $L^\\infty$ norm."}
{"id": "2512.18743", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.18743", "abs": "https://arxiv.org/abs/2512.18743", "authors": ["Justine Fasquel", "Shigenori Nakatsuka"], "title": "Quantum Hamiltonian reductions for W-algebras", "comment": "17 pages. Comments are welcome", "summary": "In this paper, we establish a general criterion for good pairs, namely pairs consisting of a nilpotent orbit and an even good grading in a simple Lie algebra, which guarantees the existence of a quantum Hamiltonian reduction between associated affine W-algebras. In particular, we show that for type A, any two affine W-algebras associated with two adjacent nilpotent orbits are related by quantum Hamiltonian reductions in full generality."}
{"id": "2512.19586", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.19586", "abs": "https://arxiv.org/abs/2512.19586", "authors": ["Diego Marques", "Pavel Trojovsky"], "title": "Geometric Progressions meet Zeckendorf Representations", "comment": null, "summary": "Motivated by Erdős' ternary conjecture and by recent work of Cui--Ma--Jiang [``Geometric progressions meet Cantor sets'', \\textit{Chaos Solitons Fractals} \\textbf{163} (2022), 112567.] on intersections between geometric progressions and Cantor-like sets in standard bases, we study the corresponding problem in the Zeckendorf numeration system. We prove that, for any fixed finite set of forbidden binary patterns, any integers $u\\ge 1$, $q\\ge 2$, and any window size $M$, the set of exponents $n$ for which the Zeckendorf expansion of $u q^n$ avoids the forbidden patterns within its $M$ least significant digits is either finite or ultimately periodic."}
{"id": "2512.18877", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.18877", "abs": "https://arxiv.org/abs/2512.18877", "authors": ["Susumu Ariki", "Sinéad Lyle", "Liron Speyer", "Qi Wang"], "title": "Schurian-finiteness of blocks of type B Hecke algebras", "comment": "This is a preliminary version of the paper, and we hope to extend the work to resolve some of the remaining blocks", "summary": "Schurian-finiteness, also known as $τ$-tilting finiteness, is equivalent to the finiteness of various representation theoretic objects such as wide subcategories. The first three authors classified Schurian-finite blocks of type A Hecke algebras in [ALS23]. Here we study the Schurian-finiteness of blocks of type B Hecke algebras, and determine the Schurian-finiteness of all blocks if the Hecke algebra is `non-integral', and for almost all blocks in the integral case. The only remaining cases are a small number of blocks in defect $3$ when $e=3$, and a family of blocks in defects $3$ and $4$ for $e\\geqslant4$. The classification is mostly achieved by methods using decomposition numbers, with many degenerate cases requiring direct study using standard methods from the representation theory of quivers."}
{"id": "2512.19597", "categories": ["math.NT", "math.AG", "math.CA", "math.GR"], "pdf": "https://arxiv.org/pdf/2512.19597", "abs": "https://arxiv.org/abs/2512.19597", "authors": ["Eric M. Rains"], "title": "The monodromy of cyclic Pryms", "comment": "49 pages, LaTeX", "summary": "The {\\em Prym} of a cyclic covering of smooth projective curves is the ``new'' part of the Jacobian: the quotient of the Jacobian of the covering curve by the Jacobians of the intermediate covers. Given a family of such coverings, the fundamental group of the base of the family acts on the Tate modules of the Pryms, and the image of this representation is a key ingredient in answering arithmetic statistics questions about the distribution of the group structure of the $L$-torsion of a random Prym in the family. (Over ${\\mathbb{F}}_q$, the action of Frobenius is roughly uniformly distributed over the {\\em arithmetic} monodromy, a coset of the image of the fundamental group of the base change to $\\bar{\\mathbb{F}}_q$ (the {\\em geometric} monodromy).) In the present note, we show for a number of natural families that (with limited exceptions) the geometric monodromy is sandwiched between a certain unitary group and its derived subgroup. In particular, this holds for the one-parameter families obtained by starting with any fixed cover and varying one (tame) ramification point. As an application, we deduce analogous largeness results for the monodromy of the Selmer groups of elliptic surfaces with $j=0$ or $j=1728$, by relating them to cyclic covers of degree 6 or 4 respectively, implying that their Selmer groups do not satisfy the standard heuristics. For instance, for eliptic surfaces with $j=0$ of sufficiently large height over ${\\mathbb{P}}^1_{\\mathbb{F}_q}$, the average size of the $l$-Selmer group is $l+3+o_q(1)$ when $l$ (fixed) and $q$ (large) are both 1 mod 3, compared to $l+1+o_q(1)$ for general elliptic surfaces."}
{"id": "2512.19034", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.19034", "abs": "https://arxiv.org/abs/2512.19034", "authors": ["Eric Marberg"], "title": "Brion atoms for classical types", "comment": "65 pages, 1 figure, 5 tables", "summary": "Let $G$ be a classical group defined over the complex numbers with a Borel subgroup $B$. Choose a holomorphic involution of $G$ and let $K$ be its set of fixed points. The group $K$ acts on the flag variety $G/B$ with finitely many orbits and Brion has derived a general formula for the cohomology classes of the corresponding orbit closures as linear combinations of Schubert classes. This article provide a uniform description of the sets of Weyl group elements (which we refer to as Brion atoms) indexing the terms in this formula. This builds on prior work addressing types A, B, and C. The main novelty of our results is a thorough treatment of type D. As one application, we introduce a notion of involution Schubert polynomials for all classical types and present several conjectures related to these objects."}
{"id": "2512.19344", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2512.19344", "abs": "https://arxiv.org/abs/2512.19344", "authors": ["Zhe Li", "Shanwen Wang", "Zhiqi Zhu"], "title": "Parameters and Theta lifts", "comment": "36 pages", "summary": "In this note, we make explicit the correspondence between Harish-Chandra parameters and Langlands-Vogan parameters for symplectic groups and orthogonal groups of equal rank over reals. As an application, we reformulate Moeglin's results and Paul's work on the Howe correspondence for symplectic-orthogonal dual pairs using Langlands-Vogan parameters."}
{"id": "2512.19045", "categories": ["math.RT", "math.CO", "math.KT"], "pdf": "https://arxiv.org/pdf/2512.19045", "abs": "https://arxiv.org/abs/2512.19045", "authors": ["Eric Marberg"], "title": "Classical double Grothendieck transitions", "comment": "40 pages", "summary": "Kirillov and Naruse have constructed double Grothendieck polynomials to represent the equivariant K-theory classes of Schubert varieties in the complete flag manifolds of types B, C, and D. We derive a recursive formula for these polynomials, extending certain K-theoretic transition equations known in type A to all classical types. As an application, we obtain an identity that expands the K-Stanley symmetric functions in types B, C, and D into positive linear combinations of K-theoretic Schur P- and Q-functions. We also resolve several positivity conjectures related to the skew generalizations of the latter functions."}
{"id": "2512.19257", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.19257", "abs": "https://arxiv.org/abs/2512.19257", "authors": ["Willem de Graaf", "Alexander Elashvili", "Mamuka Jibladze"], "title": "A classification of four-tuples of spinors of a ten dimensional space", "comment": null, "summary": "We use the theory of theta-groups developed by Vinberg, along with computations in the computer algebra system GAP4, to classify the orbits of Spin(10,C)x SL(4,C) acting on the tensor product of the half spin module of Spin(10,C) and the natural module of SL(4,C)."}
{"id": "2512.19296", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.19296", "abs": "https://arxiv.org/abs/2512.19296", "authors": ["Zetao Lin", "Shiping Liu"], "title": "Almost split sequences in abelian categories", "comment": null, "summary": "Using the Nakayama duality induced by a Nakayama functor, we provide a novel and concise account of the existence of Auslander-Reiten dualities and almost split sequences in abelian categories with enough projective objects or enough injective objects. As an example, we establish the existence of almost split sequences ending with finitely presented modules and those starting with finitely copresented modules in the category of all modules over a small endo-local Hom-reflexive category. Specializing to algebras given by (not necessarily finite) quivers with relations, we further investigate when the categories of finitely presented modules, finitely copresented modules and finite dimensional modules have almost split sequences on either or both sides."}
{"id": "2512.19344", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2512.19344", "abs": "https://arxiv.org/abs/2512.19344", "authors": ["Zhe Li", "Shanwen Wang", "Zhiqi Zhu"], "title": "Parameters and Theta lifts", "comment": "36 pages", "summary": "In this note, we make explicit the correspondence between Harish-Chandra parameters and Langlands-Vogan parameters for symplectic groups and orthogonal groups of equal rank over reals. As an application, we reformulate Moeglin's results and Paul's work on the Howe correspondence for symplectic-orthogonal dual pairs using Langlands-Vogan parameters."}
{"id": "2512.19558", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2512.19558", "abs": "https://arxiv.org/abs/2512.19558", "authors": ["Johannes Flake", "Jonathan Gruber"], "title": "Monoidal Ringel duality and monoidal highest weight envelopes", "comment": null, "summary": "We show that a large class of non-abelian monoidal categories can be realized as subcategories of tilting objects in abelian monoidal categories with a highest weight structure. The construction relies on a monoidal enhancement of Brundan-Stroppel's semi-infinite Ringel duality and applies to many of Sam-Snowden's triangular categories and Knop's tensor envelopes of regular categories. We also explain how monoidal Ringel duality gives rise to monoidal structures on categories of representations of affine Lie algebras at positive levels."}
