{"id": "2511.11783", "categories": ["math.NT", "math.AC"], "pdf": "https://arxiv.org/pdf/2511.11783", "abs": "https://arxiv.org/abs/2511.11783", "authors": ["Teresa Cortadellas Benitez", "Carlos D'Andrea", "Ana Belen de Felipe", "Joel Hurtado Moreno", "M. Eulalia Montoro"], "title": "On the effective Pourchet's Theorem", "comment": "12 pages, latex", "summary": "With the aid of Hensel Lemma, we refine the 2-adic Newton polygon algorithm proposed by Magron, Koprowski, and Vaccon at ISSAC 2023 to express computationally a given positive univariate polynomial with rational coefficients as a sum of five squares of rational polynomials -the effective Pourchet's Theorem- and extend it to cover almost all the possible inputs. We also provide examples which are covered with our methods but cannot be detected by previous conjectural algorithms."}
{"id": "2511.11832", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.11832", "abs": "https://arxiv.org/abs/2511.11832", "authors": ["Dmitry Gayfulin", "Erez Nesharim"], "title": "Sums of Laurent series with bounded partial quotients", "comment": "12 pages", "summary": "In 1947 M.Hall proved that every real number is the sum of an integer and two real numbers whose partial quotients are at most $4$. Later, Cusick proved that every real number is the sum of an integer and two real numbers whose partial quotients are at least $2$. In a recent paper, the authors proved that every real number is the sum of two real numbers whose partial quotients diverge. In this paper, we prove an analogue of these results for Laurent series."}
{"id": "2511.11841", "categories": ["math.NT", "math.GR"], "pdf": "https://arxiv.org/pdf/2511.11841", "abs": "https://arxiv.org/abs/2511.11841", "authors": ["Shubham Jaiswal", "M Krithika", "P Vanchinathan"], "title": "On Variants of Inverse Cluster Size Problem & General Magnification", "comment": "13 pages", "summary": "In this article we establish certain variants of the Inverse Cluster Size problem. We introduce the notion of primitive extensions and establish the Primitive variant of the problem. Precisely, we prove the existence of primitive extensions over number fields of any given degree and cluster size less than the degree. We also introduce the notions of Strong and Weak General Magnification and the notion of general primitive extensions. We establish some interesting cases of the General primitive variant of the problem."}
{"id": "2511.11948", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.11948", "abs": "https://arxiv.org/abs/2511.11948", "authors": ["Zachary Couvillon", "Anwesh Ray"], "title": "Counting elliptic curves with prescribed entanglements", "comment": "15 pages, accepted for publication in Research in Number theory", "summary": "We establish asymptotic lower bounds for the number of elliptic curves over $\\mathbb{Q}$ with prescribed entanglement of division fields, ordered by naive height. Such elliptic curves are obtained as $1$-parameter families arising from certain genus $0$ modular curves. We apply techniques from the geometry of numbers and sieve methods to prove that the number of elliptic curves with unexplained entanglements $\\mathbb{Q}(E[2]) \\cap \\mathbb{Q}(E[3]) \\neq \\mathbb{Q}$ and $\\mathbb{Q}(E[2]) \\cap \\mathbb{Q}(E[5]) \\neq \\mathbb{Q}$ and naive height $\\leq X$, grows as $\\gg X^{1/9}$ and $\\gg X^{1/12}$, respectively."}
{"id": "2511.12198", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.12198", "abs": "https://arxiv.org/abs/2511.12198", "authors": ["Alireza Nasr-Isfahani"], "title": "Finiteness of semibricks and brick-finite algebras", "comment": null, "summary": "For a finite-dimensional algebra Λ, we establish an explicit bijection between widely generated torsion(-free) classes and semibricks in mod Λ. Using the kappa order on the lattice of torsion classes with canonical join representations, we provide several equivalent conditions for brick-finite algebras. We show that Λ is brick-finite if and only if any chain of wide subcategories of mod Λ becomes eventually constant, if and only if any torsion class in mod Λ has finitely many covers, if and only if every semibrick in mod Λ is a finite set. Thus, we give a proof of Enomoto's conjecture (Adv. Math., 393 (2021), 108113). As a consequence, we show that Λ is brick-finite if and only if every wide subcategory closed under coproducts of Mod Λ is closed under products, if and only if every wide subcategory of mod Λ is functorially finite. This gives a positive answer to the question posed by Angeleri Hügel and Sentieri (J. Algebra, 664 (2025), 164-205)."}
{"id": "2511.12465", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.12465", "abs": "https://arxiv.org/abs/2511.12465", "authors": ["Qingfeng Sun", "Qizhi Zhang"], "title": "Equidistribution of holomorphic cusp forms on thin sets", "comment": null, "summary": "In this paper, we prove an average result concerning Young's restricted Quantum Unique Ergodicity conjecture (rQUE), which addresses the sequence of measures induced by Hecke cusp forms converges in the weak-* topology on certain specific submanifolds. Our methods are fundamentally geometric. It is worth noting that our arguments make no use of the theory of L-functions."}
{"id": "2511.12299", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.12299", "abs": "https://arxiv.org/abs/2511.12299", "authors": ["Kwangho Choiy", "Shiv Prakash Patel"], "title": "Distinguished representations for $\\rm{SL}(n,F)$", "comment": "9 pages", "summary": "Let $F$ be a finite field, and let $\\mathbb{E}$ be either a quadratic field extension $E/F$ or the split algebra $F \\oplus F$. We study distinguished representations of $\\rm{SL}_{2n}(F)$ by the subgroup $H_{\\flat} := \\rm{SL}_{2n}(F) \\cap \\rm{GL}_{n}(\\mathbb{E})$, which is a variation of the work of Anandavardhanan and Prasad on distinguished representations of $\\rm{SL}_{n}(\\mathbb{E})$ by the subgroup $\\rm{SL}_n(F)$. This is in a similar framework of our earlier work of a $p$-adic non-split variation of Anandavardhanan-Prasad over finite fields. We give a formula for the dimension of the complex vector space $\\rm{Hom}_{H_{\\flat}}(π_{\\flat}, 1)$ in terms of certain characters of $F^{\\times}$, where $π_{\\flat}$ is an irreducible representation which is also distinguished by $H_{\\flat}$."}
{"id": "2511.12513", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.12513", "abs": "https://arxiv.org/abs/2511.12513", "authors": ["Ron Evans", "Mark Van Veen"], "title": "Cubic residuacity of real quadratic integers", "comment": "8 pages", "summary": "Given a real quadratic integer $u=A+B\\sqrt{D}$ with cubic norm, we identify all the classes in a related form class group that represent primes $p$ for which $u$ is a cubic residue mod $p$. A special case of this result was conjectured in a 2025 paper of Evans, Lemmermeyer, Sun, and Van Veen."}
{"id": "2511.12619", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.12619", "abs": "https://arxiv.org/abs/2511.12619", "authors": ["Difan Deng", "Shengfei Geng", "Pin Liu"], "title": "Intersection vectors over skew-tilings", "comment": "22 pages, comments welcome", "summary": "We prove that under a mild condition, a multiset of tagged permissible arcs over a skew-tiling is uniquely determined by its intersection vector. As an application, it is proved that -- up to isomorphism -- different $τ$-rigid modules over a skew-gentle algebra $A$ arising from a skew-triple $(Q,Sp,I)$ have different dimension vectors if and only if $(Q,I)$ has no minimal oriented cycle of even-length with full zero relations. This generalizes a recent work of Fu-Geng for gentle algebras."}
{"id": "2511.12811", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.12811", "abs": "https://arxiv.org/abs/2511.12811", "authors": ["Min Shi"], "title": "G-companions on algebraic stacks and applications to canonical $\\ell$-adic local systems on Shimura stacks", "comment": "first version", "summary": "Cases of Deligne's companion conjecture for normal schemes over finite fields have been proven by L. Lafforgue, Drinfeld, and Zheng in recent years: L. Lafforgue proved the conjecture for curves, Drinfeld proved the conjecture for all smooth schemes and later also for representations valued in a reductive group, and Zheng proved Deligne's conjecture for smooth Artin stacks. In this paper, we extend Drinfeld's theorem for general reductive groups to smooth Artin stacks of finite presentation and apply the result to the study of compatibility of the canonical $\\ell$-adic local systems on Shimura stacks."}
{"id": "2511.13345", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2511.13345", "abs": "https://arxiv.org/abs/2511.13345", "authors": ["Nicolás Andruskiewitsch", "Dirceu Bagio", "Saradia Della Flora", "Daiana Flôres"], "title": "The Green ring of a restricted enveloping algebra in characteristic 2", "comment": null, "summary": "Let $\\Bbbk$ be an algebraically closed field of characteristic $2$ and let $\\mathfrak{fsl}(2)$ be the unique, up to isomorphism, $3$-dimensional simple Lie algebra over $\\Bbbk$. Denote by $\\mathfrak{m}$ the minimal $2$-envelope of $\\mathfrak{fsl}(2)$ and by $\\mathfrak{u}(\\mathfrak{m})$ its corresponding restricted enveloping algebra. The non-isomorphic finite-dimensional indecomposable $\\mathfrak{u}(\\mathfrak{m})$-modules were classified in \\cite{ABDF}. In this paper, the Green ring (or representation ring) for $\\mathfrak{u}(\\mathfrak{m})$ is calculated. Also, the semisimplification of the representation category of $\\mathfrak{u}(\\mathfrak{m})$ is determined."}
{"id": "2511.12944", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.12944", "abs": "https://arxiv.org/abs/2511.12944", "authors": ["Chenghui Ren"], "title": "Twin Primes and Weighted Sieve Integrals: An Analytic Resolution", "comment": "Preprint. 30 pages, no figures. This work presents an analytic resolution of the twin prime conjecture using weighted sieve integrals. Intended for future journal submission. Comments and feedback are welcome", "summary": "The twin prime conjecture asserts the existence of infinitely many pairs of prime numbers differing by two. In recent years, substantial progress has been made by several mathematicians toward this problem \\cite{zhang2014bounded, pollack2014bounded, granville2016bounded, vatwani2017bounded}, yet a complete resolution remains elusive. This paper refines the application of weighted sieve techniques to address the conjecture. By analyzing a logarithmically weighted sum over prime pairs and establishing a strictly positive lower bound for its asymptotic behavior, we confirm the infinitude of twin primes within the analytic framework developed herein."}
{"id": "2511.13620", "categories": ["math.RT", "math-ph", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.13620", "abs": "https://arxiv.org/abs/2511.13620", "authors": ["Alberto De Sole", "Jiefeng Liu", "Daniele Valeri"], "title": "Cohomology of Lie conformal algebroids", "comment": "38 pages", "summary": "We study Lie conformal algebroids (LCAd) and their representations using the language of lambda-brackets and Lie conformal algebras. We describe several general constructions, such as the LCAd of conformal derivations CDer(A) of a differential algebra A, the gauge LCAd G(A,M) associated to a differential algebra A and its module M, the current LCAd F^ of a Lie algebroid F, and the LCAd structure of the space Omega(V) of Kahler differentials over a Poisson vertex algebra (PVA) V. We develop the cohomology theories of LCAd and we relate them to the corresponding cohomology theories of PVA. In particular, we find an isomorphism between the cohomology of a PVA V with coefficients in a module M and the corresponding cohomology of the LCAd Omega(V) with coefficients in the same module."}
{"id": "2511.13230", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13230", "abs": "https://arxiv.org/abs/2511.13230", "authors": ["Petar Orlić"], "title": "Tetragonal modular quotients of $X_0(N)$", "comment": null, "summary": "Let $N$ be a positive integer. For every $d\\mid N$ such that $(d,N/d)=1$ there exists an Atkin-Lehner involution $w_d$ of the modular curve $X_0(N)$. Let $B(N)$ be the group of all such involutions. In this paper we determine all $\\mathbb C$ and $\\mathbb Q$-tetragonal quotient curves $X_0(N)/W_N$, where $W_N\\subseteq B(N)$ such that $4\\leq|W_N|\\leq 2^{ω(N)-1}$, thus completing the classification of all $\\mathbb C$-tetragonal quotients of $X_0(N)$ by Atkin-Lehner involutions."}
{"id": "2511.13627", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13627", "abs": "https://arxiv.org/abs/2511.13627", "authors": ["Aristides V. Doumas", "Panayiotis J. Psarrakos"], "title": "The Fibonacci--Redheffer matrix and its properties", "comment": "24 pages, 1 figure, 1 table", "summary": "A Redheffer--type matrix with Fibonacci entries is defined, and the determinant and spectral properties of this matrix are studied. Also, more general Redheffer--type matrices are considered and intriguing number-theoretic examples are illustrated. Furthermore, several asymptotic results are discussed and a new expression related to the Riemann hypothesis is presented."}
{"id": "2511.13659", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13659", "abs": "https://arxiv.org/abs/2511.13659", "authors": ["Koen de Boer", "Aurel Page", "Radu Toma", "Benjamin Wesolowski"], "title": "Average hardness of SIVP for module lattices of fixed rank", "comment": "111 pages, 1 figure", "summary": "The problem of finding short vectors in Euclidean lattices is a central hard problem in complexity theory. The case of module lattices (i.e., lattices which are also modules over a number ring) is of particular interest for cryptography and computational number theory. The hardness of finding short vectors in the asymptotic regime where the rank (as a module) is fixed is supporting the security of quantum-resistant cryptographic standards such as ML-DSA and ML-KEM.\n  In this article we prove the average-case hardness of this problem for uniformly random module lattices (with respect to the natural invariant measure on the space of module lattices of any fixed rank). More specifically, we prove a polynomial-time worst-case to average-case self-reduction for the approximate Shortest Independent Vector Problem ($γ$-SIVP) where the average case is the (discretized) uniform distribution over module lattices, with a polynomially-bounded loss in the approximation factor, assuming the Extended Riemann Hypothesis.\n  This result was previously known only in the rank-1 case (so-called ideal lattices). That proof critically relied on the fact that the space of ideal lattices is a compact group. In higher rank, the space is neither compact nor a group. Our main tool to overcome the resulting challenges is the theory of automorphic forms, which we use to prove a new quantitative rapid equidistribution result for random walks in the space of module lattices."}
{"id": "2511.13691", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.13691", "abs": "https://arxiv.org/abs/2511.13691", "authors": ["Diego Marques", "Pavel Trojovsky"], "title": "Asymptotic error terms in Bonse-type inequalities", "comment": null, "summary": "Let $p_n$ denote the $n$-th prime. In 2000, Panaitopol established the inequality $p_1 \\cdots p_n > p_{n+1}^{n - π(n)}$ for all $n \\geq 2$, where $π(x)$ is the prime counting function. In 2021, Yang and Liao refined this by introducing the exponent $k(n,x) = n - π(n) + \\frac{π(n)}{π(\\log n)} - x \\cdot π(π(n))$, proving the inequality holds for $x = 2$ and $n \\geq 8$. In 2022, Marques and Trojovský extended this to $x = 1.4$ for $n \\geq 21$ and conjectured its validity for $x = 0.1$ when $n \\geq 24,154,953$. This paper confirms the conjecture by analyzing the error term $E_n(x) = \\log(p_1 \\cdots p_n) - k(n,x) \\log p_{n+1}$. Also, we derive the asymptotic expansion to $E_n(x)$ demonstrating that it is positive for all sufficiently large $n$ when $x > -2$. For each $x > -2$, we identify a minimal integer $Ψ(x)$ such that $E_n(x) > 0$ for all $n \\geq Ψ(x)$, precisely determining $Ψ(0.1) = 24,154,953$. Additionally, we establish effective upper bounds for $Ψ(x)$ both unconditionally and under the Riemann Hypothesis, with the conditional bounds showing a significant improvement. Our analysis fully resolves the conjecture and characterizes $Ψ(x)$ as a non-increasing, piecewise constant function, exhibiting discontinuities at a discrete set of threshold points. These results advance the understanding of Bonse-type inequalities and their asymptotic behavior."}
