{"id": "2511.17995", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.17995", "abs": "https://arxiv.org/abs/2511.17995", "authors": ["Vyacheslav Futorny", "Santanu Tantubay"], "title": "Whittaker Modules for W type Cartan Lie superalgebras", "comment": null, "summary": "We consider the category of Whittaker modules for the Lie superalgebra $W_{m,n}$ of vector fields on $\\mathbb{C}^{(m|n)}$. For any $\\mathbf{a}\\in \\mathbb{C}^m$ we show the equivalence between the blocks\n  $Ω_{\\mathbf a}^{\\widetilde{W}_{m,n}}$ of the category of $(AW)_{m,n}$-Whittaker modules with finite-dimensional Whittaker vector spaces and the category of finite-dimensional modules over certain Lie subsuperalgebra $T_{m,n}$ of $(AW)_{m,n}$ (and also of $\\mathfrak{gl}{(m,n)})$. Then we apply the covering technique to study Whittaker $W_{m,n}$-modules and describe simple modules in the category $Ω_{\\mathbf a}^{{W}_{m,n}}$ of such modules with finite-dimensional Whittaker vector spaces and with non-singular ${\\mathbf a}$."}
{"id": "2511.18113", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2511.18113", "abs": "https://arxiv.org/abs/2511.18113", "authors": ["Lin Chen", "Yifei Zhao"], "title": "The quantum torus as an $\\mathbb E_M$-category", "comment": "25 pages", "summary": "Given an oriented $2$-manifold $M$, a locally constant sheaf of lattices $Λ$ over $M$, and a pointed morphism $q : \\textsf B^2Λ\\rightarrow \\textsf B^4\\mathbf C^{\\times}$, we define an $\\mathbb E_M$-category $\\mathrm{Rep}_q(\\check T)$ which we call the \"quantum torus\" at level $q$. We explain why this terminology is deserved and calculate the factorization homology of $\\mathrm{Rep}_q(\\check T)$. When $M$ arises from a global complex curve, we confirm (a version of) a conjecture of Ben-Zvi and Nadler for tori."}
{"id": "2511.18218", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.18218", "abs": "https://arxiv.org/abs/2511.18218", "authors": ["Pavel Etingof", "Andrew Snowden"], "title": "Classification of simple commutative algebras in the Delannoy category", "comment": "24 pages", "summary": "The Delannoy category is an interesting pre-Tannakian category associated to the oligomorphic group $\\mathbb{G}$ of automorphisms of the totally ordered set $(\\mathbf{R}, <)$. By construction, it admits some obvious simple commutative algebras, corresponding to certain transitive $\\mathbb{G}$-sets. We show that these account for all of the simple commutative algebras in the Delannoy category. Previous results of this kind have been limited to interpolation categories; since the Delannoy category cannot be obtained by interpolation, new methods are required."}
{"id": "2511.18372", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.18372", "abs": "https://arxiv.org/abs/2511.18372", "authors": ["Sofiane Bouarroudj", "Quentin Ehret", "Abdenacer Makhlouf", "Nurtas Shyntas"], "title": "The Superization of Hochschild's Lemma and Restricted Lie-Rinehart Superalgebras", "comment": null, "summary": "The main goal of this paper is to introduce the notion of restricted Lie-Rinehart superalgebra over a field of characteristic $p>2$, motivated by a generalization of Hochschild's lemma to the super setting. We extend Schauenburg's proof of Hochschild's lemma to Lie-Rinehart superalgebras and we prove a superized version that serves as a foundation for our construction. Building upon this, we define restricted Lie-Rinehart superalgebras, investigate their representations, construct the semi-direct product with a restricted module, and provide several examples. Finally, we construct the corresponding universal enveloping algebra and show that this algebra satisfies the expected universal property."}
{"id": "2511.17716", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.17716", "abs": "https://arxiv.org/abs/2511.17716", "authors": ["E. Dyachenko"], "title": "Parametric Algorithms for the 5-Modular Analog of ES (Sierpiński): Structure of Solutions, Parameterization, and Constructive Proofs (SERP)", "comment": null, "summary": "We consider the problem of representing the fraction $5/P$ as a sum of three distinct unit fractions $1/A+1/B+1/C$ with $A<B<C$ and $A,B,C\\in\\mathbb{N}$. The case of primes $P\\equiv 1 \\pmod{5}$ is analyzed, where two constructive types of solutions arise: ED1 (exactly one denominator divisible by $P$, namely $C=cP$) and ED2 (exactly two denominators divisible by $P$, namely $B=bP$ and $C=cP$). Parametric constructions and enumeration algorithms are developed, including explicit transitions between ED1 and ED2.\n  A deterministic algorithm is proposed, based on the intersection of a parametric lattice defined by pairs $(α,d')$ with bounded boxes. For each fixed prime $P\\equiv 1 \\pmod{5}$ the algorithm constructively produces a solution. Using analytic methods such as the Bombieri--Vinogradov theorem and the Chebotarev density theorem, it is shown that the density of admissible parameters is high, which yields polylogarithmic search complexity in the average case. A strict complexity guarantee for all primes remains conditional and depends on the finite covering hypothesis.\n  This study extends previous work for coefficient $4$ (the Erdős--Straus conjecture) to coefficient $5$, transferring the same structure of parametrization and constructive solutions. Analytic applications provide averaging tools used for density estimates in parametric boxes."}
{"id": "2511.18392", "categories": ["math.RT", "math.GR", "math.QA"], "pdf": "https://arxiv.org/pdf/2511.18392", "abs": "https://arxiv.org/abs/2511.18392", "authors": ["Teo Banica"], "title": "Invitation to finite groups", "comment": "400 pages", "summary": "This is an introduction to the finite groups, with focus on the groups of permutations and reflections, and more generally, on the finite groups of unitary matrices. We first discuss the basics of group theory, featuring the cyclic, dihedral and symmetric groups, and the structure result for finite abelian groups. Then we study the complex reflection groups, with general theory and examples, classification results, and with a look into braid groups too. We then go into the study of representation theory, and of more advanced aspects, such as Tannakian duality, Brauer theorems and Clebsch-Gordan rules. Finally, we discuss, using representation theory methods, a number of advanced analytic aspects, for the most in relation with questions coming from probability."}
{"id": "2511.17778", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.17778", "abs": "https://arxiv.org/abs/2511.17778", "authors": ["Elchin Hasanalizade", "Hua Lin", "Greg Martin", "Andradis Luna Martínez", "Enrique Treviño"], "title": "Explicit Burgess inequalities for cubefree moduli", "comment": null, "summary": "Burgess proved that for $χ_q$ a primitive Dirichlet character modulo $q$ with $q$ cubefree, $\\Big|\\sum_{M< n\\le M+N}χ_q(n)\\Big| \\ll N^{1-\\frac{1}{r}}q^{\\frac{r+1}{4r^2}+ε}$ for all integers $r\\ge1.$ More recently, explicit versions with prime moduli $q$ were computed by Booker, McGown, Treviño, and Francis, with applications to finding the least $k$-th power residue, and bounding the size of Dirichlet $L$-functions just to name a few. Jain-Sharma, Khale, and Liu proved an explicit estimate for $r=2.$ We improve their explicit constant for $r = 2$ and compute an explicit Burgess bound for cubefree $q$ for $r\\ge 3$."}
{"id": "2511.18395", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.18395", "abs": "https://arxiv.org/abs/2511.18395", "authors": ["Shuo Li", "Lei Shi"], "title": "On (super)symmetrizing forms and Schur elements of cyclotomic Hecke-Clifford algebras", "comment": "82 pages. Comments welcome!", "summary": "In this paper, we introduce Schur elements for supersymmetrizing superalgebras. We show that the cyclotomic Hecke-Clifford algebra $\\mathcal{H}^f_{c}(n)$ is supersymmetric if $f=f^{(\\mathtt{0})}_{\\underline{Q}}$ and, symmetric if $f=f^{(\\mathtt{s})}_{\\underline{Q}}$ and an invertibility condition holds. In the semisimple case, we compute the Schur elements for both $\\mathcal{H}^f_{c}(n)$ and the cyclotomic Sergeev algebra $\\mathcal{h}^g_{c}(n)$. As applications, we define new symmetrizing forms on the Hecke-Clifford algebra $\\mathcal{H}(n)$ and on the cyclotomic quiver Hecke algebras of types $A^{(1)}_{e-1}$ and $C^{(1)}_e$."}
{"id": "2511.17933", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.17933", "abs": "https://arxiv.org/abs/2511.17933", "authors": ["Sushant Kala"], "title": "Lower bound on Néron-Tate height of Abelian varieties", "comment": "Preliminary version, 14 pages, comments are welcome", "summary": "Let $A$ be an abelian variety defined over a number field $K$ and $\\hat{h}$ be the Néron-Tate height on $A(\\overline{K})$ corresponding to a symmetric ample line bundle on $A$. Let $\\mathcal{K}/K$ be an asymptotically positive infinite extension as defined in \\cite{AB-SK} which includes infinite Galois extensions with finite local degree at a non-archimedean place. In this article, we prove that the Néron-Tate height of non-torsion points in $A(\\mathcal{K})$ is bounded below by an absolute constant depending only on $A$, $K$, and $\\mathcal{K}$. As a consequence, we obtain the Bogomolov property for totally $p$-adic points of an abelian variety $A/\\mathbb{Q}$ in the case when $A$ has good reduction at $p$. This is the first instance where such a result has been obtained in the good reduction case; previously, it was known only in the bad reduction case via Gubler's tropical equidistribution theorem. Moreover, our result also implies the finiteness of torsion points in $A(\\mathcal{K})$."}
{"id": "2511.18518", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.18518", "abs": "https://arxiv.org/abs/2511.18518", "authors": ["Simon Riche", "Quan Situ"], "title": "Equivariant Koszul Duality, Modular Category $\\mathcal{O}$, and Periodic Kazhdan--Lusztig Polynomials", "comment": "93 pages", "summary": "Let $G$ be a connected reductive algebraic group over an algebraically closed field of positive characteristic, $\\mathfrak{g}$ be its Lie algebra, and $B$ be a Borel subgroup. We prove a formula for the dimensions of extension groups, in the principal block of the category of strongly $B$-equivariant $\\mathfrak{g}$-modules (also called modular category $\\mathcal{O}$), from a simple object to a costandard object, under the assumption that Lusztig's conjecture holds (which is known in large characteristic). The answer is given by a coefficient of a periodic Kazhdan--Lusztig polynomial associated with the corresponding affine Weyl group. Among other things, the proof uses a torus-equivariant version of the Koszul duality for $\\mathfrak{g}$-modules constructed by the first author."}
{"id": "2511.18034", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.18034", "abs": "https://arxiv.org/abs/2511.18034", "authors": ["Roberto Tauraso"], "title": "A $q$-analogue of the Koecher-Leshchiner generating function of odd zeta values", "comment": null, "summary": "In the 1980s, Koecher and, independently, Leshchiner found an elegant formula for the generating function of odd zeta values. In this short note, we derive a $q$-analogue of this formula, which provides a $q$-version of the accelerated series for $ζ(3)$ used by Apéry in his famous proof of irrationality."}
{"id": "2511.18535", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2511.18535", "abs": "https://arxiv.org/abs/2511.18535", "authors": ["Alexander Moretó", "Noelia Rizo", "Gabriel A. L. Souza"], "title": "Height zero characters and Galois automorphisms", "comment": "18 pages", "summary": "Let $G$ be a finite group and let $p$ be a prime. In this paper, we prove a strengthened version of Brauer's height zero conjecture for the principal $p$-block of $G$ that takes the action of a certain group of Galois automorphisms into account. This answers a conjecture recently proposed by Malle, Moretó, Rizo and Schaeffer Fry. We then use this to obtain a structural result which can be seen as a Galois version of the Itô-Michler theorem."}
{"id": "2511.18101", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.18101", "abs": "https://arxiv.org/abs/2511.18101", "authors": ["Bhargav Bhatt", "Bjorn Poonen"], "title": "Diophantine sets", "comment": "8 pages, comments welcome", "summary": "Diophantine subsets of $\\mathbb{Z}$ play a key role in the negative answer to Hilbert's tenth problem. The definition of diophantine set generalizes in several ways to other commutative rings. We compare these definitions. Along the way, we prove that for every finitely presented scheme $Y$ over a ring $R$, there exists an affine $R$-scheme $X$ with a finitely presented $R$-morphism $X \\to Y$ such that $X(R') \\to Y(R')$ is surjective for every $R$-algebra $R'$."}
{"id": "2511.18587", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.18587", "abs": "https://arxiv.org/abs/2511.18587", "authors": ["Jonathan Brundan", "Alistair Savage"], "title": "Isomeric Heisenberg and Kac-Moody categorification I", "comment": "44 pages", "summary": "We develop a general framework for studying Abelian categories arising in isomeric representation theory, that is, representation theory broadly related to the supergroup Q(n). In this first part, we introduce notions of isomeric Heisenberg categorification and isomeric Kac-Moody categorication, and explain how to pass from the former to the latter. This is analogous to the passage from Heisenberg categorification to Kac-Moody categorification developed in our previous work with Webster."}
{"id": "2511.18206", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.18206", "abs": "https://arxiv.org/abs/2511.18206", "authors": ["Benjamin Bakker", "Ananth N. Shankar", "Jacob Tsimerman"], "title": "Finiteness of function field-valued points on exceptional Shimura varieties", "comment": "16 pages, comments welcome!", "summary": "Let $C/k$ be a smooth curve over a finite field of characteristic $p>0$. We prove that there are finitely many principally polarized abelian schemes of given dimension $g$ over $C$ up to $p$-power isogeny. For curves over $\\overline{k}$, we prove that the moduli space of such abelian schemes is finite type up to $p$-power isogeny.\n  Moreover, we generalize this result to arbitrary (not necessarily abelian type) Shimura varieties $S$ and sufficiently large primes $p$ in terms of $S$: The space of generically ordinary morphisms $C\\to S_{k}$ (resp. $C\\to S_{\\overline{k}})$ is finite (resp. finite type) up to $p$-Hecke orbits."}
{"id": "2511.19051", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.19051", "abs": "https://arxiv.org/abs/2511.19051", "authors": ["Xiaogang Li", "Changchang Xi"], "title": "Stable equivalences and homological dimensions", "comment": "29 pages. This is a revision of the part on stable equivalences in arXiv:2312.08794. New results are added. We stress that every finite-dimensional algebra over a field R is isomorphic to the centralizer of two matrices in a full matrix algebra over the field R. Thus the class of all centralizers of one matrix is an impotent part of finite-dimensonal algebras over fields", "summary": "As is known, every finite-dimensional algebra over a field is isomorphic to the centralizer algebra of two matrices. So it is fundamental to study first the centralizer algebra of a single matrix, called a centralizer matrix algebra. In this article, stable equivalences between centralizer matrix algebras over arbitrary fields are completely characterized in terms of a new equivalence relation on matrices. Moreover, stable equivalences of centralizer matrix algebras over perfect fields induce stable equivalences of Morita type, thus preserve dominant, finitistic and global dimensions. Our methods also show that algebras stably equivalent to a centralizer matrix algebra over a field have the same number of non-isomorphic, non-projective simple modules. Thus the Auslander--Reiten conjecture on stable equivalences holds true for centralizer matrix algebras."}
{"id": "2511.18275", "categories": ["math.NT", "math-ph", "math.PR"], "pdf": "https://arxiv.org/pdf/2511.18275", "abs": "https://arxiv.org/abs/2511.18275", "authors": ["Yochay Jerby"], "title": "Variations of the Hardy Z-Function and the Montgomery Pair Correlation Conjecture", "comment": null, "summary": "In 1973 Montgomery formulated the pair correlation conjecture, predicting that the local spacing statistics of the nontrivial zeros of the Riemann zeta function coincide with those of eigenvalues of large Hermitian matrices from the Gaussian Unitary Ensemble (GUE). The zeta function, however, is a fixed deterministic object, and the mechanism by which its zeros reproduce random matrix statistics has remained unclear. In this paper, assuming the Riemann Hypothesis, we prove Montgomery's pair correlation conjecture for the zeros of Hardy's $Z$-function. Building on earlier works, we use a finite-dimensional variational space of sections $Z_N(t;a)$ that approximate $Z(t)$ on each window $[2N,2N+2]$. Inside this space we define the real hall $\\mathcal{RH}_N(\\mathbb{R})$, consisting of those sections whose zeros in the corresponding critical rectangle are real, simple, and remain so along any homotopy from the core section. This real hall plays the role of a random matrix ensemble. Equipping it with a probability measure with smooth, strictly positive density on the coefficient space, we construct a Skorokhod-type stochastic differential equation with reflection at the discriminant boundary. We show that the induced dynamics of the unfolded zeros are, in the bulk, equivalent in law to Dyson Brownian motion with $β=2$, and by invoking modern universality results for Dyson Brownian motion and log-gases we obtain that, for any such measure, the ensemble-averaged local pair-correlation converges to the GUE sine-kernel law. Finally, using Selberg's probabilistic theory of the argument $S(t)$, we prove that the pair-correlation observables of the canonical approximants $Z_N(t;1)$ over disjoint windows behave asymptotically like decorrelated samples drawn from this GUE-distributed ensemble, and we upgrade the averaged GUE law to a deterministic pair-correlation law for the zeros of $Z(t)$."}
{"id": "2511.19223", "categories": ["math.RT", "math.CO", "math.CT", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.19223", "abs": "https://arxiv.org/abs/2511.19223", "authors": ["Federico Campanini", "Francesca Fedele", "Emine Yıldırım"], "title": "Lattices of pretorsion classes", "comment": "39 pages", "summary": "Since their introduction, torsion theories have played a key role in the study of abelian and pointed categories. In representation theory, torsion theories and lattices of torsion classes of mod$ A$, for $A$ a finite-dimensional algebra, have been widely studied. The more recent definition of pretorsion theories, that can be given for any category, has expanded the theory, giving many more instances of ``non-pointed torsion theories'' in unexpected settings. In this work, we introduce and study the lattice $\\mathcal{L}_t(A)$ of pretorsion classes of mod$ A$. These lattices are in close connection with the lattices tors$ A$ of torsion classes of mod$ A$. We fully describe the completely join-irreducible elements of $\\mathcal{L}_t(A)$. Moreover, we characterise and give a full classification of when $\\mathcal{L}_t(A)$ is distributive and further describe when it can be identified with the \\emph{distributive closure} of tors$ A$. Finally, we show how the lattices of pretorsion classes, together with their duals, can be used to build pretorsion theories in mod$ A$."}
{"id": "2511.18629", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.18629", "abs": "https://arxiv.org/abs/2511.18629", "authors": ["Kun Liu"], "title": "On the non-generic part of cohomology of compact unitary Shimura varieties of signature $(1,n)$", "comment": null, "summary": "In this short note, we prove a result about the non-generic part of the cohomology of certain compact unitary Shimura varieties for good $p$, partially extending a result of Boyer in the case of Harris--Taylor unitary Shimura varieties. Our arguments are different to those of Boyer -- we work in the context of the work of Fargues--Scholze, using ideas introduced by Koshikawa to study the generic part of cohomology."}
{"id": "2511.19224", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.19224", "abs": "https://arxiv.org/abs/2511.19224", "authors": ["Erik P. van den Ban"], "title": "Maass-Selberg relations for Whittaker functions on a real reductive group", "comment": "83 pages", "summary": "We give a complete proof of the Maass-Selberg relations for Whittaker integrals on a real reductive group. These relations were asserted In unpublished work of Harish-Chandra, and proven in the basic setting of maximal parabolic parabolic subgroups. Our proof is a reduction to the mentioned basic setting. It makes use of the action of standard intertwining operators on Whittaker distribution vectors in the generalized principal series of representations. The Maass-Selberg relations imply regularity of normalized Whittaker integrals. This is crucial for decent behavior of Fourier and wave packet transforms on the level of spherical Schwartz spaces."}
{"id": "2511.18809", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.18809", "abs": "https://arxiv.org/abs/2511.18809", "authors": ["Yezheng Gao"], "title": "Comparison between formal slopes and p-adic slopes", "comment": null, "summary": "In this paper, we establish several inequalities comparing formal slopes with p-adic slopes of solvable differential modules over the punctured open unit disc. Our approach is based on a delicate analysis of Newton polygons and the log-convexity of generic radius functions."}
{"id": "2511.19303", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.19303", "abs": "https://arxiv.org/abs/2511.19303", "authors": ["Wing Hong Leung", "Matthew P. Young"], "title": "The shifted convolution problem for Fourier coefficients of Siegel modular forms of degree $2$", "comment": "35 pages, 2 figures", "summary": "We provide a power-saving bound for certain smoothed shifted convolution sums for Fourier coefficients of Siegel cusp forms. This result is the first nontrivial estimate for a shifted convolution sum with two cusp forms on a group of higher rank than $\\GL_2$. Our approach is based on a novel automorphic reinterpretation of the delta method of Duke, Friedlander, and Iwaniec. The method reduces the problem to the estimation of Fourier coefficients of Siegel Poincare series, which is ultimately based on the Weil bound."}
