{"id": "2509.05402", "categories": ["math.NT", "11B65, 11B68"], "pdf": "https://arxiv.org/pdf/2509.05402", "abs": "https://arxiv.org/abs/2509.05402", "authors": ["Bernd C. Kellner"], "title": "Wilson's theorem modulo higher prime powers II: Bernoulli numbers and polynomials", "comment": "16 pages, 1 table, 1 figure", "summary": "By recent work of the author, Wilson's theorem as well as the Wilson quotient\ncan be described by supercongruences of power sums of Fermat quotients modulo\nevery higher prime power. We translate these congruences into congruences of\npower sums and Bernoulli numbers. This together provides relatively short\nproofs of the congruences compared to former approaches. As an application, we\ncompute, e.g., the Wilson quotient up to $\\pmod{p^4}$ and equivalently the\nfactorial $(p-1)!$ up to $\\pmod{p^5}$, which can be extended to any higher\nprime power with some effort. As a by-product, we determine some power sums of\nthe Fermat quotients up to $\\pmod{p^4}$."}
{"id": "2509.05473", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.05473", "abs": "https://arxiv.org/abs/2509.05473", "authors": ["João Campos-Vargas"], "title": "Extreme values of class group $L$-functions", "comment": null, "summary": "We give a lower bound for the maximum value of class group $L$-functions\nattached to $\\mathbb{Q}(\\sqrt{-D})$ at the central point and show that this\nvalue is on average at least $$\\exp\\Bigg(\\delta\\sqrt{\\frac{\\log D \\log \\log\n\\log D}{\\log \\log D}} \\Bigg)$$ for any $\\delta < \\frac{1}{4}$."}
{"id": "2509.05526", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2509.05526", "abs": "https://arxiv.org/abs/2509.05526", "authors": ["Zeyu Wang"], "title": "Special Cycle on Shtukas and Categorical Trace", "comment": "61 pages, comments welcome!", "summary": "In this article, we relate the fake special cycle classes\n$z_{\\mathbb{L}_{\\sigma},r}$ attached to a Hecke eigensheaf\n$\\mathbb{L}_{\\sigma}\\in\\mathrm{Shv}_{\\mathrm{Nilp}}(\\mathrm{Bun}_G)$ introduced\nin the author's previous work to the isotypic part of special cycles on\nShtukas. As an application, we relate the self-intersection number of the\nisotypic part of special cycles arising from Rankin--Selberg period to higher\nderivatives of Rankin--Selberg $L$-functions."}
{"id": "2509.05687", "categories": ["math.NT", "11J83, 11K60, 11J13, 28A80, 28A78, 11K55, 11J71, 42B10, 43A46"], "pdf": "https://arxiv.org/pdf/2509.05687", "abs": "https://arxiv.org/abs/2509.05687", "authors": ["Victor Beresnevich", "Sanju Velani"], "title": "The dimension of well approximable numbers", "comment": "21 pages", "summary": "In this survey article, we explore a central theme in Diophantine\napproximation inspired by a celebrated result of Besicovitch on the Hausdorff\ndimension of well approximable real numbers. We outline some of the key\ndevelopments stemming from Besicovitch's result, with a focus on the Mass\nTransference Principle, Ubiquity and Diophantine approximation on manifolds and\nfractals. We highlight the subtle yet profound connections between number\ntheory and fractal geometry, and discuss several open problems at their\nintersection."}
{"id": "2509.05312", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2509.05312", "abs": "https://arxiv.org/abs/2509.05312", "authors": ["Cui Xinghua", "Wang Haoyang", "Peng Zhifeng"], "title": "The trace formula of GL(3)", "comment": null, "summary": "Trace formula is an important method to study the Langlands program. In this\npaper, we will give the explicit coarse trace formula of $\\GL(3)$. In general\ncase, Arthur applies the truncation operator on the two sides of trace formula\nsuch that they are convergent. In our case, we will prove that the divergent\nterms of the two sides of the trace formula of $\\GL(3)$ are equal. We also\nobtain the explicit formula for ramified orbits of the geometric side of\n$\\GL(3)$, and show it can be expressed as a limit of distributions of the\nunramified orbits."}
{"id": "2509.05761", "categories": ["math.NT", "11B73, 11B83"], "pdf": "https://arxiv.org/pdf/2509.05761", "abs": "https://arxiv.org/abs/2509.05761", "authors": ["Taekyun Kim", "Dae San Kim"], "title": "Spivey-type recurrence relation for fully degenerate Bell polynomials", "comment": "9 pages", "summary": "Spivey's combinatorial method revealed an important identity for Bell\nnumbers, involving Stirling numbers of the second kind. This paper extends his\nwork by deriving Spivey-type recurrence relations for fully degenerate Bell\npolynomials and degenerate Fubini polynomials. Our derivation uses degenerate\nStirling numbers of the second kind and two-variable degenerate Fubini\npolynomials of order a."}
{"id": "2509.05313", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2509.05313", "abs": "https://arxiv.org/abs/2509.05313", "authors": ["Haoyang Wang", "Xinghua Cui", "Zhifeng Peng"], "title": "The coarse trace formula of GL(4)", "comment": "69 pages", "summary": "Trace formula is an important method to study the Langlands program. Arthur\nobtains the existence of stable trace formula for connected reductive group. In\nthis paper, we will give the explicit coarse trace formula of GL(4). In general\ncase, Arthur applies the truncation operator on the two sides of trace formula,\nwhich is convergent. In our case, we will prove that the divergent terms of the\ntwo sides of the trace formula of GL(4)$ are equal. We also obtain the explicit\nformula for ramified orbits of the geometric side of trace formula of GL(4)."}
{"id": "2509.05810", "categories": ["math.NT", "11M41 (Primary) 11M26, 11F11 (Secondary)"], "pdf": "https://arxiv.org/pdf/2509.05810", "abs": "https://arxiv.org/abs/2509.05810", "authors": ["Lawrence Dillon", "Xiaoyao Huang", "Say-Yeon Kwon", "Meiling Laurence", "Steven J. Miller", "Vishal Muthuvel", "Luke Rowen", "Pramana Saldin", "Steven Zanetti"], "title": "Centered Moments of Weighted One-Level Densities of $GL(2)$ $L$-Functions", "comment": "33 pages", "summary": "Katz and Sarnak conjectured that the behavior of zeros near the central point\nof any family of $L$-functions is well-modeled by the behavior of eigenvalues\nnear $1$ of some classical compact group (either the symplectic, unitary, or\neven, odd, or full orthogonal group). In 2018, Knightly and Reno proved that\nthe symmetry group can vary depending on how the $L$-functions in the family\nare weighted. They observed both orthogonal and symplectic symmetry in the\none-level densities of families of cuspidal newform $L$-functions for different\nchoices of weights. We observe the same dependence of symmetry on weights in\nthe $n^{\\text{th}}$ centered moments of these one-level densities, for smooth\ntest functions whose Fourier transforms are supported in $\\left(-\\frac{1}{2n},\n\\frac{1}{2n}\\right)$. To treat the new terms that emerge in our $n$-level\ncalculations when $n>1$, i.e., the cross terms that emerge from $n$-fold\nproducts of primes rather than individual primes, we generalize Knightly and\nReno's weighted trace formula from primes to arbitrary positive integers. We\nthen perform a delicate analysis of these cross terms to distinguish their\ncontributions to the main and error terms of the $n^{\\text{th}}$ centered\nmoments. The final novelty here is an elementary combinatorial trick that we\nuse to rewrite the main number theoretic terms arising from our analysis,\nfacilitating comparisons with random matrix theory."}
{"id": "2509.05353", "categories": ["math.RT", "math.FA", "20F18, 22E25, 42A45, 42B15, 43A22"], "pdf": "https://arxiv.org/pdf/2509.05353", "abs": "https://arxiv.org/abs/2509.05353", "authors": ["O. A. Ariyo", "M. E. Egwe"], "title": "Quaternionic Spherical Fourier Multipliers for Gelfand Pairs", "comment": null, "summary": "Let $\\mathbb{H}_q$ denote the quaternionic Heisenberg group with\n$\\mathbb{R}^4\\times\\mathbb{R}^3$ stratification and $K$ a compact subgroup of\nAutomorphism. We construct the spherical Fourier multiplier related to a\nGelfand Pairs on the Quaternionic Heisenberg group $\\mathbb{H}_q$ via the\nmotion group $G=K\\ltimes \\mathbb{H}_q$ of $\\mathbb{H}_q$, where $K\\ltimes\n\\mathbb{H}_q$ is the semidirect product of $\\mathbb{H}_q$ and its compact\nsubgroup of automorphism $K\\in Aut(\\mathbb{H}_q)$."}
{"id": "2509.05968", "categories": ["math.NT", "11F12, 11F66, 11F72"], "pdf": "https://arxiv.org/pdf/2509.05968", "abs": "https://arxiv.org/abs/2509.05968", "authors": ["Zhao Xu"], "title": "Uniform subconvexity bounds for $GL(2)\\times GL(2)$ $L$-functions in the spectral aspect", "comment": "comments welcome", "summary": "In this paper, we study the second moment for $GL(2)\\times GL(2)$\n$L$-functions $L(\\frac{1}{2},f\\times g)$, which leads to a uniform subconvexity\nbound in the spectral aspect. In particular, if either $f$ or $g$ is a dihedral\nMaass newform, or if one of them has level $1$, we obtain a Burgess-type bound\nthat is uniform in both $t_f$ and $t_g$, where $t_f$, $t_g$ denote the spectral\nparameters of $f$, $g$. As an application, we also establish a shrinking result\nfor QUE in the case of dihedral Maass newforms."}
{"id": "2509.05770", "categories": ["math.RT", "math.GR", "20B15, 20H30"], "pdf": "https://arxiv.org/pdf/2509.05770", "abs": "https://arxiv.org/abs/2509.05770", "authors": ["Alexandre Zalesski"], "title": "Linear groups of alternating type containing non-scalar elements with all but one eigenvalues of multiplicity 1", "comment": null, "summary": "We determine the irreducible representations of alternating and symmetric\ngroups and their universal central extensions that contain a non-scalar element\nwith all but one eigenvalues of multiplicity 1. The ground field is\nalgebraically closed of arbitrary characteristic."}
{"id": "2509.05984", "categories": ["math.NT", "11B39, 11D61, 11J86"], "pdf": "https://arxiv.org/pdf/2509.05984", "abs": "https://arxiv.org/abs/2509.05984", "authors": ["Mahadi Ddamulira"], "title": "Tribonacci-Lucas numbers that are palindromic concatenations of two distinct repdigits", "comment": "12 pages", "summary": "The Tribonacci-Lucas sequence $\\{S_n\\}_{n\\ge 0}$ is defined by the linear\nrecurrence relation $S_{n+3} = S_{n+2} + S_{n+1} + S_n$, for $ n\\ge 0 $, with\nthe initial conditions $S_0 =S_2= 3$ and $S_1 = 1$. A palindromic number is a\nnumber that remains the same when its digits are reversed. This paper uses\nBaker's theory for nozero lower bounds for linear forms in logarithms of\nalgebraic numbers, and reduction methods involving the theory of continued\nfraction to determine all Tribonacci-Lucas numbers that are palindromic\nconcatenations of two distinct repdigits."}
{"id": "2509.05805", "categories": ["math.RT", "20C20, 20C34"], "pdf": "https://arxiv.org/pdf/2509.05805", "abs": "https://arxiv.org/abs/2509.05805", "authors": ["Jürgen Müller"], "title": "Is the projective cover of the trivial module in characteristic $11$ for the sporadic simple Janko group $J_4$ a permutation module?", "comment": "Dedicated to the memory of Richard Parker. 18 pages", "summary": "We determine the ordinary character of the projective cover of the trivial\nmodule in characteristic $11$ for the sporadic simple Janko group $J_4$, and\nanswer the question posed in the title."}
{"id": "2509.06032", "categories": ["math.NT", "Primary 11P82, Secondary 11N37"], "pdf": "https://arxiv.org/pdf/2509.06032", "abs": "https://arxiv.org/abs/2509.06032", "authors": ["Meng-Juan Tian", "Nian Hong Zhou"], "title": "Restricted divisor functions and half Appell sums in higher-level", "comment": "10 pages", "summary": "We examine the value distributions of coefficients in certain $q$-series\nrelated to half Appell sums in higher-level and the first moment of the\nGarvan's $k$-rank of partitions. We prove that these coefficients equal certain\nrestricted divisor functions and can take any nonnegative integer value\ninfinitely many times. As applications, we confirm a conjecture of Xiong on the\ncoefficients of a half Lerch sum and a conjecture of Garvan and\nJennings-Shaffer on the nonnegativity of spt-crank-type partitions."}
{"id": "2509.05906", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2509.05906", "abs": "https://arxiv.org/abs/2509.05906", "authors": ["Houjun Zhang"], "title": "Classification of silted algebras for two quivers of Dynkin type $\\mathbb{D}_{n}$", "comment": "40 pages", "summary": "Let $Q$ be the Dynkin quiver of type $\\mathbb{D}_{n}$ with linear orientation\nand let $Q'$ be the quiver formed by reversing the arrow at the unique source\nin $Q$. In this paper, we present a complete classification of both silted\nalgebras and strictly shod algebras associated with these two quivers. Based on\nthe classification, we derive formulas for counting the number of silted\nalgebras and strictly shod algebras.\n  Furthermore, we establish that all strictly shod algebras corresponding to\n$Q$ and $Q'$ are string algebras. As an application, we provide a way to\nconstruct examples such that the realization functor which is induced from the\n$t$-structure does not extend to a derived equivalence."}
{"id": "2509.06123", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.06123", "abs": "https://arxiv.org/abs/2509.06123", "authors": ["Bernhard Heim", "Markus Neuhauser"], "title": "On the Non-vanishing of the D'Arcais Polynomials", "comment": null, "summary": "In this paper we invest in the non-vanishing of the Fourier coefficients of\npowers of the Dedekind eta function. This is reflected in non-vanishing\nproperties of the D'Arcais polynomials. We generalize and improve results of\nHeim--Luca--Neuhauser and \\.{Z}mija. We apply methods from algebraic number\ntheory."}
{"id": "2509.06106", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2509.06106", "abs": "https://arxiv.org/abs/2509.06106", "authors": ["Frank Filbir", "Davide Nobile", "Marco Rauscher"], "title": "Fourier Inversion on the Group of Signatures", "comment": null, "summary": "The main objective of this work is to develop a framework for Fourier\nanalysis on the group of signatures, $G_N(\\mathbb{R}^d)$. Employing Kirillov's\norbit method, we define the Fourier transform on this group via irreducible\nunitary representations. Our main contribution is the derivation of necessary\nand sufficient conditions for identifying coadjoint orbits in general position\nof $G_N(\\mathbb{R}^d)$. This enables the computation of the set of\n\\textit{jump-indices} of generic orbits, crucial for the Fourier inversion\ntheorem. We also obtain an explicit construction of a polarization for any\nlinear functional in general position, which allows a concrete description of\nthe Fourier transform of functions on $G_N(\\mathbb{R}^d)$. This framework\nyields an explicit Fourier inversion formula for the group of signatures in\narbitrary dimension.\n  Furthermore, we show that the theoretical framework developed here extends\nnaturally to a broader class of graded Lie groups, including the group\ngenerated by the truncated tensor algebra $T_0^N(\\mathbb{R}^d)$."}
{"id": "2509.06128", "categories": ["math.NT", "math.CA"], "pdf": "https://arxiv.org/pdf/2509.06128", "abs": "https://arxiv.org/abs/2509.06128", "authors": ["Roei Raveh"], "title": "Zeros of theta functions associated with even unimodular lattices", "comment": "16 pages, comments are welcome", "summary": "We study the zeros of the theta functions of the lattices $\\Gamma_{8k}$, a\nfamily of even unimodular lattices generalizing the $\\mathsf{E}_{8}$ lattice.\nWe show that the zeros of $\\Theta_{\\Gamma_{8k}}$ all lie on the line $\\Re z\n=\\frac{1}{2}$ in the fundamental domain and compute their height and limit\ndistribution."}
{"id": "2509.06226", "categories": ["math.RT", "math-ph", "math.KT", "math.MP"], "pdf": "https://arxiv.org/pdf/2509.06226", "abs": "https://arxiv.org/abs/2509.06226", "authors": ["Ilya Dumanski", "Vasily Krylov"], "title": "K-theoretic Hikita conjecture for quiver gauge theories", "comment": "56 pages", "summary": "We study variants of Hikita conjecture for Nakajima quiver varieties and\ncorresponding Coulomb branches. First, we derive the equivariant version of the\nconjecture from the non-equivariant one for a set of gauge theories. Second, we\nsuggest a variant of the conjecture, with K-theoretic Coulomb branches\ninvolved. We show that this version follows from the usual (homological) one\nfor a set of theories. We apply this result to prove the conjecture in finite\nADE types. In the course of the proof, we show that appropriate completions of\nK-theoretic and homological (quantized) Coulomb branches are isomorphic."}
{"id": "2509.06152", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.06152", "abs": "https://arxiv.org/abs/2509.06152", "authors": ["Mohammad H. Hamdar"], "title": "Hecke $L$-functions Away From The Central Line", "comment": "39 pages", "summary": "We compute the first moment of cubic Hecke $L$-functions over\n$\\mathbb{Q}(\\sqrt{-3})$ evaluated at any $s$ inside the critical strip. The\nfirst moment for $s<\\frac{1}{2}$ is particularly interesting, and we show there\nis a phase transition at $s=\\frac{1}{3}$. This extends the analogue result of\nDavid-Meisner for the first moment over function fields. As in their work, the\ncomputation of the moment at $s=\\frac{1}{3}$ relies on a cancellation between\ntwo terms which are a priori not related: a main term of the principal sum\nwhich comes from cubes, and the contribution from infinitely many residues of\nDirichlet series of cubic Gauss sums to the dual sum. The cancellation also\nimproves the error term and exhibits a secondary term for all $s$. In\nparticular, at $s=\\frac{1}{2}$, we prove the existence of a secondary term of\nsize $Q^{5/6}$, where the size of the family is $Q$.\n  We conjecture that a similar behaviour would hold for higher order Hecke\n$L$-functions attached to $\\ell^{th}$ order residue symbols, refining a\nfunction field conjecture of David and Meisner.\n  The proof follows the steps of writing $L(s,\\chi)$ as two finite sums with\nthe approximate functional equation. Two main ingredients are then exploited:\nthe bound on the second moment of $L(1/2+it,\\chi)$ that follows from\nHeath-Brown's cubic large sieve, and the deep work of Kubota and Patterson\nwhich connects the Dirichlet series of cubic Gauss sums to metaplectic forms,\nand gives a formula for its residues in terms of the Fourier coefficients of\nmetaplectic theta functions. This is only known for cubic Gauss sums, and not\nfor general Gauss sums of order $\\ell\\geq 4$."}
{"id": "2509.06369", "categories": ["math.RT", "Primary: 16E35, 18G80. Secondary: 20C20"], "pdf": "https://arxiv.org/pdf/2509.06369", "abs": "https://arxiv.org/abs/2509.06369", "authors": ["Gustavo Jasso", "Henning Krause", "Sibylle Schroll"], "title": "Rickard's Derived Morita Theory: Review and Outlook", "comment": "25 pages. Contribution to the 100th anniversary issue of the J. Lond.\n  Math. Soc", "summary": "We survey the main results in Jeremy Rickard's seminal papers `Morita theory\nfor derived categories' and `Derived equivalences and derived functors'. These\npapers catalysed the later development of the Morita theory of (enhanced)\ncompactly generated triangulated categories by Keller in the algebraic setting\nand by Schwede and Shipley in the topological setting. We also discuss the role\nof Rickard's notion of splendid equivalence in the context of Brou\\'e's abelian\ndefect group conjecture, and indicate an alternative proof of parts of\nRickard's Derived Morita Theorem that leverages the notion of completion of a\ntriangulated category."}
{"id": "2509.06175", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.06175", "abs": "https://arxiv.org/abs/2509.06175", "authors": ["Congling Qiu"], "title": "Hyperelliptic Shimura curves and $L$-functions of central vanishing order at least 3", "comment": null, "summary": "We use hyperelliptic Shimura curves to find triple product $L$-functions of\nHilbert newforms with central vanishing orders proved to be at least 3."}
{"id": "2509.06424", "categories": ["math.RT", "math.CO", "05A16, 05E10, 20G05"], "pdf": "https://arxiv.org/pdf/2509.06424", "abs": "https://arxiv.org/abs/2509.06424", "authors": ["Tim Kuppel"], "title": "Asymptotics of Plethysm", "comment": "Comments welcome! Submitted to Math. Zeitschrift", "summary": "We study multiplicities $a^{d\\lambda}_{\\mu,(dk)}$ of highest weight\nrepresentations $\\mathbb S_{d\\lambda}(\\mathbb C^n)$, $\\lambda\\vdash pk$, of\nlength at most $p$, in $\\mathbb{S}_{\\mu}(S^{dk}(\\mathbb C^n))$, $\\mu\\vdash p$,\nso called plethysm coefficients, as $d$ tends to $\\infty$. These are given by\nquasi-polynomials, which in the case of $S^p(S^{dk}(\\mathbb C^n))$ can\nexplicitly be computed by Pieri's rule. We show that for all but a finite,\nexplicit list of $\\lambda$'s the leading term is in fact constant and that $$\n  a^{d\\lambda}_{\\mu,(dk)}\\sim \\frac{\\dim V_\\mu}{p!}c^{d\\lambda}_{p,dk} $$ as\n$d\\to\\infty$. In particular, we answer a conjecture of Kahle and Micha\\l ek,\ngoing back to Howe."}
{"id": "2509.06248", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.06248", "abs": "https://arxiv.org/abs/2509.06248", "authors": ["Hirotaka Kobayashi"], "title": "On Hardy's $Z$-function and its derivatives associated with Selberg class", "comment": "13 pages", "summary": "Hardy's $Z$-function $Z(t)$ is a real-valued function of the real valuable\n$t$, and its zeros exactly correspond to those of the Riemann zeta-function on\nthe critical line. In 2012, K.~Matsuoka showed that for any non-negative\ninteger $k$, there exists a $T=T(k)>0$ such that $Z^{(k+1)}(t)$ has exactly one\nzero between consecutive zeros of $Z^{(k)}(t)$ for $t\\ge T$ under the Riemann\nHypothesis. In this article, we extend Matsuoka's theorem to some $L$-functions\nin Selberg class."}
{"id": "2509.06486", "categories": ["math.RT", "math.CO", "math.RA", "13F60, 05E10, 20F55"], "pdf": "https://arxiv.org/pdf/2509.06486", "abs": "https://arxiv.org/abs/2509.06486", "authors": ["Ryota Akagi", "Zhichao Chen"], "title": "Real $C$-, $G$-structures and sign-coherence of cluster algebras", "comment": "68 pages, 13 figures. All comments are welcome!", "summary": "We generalize the theory of integer $C$-, $G$-matrices in cluster algebras to\nthe real case. By a skew-symmetrizing method, we can reduce the problem of\nskew-symmetrizable patterns to the one of skew-symmetric patterns. In this\nsense, we extend the sign-coherence of integer $C$-, $G$-matrices proved by\nGross-Hacking-Keel-Kontsevich to a more general real class called of\nquasi-integer type. Furthermore, we give a complete classification of this type\nby a combinatorial method of real weighted quivers. However, the sign-coherence\nof real $C$-, $G$-matrices does not always hold in general. For this purpose,\nwe classify all the rank $2$ case and the finite type case via the Coxeter\ndiagrams. We also give two conjectures about the real exchange matrices and\n$C$-, $G$-matrices. Under these conjectures, the dual mutation, $G$-fan\nstructure and synchronicity property hold. As an application, the isomorphism\nof several kinds of exchange graphs is studied."}
{"id": "2509.06390", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.06390", "abs": "https://arxiv.org/abs/2509.06390", "authors": ["Samprit Ghosh"], "title": "Moments of Higher derivatives of the logarithmic derivative of Dirichlet $L$-functions", "comment": null, "summary": "Let $\\chi$ be a non-principal Dirichlet character and $L(s, \\chi)$ be the\nassociated Dirichlet $L$-function. Let us use $\\mathcal{L}(s,\\chi)$ to denote\nits logarithmic derivative $L'(s, \\chi)/L(s, \\chi)$. We first prove some\narithmetic formulas for higher derivatives $\\mathcal{L}^{(r)}(1,\\chi)$. We then\ninvestigate their moments. We study the average of\n$P^{(a,b)}(\\mathcal{L}^{(r)}(1,\\chi))$ as $\\chi$ runs over all non-principal\nDirichlet characters with a given large prime conductor $m$, where\n$P^{(a,b)}(z) = z^a \\overline{z}^b$."}
{"id": "2509.06944", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2509.06944", "abs": "https://arxiv.org/abs/2509.06944", "authors": ["Konstanze Rietsch"], "title": "Tropical Toeplitz matrices and parametrisations", "comment": null, "summary": "The set of infinite upper-triangular totally positive Toeplitz matrices has a\nclassical parametrisation proved by Edrei et al and originally conjectured by\nSchoenberg, that involves pairs of sequences of positive real parameters. These\nmatrices (and their parameters) are central for understanding characters of the\ninfinite symmetric group by work of Thoma. On the other hand there is a very\ndifferent parametrisation theorem that applies to the finite analogue of this\nset. These finite Toeplitz matrices and their parameters relate to quantum\ncohomology of flag varieties and mirror symmetry. In this paper we replace the\npositive reals by a semifield with valuation to then construct tropical\nanalogues for both parametrisation theorems. In the finite case we tropicalise\nusing positive generalised Puiseaux series. This builds on work of Judd and\nL\\\"udenbach. In the infinite case we use a new valued semifield of continuous\nfunctions. We arrive at different natural infinite analogues of totally\npositive Toeplitz matrices, depending on a choice of topology on our valued\nsemifield. We then prove an asymptotic result relating the tropical parameters\nfrom the finite case to the tropicalisations of the Schoenberg parameters.\nMoreover, we show that our finite type tropical parametrisation map is given by\nLusztig's weight map from the theory of canonical bases. This results in a\nsurprising connection between the classical Edrei theorem with its Schoenberg\nparameters and Lusztig's canonical basis parametrisation."}
{"id": "2509.06423", "categories": ["math.NT", "11G07, 11G15"], "pdf": "https://arxiv.org/pdf/2509.06423", "abs": "https://arxiv.org/abs/2509.06423", "authors": ["Florian Breuer"], "title": "Divisibility of the coefficients of modular polynomials", "comment": "8 pages", "summary": "Let $N>1$ and let $\\Phi_N(X,Y)\\in\\mathbb{Z}[X,Y]$ be the modular polynomial\nwhich vanishes precisely at pairs of $j$-invariants of elliptic curves linked\nby a cyclic isogeny of degree $N$. In this note we study the divisibility of\nthe coefficients $\\Phi_N(X+J, Y+J)$ for certain algebraic numbers $J$, in\nparticular $J=0$ and $J=1728$. It turns out that these coefficients are highly\ndivisible by small primes at which $J$ is supersingular."}
{"id": "2509.05526", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2509.05526", "abs": "https://arxiv.org/abs/2509.05526", "authors": ["Zeyu Wang"], "title": "Special Cycle on Shtukas and Categorical Trace", "comment": "61 pages, comments welcome!", "summary": "In this article, we relate the fake special cycle classes\n$z_{\\mathbb{L}_{\\sigma},r}$ attached to a Hecke eigensheaf\n$\\mathbb{L}_{\\sigma}\\in\\mathrm{Shv}_{\\mathrm{Nilp}}(\\mathrm{Bun}_G)$ introduced\nin the author's previous work to the isotypic part of special cycles on\nShtukas. As an application, we relate the self-intersection number of the\nisotypic part of special cycles arising from Rankin--Selberg period to higher\nderivatives of Rankin--Selberg $L$-functions."}
{"id": "2509.06522", "categories": ["math.NT", "math.CO", "11D09, 11R11"], "pdf": "https://arxiv.org/pdf/2509.06522", "abs": "https://arxiv.org/abs/2509.06522", "authors": ["Kalyan Chakraborty", "Shubham Gupta", "Krishnarjun Krishnamoorthy"], "title": "Diophantine tuples and Integral Ideals of $\\mathbb{Q}(\\sqrt{d})$", "comment": "7 pages. Comments and suggestions welcome", "summary": "Suppose $n$ is the fundamental discriminant associated with a quadratic\nextension of $\\mathbb{Q}$. We show that for every Diophantine $m$-tuple $\n\\{t_1, t_2, \\ldots, t_m\\} $ with the property $ D(n) $, there exists integral\nideals $ \\mathfrak{t}_1, \\mathfrak{t}_2, \\ldots, \\mathfrak{t}_m $ of $\n\\mathbb{Q}(\\sqrt{n}) $ and $c\\in \\{1,2\\}$ such that $ t_i=\nc\\mathcal{N}(\\mathfrak{t}_i) $ for $ i=1,2, \\ldots, m $. Here, $\n\\mathcal{N}(\\cdot) $ denotes the norm map from $\\mathbb{Q}(\\sqrt{n})$ to\n$\\mathbb{Q}$. Moreover, we explicitly construct the above ideals for\nDiophantine pairs $\\{a_1, a_2\\}$ whenever $\\gcd(a_1, a_2) = 1$."}
{"id": "2509.06633", "categories": ["math.NT", "11G09 (Primary), 11R23"], "pdf": "https://arxiv.org/pdf/2509.06633", "abs": "https://arxiv.org/abs/2509.06633", "authors": ["Takenori Kataoka", "Yoshiaki Okumura"], "title": "Iwasawa-type asymptotic formula for Taelman class groups of Drinfeld modules", "comment": "27 pages", "summary": "The Taelman class groups associated to Drinfeld modules over function fields\nserve as an analogue of ideal class groups of number fields. In this paper, we\nestablish an analogue of Iwasawa's asymptotic formula for\n$\\mathbb{Z}_p$-extensions in the context of the Taelman class groups. For this\npurpose, we naturally introduce and investigate Taelman class groups with\nmoduli."}
{"id": "2509.06706", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.06706", "abs": "https://arxiv.org/abs/2509.06706", "authors": ["Zhenlu Wang", "Ce Xu"], "title": "Contour Integrations and Parity Results of Cyclotomic Euler $T$-Sums and Multiple $t$-Values", "comment": "24 pages", "summary": "We will employ the method of contour integration to investigate the parity\nresults of non-embedded cyclotomic multiple $t$-values, which we refer to as\ncyclotomic Euler $T$-sums. We can provide explicit parity formulas for the\nlinear and quadratic cases of cyclotomic Euler $T$-sums, as well as state a\nparity theorem for the general case. We also present illustrative examples and\ncorollaries. From this, some parity results for classical cyclotomic multiple\n$t$-values can be derived. Furthermore, we present several general formulas for\ncyclotomic Euler $T$-sums with denominators involving arbitrary rational\npolynomials through residue computations. By evaluating these polynomials and\ncomputing residues, many other formulas analogous to cyclotomic Euler $T$-sums\ncan be derived. In particular, we also obtain certain parity results for the\ncyclotomic versions of multiple $T$-values as defined by Kaneko and Tsumura.\nFinally, we propose some conjectures and questions regarding the parity of\ncyclotomic multiple $t$-values and cyclotomic multiple $T$-values."}
{"id": "2509.05313", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2509.05313", "abs": "https://arxiv.org/abs/2509.05313", "authors": ["Haoyang Wang", "Xinghua Cui", "Zhifeng Peng"], "title": "The coarse trace formula of GL(4)", "comment": "69 pages", "summary": "Trace formula is an important method to study the Langlands program. Arthur\nobtains the existence of stable trace formula for connected reductive group. In\nthis paper, we will give the explicit coarse trace formula of GL(4). In general\ncase, Arthur applies the truncation operator on the two sides of trace formula,\nwhich is convergent. In our case, we will prove that the divergent terms of the\ntwo sides of the trace formula of GL(4)$ are equal. We also obtain the explicit\nformula for ramified orbits of the geometric side of trace formula of GL(4)."}
