{"id": "2508.19512", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2508.19512", "abs": "https://arxiv.org/abs/2508.19512", "authors": ["Scott Ahlgren", "Olivia Beckwith"], "title": "Scarcity of partition congruences on semiprime progressions", "comment": null, "summary": "In recent work with Raum the authors considered congruences for the ordinary\npartition function $p(n)$ of the form $p(\\ell Q^r n+\\beta)\\equiv 0\\pmod\\ell$\nwhere $\\ell, Q\\geq 5$ are prime and $r\\in \\{1,2\\}$, and proved a number of\nresults which show that such congruences are scarce in a precise sense. Here we\nimprove one of our results when $r=1$; in particular we prove (outside of\ntrivial cases) that the set of primes $Q$ such that there exists $\\beta\\in\n\\mathbb{Z}$ with $p(\\ell Q n+\\beta)\\equiv 0\\pmod \\ell$ for all $n$ has density\nzero. The proof involves a modification of part of our previous argument and an\napplication of a recent theorem of Dicks regarding modular forms of\nhalf-integral weight and level one modulo $\\ell$."}
{"id": "2508.19629", "categories": ["math.NT", "math.RA", "94B15, 94B60, 11N25"], "pdf": "https://arxiv.org/pdf/2508.19629", "abs": "https://arxiv.org/abs/2508.19629", "authors": ["Somphong Jitman"], "title": "Good Integers: A Comprehensive Review with Applications", "comment": "23 pages", "summary": "For nonzero coprime integers $a$ and $b$, a positive integer $\\ell$ is said\nto be \\emph{good with respect to $a$ and $b$} if there exists a positive\ninteger $k$ such that $\\ell$ divides $a^{k} + b^{k}$. The concept of good\nintegers has been the subject of continuous investigation since the 1990s due\nto their elegant number-theoretic properties and their significant applications\nin various areas, particularly in coding theory. This paper provides a\ncomprehensive review of good integers, emphasizing both their theoretical\nfoundations and their practical implications. We first revisit the fundamental\nnumber-theoretic properties of good integers and present their\ncharacterizations in a systematic manner. The exposition is enriched with\nwell-structured algorithms and illustrative diagrams that facilitate their\ncomputation and classification. Subsequently, we explore applications of good\nintegers in the study of algebraic coding theory. In particular, their roles in\nthe characterization, construction, and enumeration of self-dual cyclic codes\nand complementary dual cyclic codes are discussed in detail. Several examples\nare provided to demonstrate the applicability of the theory. This review not\nonly consolidates existing results but also highlights the unifying role of\ngood integers in bridging number theory and coding theory."}
{"id": "2508.19706", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2508.19706", "abs": "https://arxiv.org/abs/2508.19706", "authors": ["Ashay Burungale", "Wei He", "Ye Tian", "Xiangdong Ye"], "title": "Mod $\\ell$ non-vanishing of self-dual Hecke $L$-values over CM fields and applications", "comment": null, "summary": "Let $\\lambda$ be a self-dual Hecke character over a CM field $K$. Let\n$\\mathfrak{p}$ be a prime of the maximal totally real subfield $F$ of $K$ and\n$\\Gamma_{\\mathfrak{p}}$ the Galois group of the maximal anticyclotomic\n${\\mathbb{Z}}_{p}^{deg \\mathfrak{p}}$-extension of $K$ unramified outside\n$\\mathfrak{p}$. We prove that $$L(1,\\lambda\\nu)\\neq 0$$ for all but finitely\nmany finite order characters $\\nu$ of $\\Gamma_{\\mathfrak{p}}$ such that\n$\\epsilon(\\lambda\\nu)=+1$. For an ordinary prime $\\ell$ with respect to the CM\nquadratic extension $K/F$, we also determine the $\\ell$-adic valuation of the\nnormalised Hecke $L$-values $L^{{\\mathrm{alg}}}(1,\\lambda\\nu)$. As an\napplication, we complete Hsieh's proof of Eisenstein congruence divisibility\ntowards the CM Iwasawa main conjecture over $K$.\n  Our approach and results complement the prior work initiated by Hida's ideas\non the arithmetic of Hilbert modular Eisenstein series, studied via mod $\\ell$\nanalogue of the Andr\\'e--Oort conjecture. The previous results established the\nnon-vanishing only for a Zariski dense subset of characters $\\nu$. Our approach\nis based on the arithmetic of a CM modular form on a Shimura set, studied via\narithmetic of the CM field and Ratner's ergodicity of unipotent flows."}
{"id": "2508.19722", "categories": ["math.NT", "11S20"], "pdf": "https://arxiv.org/pdf/2508.19722", "abs": "https://arxiv.org/abs/2508.19722", "authors": ["Zhongyipan Lin"], "title": "The topological Breuil-Mézard conjecture for classical groups", "comment": null, "summary": "For unitary, orthogonal and symplectic groups, we compute the dimension of\nthe reduced Emerton-Gee stacks, and give an explicit description of their\ntop-dimensional Chow group. Our results are unconditional when $p\\neq 2$.\n  The main innovation is a new method for analyzing the vanishing locus of\nGalois cup products valued in high dimensions."}
{"id": "2508.19360", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2508.19360", "abs": "https://arxiv.org/abs/2508.19360", "authors": ["Julien Thiebaut"], "title": "Search for a basis of the Temperley-Lieb algebra, using rewriting systems", "comment": "35 pages. This document is an internship report from a bachelor\n  student. It shows a lot of \"known\" results, except for part 2.1.2, giving the\n  Jones normal form of a diagram; part 2.2.2-3, applying rewriting theory to\n  find the Jones normal forms basis of the Temperley-Lieb algebra; and 4.3-4,\n  applying category theory to find a new basis", "summary": "We begin by defining Temperley-Lieb algebra, in two different ways: as a\npresented algebra or as a diagrammatic algebra. Next, we look for a basis\nalgorithmically, using rewriting theory. Finally, we introduce a generalization\nof the Temperley-Lieb algebra, which is an oriented version of the previous\none. This pushes us to employ a more efficient tool, category theory, to use\nrewriting to easily obtain a basis for the algebra."}
{"id": "2508.19741", "categories": ["math.NT", "math.CO", "11P81, 05A17"], "pdf": "https://arxiv.org/pdf/2508.19741", "abs": "https://arxiv.org/abs/2508.19741", "authors": ["Anton Bugleev"], "title": "Two-color partitions and overpartitions: a combinatorial proof", "comment": "5 pages", "summary": "George Andrews and Mohamed El Bachraoui recently explored identities for\ntwo-color partitions. In particular, they studied the connection between\ntwo-colored partitions and overpartitions. Their proofs were analytical, but\nthey conjectured combinatorial proofs of their results. In this paper we use\ntwo-modular diagrams to give a combinatorial proof of their main result."}
{"id": "2508.19738", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2508.19738", "abs": "https://arxiv.org/abs/2508.19738", "authors": ["Shahar Dagan"], "title": "Bound on multiplicities of symmetric pairs over p-adic fields", "comment": "32 pages", "summary": "We establish uniform bounds on the multiplicities of irreducible admissible\nrepresentations appearing in spaces of functions on symmetric spaces over\n$p$-adic fields. These multiplicities can exceed one and depend intricately on\nthe group, the space, and the representation, making exact computations often\ninfeasible. This motivates the search for bounds depending only on simple\nstructural parameters.\n  More precisely, let $G$ be a connected reductive group over a non-Archimedean\nlocal field $F$ of odd residual characteristic, and let $\\theta$ be a rational\ninvolution with fixed-point subgroup $H = G^\\theta$. For any unramified smooth\ncharacter $\\chi$ of $H$, we show that the multiplicity\n  \\[\n  \\dim \\mathrm{Hom}_G(\\rho, C^\\infty(G/H,\\chi))\n  \\] is uniformly bounded for a broad class of irreducible admissible\nrepresentations $\\rho$ of $G$, conjecturally including all such\nrepresentations. The bound depends only on the rank of $G$ and the residue\ndegree of $F$. Our method combines Mackey theory with cohomological techniques.\n  As an application, we deduce a uniform bound on such multiplicities for all\nbut finitely many local completions of a fixed number field."}
{"id": "2508.19743", "categories": ["math.NT", "math.DS", "11K50 (Primary) 11J70, 37A44 (Secondary)"], "pdf": "https://arxiv.org/pdf/2508.19743", "abs": "https://arxiv.org/abs/2508.19743", "authors": ["Slade Sanderson"], "title": "Superoptimal continued fractions", "comment": "14 pages, 4 figures", "summary": "Motivated by the optimal continued fractions studied independently by\nSelenius and Bosma, we define and introduce algorithms producing superoptimal\ncontinued fraction expansions of irrationals. These expansions simultaneously\nprovide arbitrarily good rational approximations and converge arbitrarily\nquickly."}
{"id": "2508.19763", "categories": ["math.RT", "math.RA", "16G10, 16G20, 16E05, 16E10"], "pdf": "https://arxiv.org/pdf/2508.19763", "abs": "https://arxiv.org/abs/2508.19763", "authors": ["Yu-Zhe Liu", "Xin Ma", "Jiacheng Xu", "Chao Zhang"], "title": "Homological Bounds of Gentle algebras", "comment": "26 pages, 2 figures", "summary": "This paper studies the homological bounds of gentle algebras, i.e., the upper\nbounds for the sum of the projective and injective dimensions of indecomposable\nmodules over gentle algebras. We provide conditions under which this sum is\nstrictly less than twice the global dimension, and as an application, we give a\ncharacterization of quasi-tilted gentle algebras."}
{"id": "2508.19947", "categories": ["math.NT", "14G05 (Primary) 11G30, 14H30 (Secondary)"], "pdf": "https://arxiv.org/pdf/2508.19947", "abs": "https://arxiv.org/abs/2508.19947", "authors": ["L. Alexander Betts"], "title": "On a non-abelian analogue of a conjecture of Michael Stoll", "comment": "63 pages, submitted to volume in honour of Minhyong Kim", "summary": "We formulate a non-abelian generalisation of a conjecture of Stoll, which\nconjecturally describes the structure of the loci cut out by Kim's method of\nnon-abelian Chabauty. We prove the rank 0 quadratic case of this conjecture,\nwhich in particular determines the structure of the quadratic Chabauty locus\nfor once-punctured elliptic curves of rank 0. The proof involves using a\nvariant of the geometric quadratic Chabauty method of Edixhoven and Lido to\nreduce to an unlikely intersections problem, and ultimately to known results\nabout the relative Manin--Mumford Conjecture."}
