{"id": "2511.02843", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.02843", "abs": "https://arxiv.org/abs/2511.02843", "authors": ["Luc Ramsès Talla Waffo"], "title": "Perspectives on the arithmetic nature of the ratios $ζ(2n + 1)/π^{2n+1}$ and $β(2n)/π^{2n}$", "comment": null, "summary": "We investigate the values of the Riemann zeta function at odd integers and\nthe Dirichlet beta function at even integers, by collecting several distinct\nanalytic frameworks converging to these values, thus providing a unifying\nperspective. Beyond analytic interest, these formulas motivate linear\nindependence conjectures which, if established, would imply the irrationality\nof the quantities $\\zeta(2n + 1)/\\pi^{2n+1}$ and $\\beta(2n)/\\pi^{2n}$"}
{"id": "2511.02858", "categories": ["math.NT", "math.FA", "47G30 11S80"], "pdf": "https://arxiv.org/pdf/2511.02858", "abs": "https://arxiv.org/abs/2511.02858", "authors": ["Alexandra V. Antoniouk", "Anatoly N. Kochubei"], "title": "Non-Archimedean Kelvin Transformation", "comment": null, "summary": "We introduce and study an analog of the Kelvin transformation connected with\nthe Vladimirov-Taibleson operator acting on real- or complex-valued functions\non a space $K^n$ over a non-Archimedean local field $K$."}
{"id": "2511.03177", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.03177", "abs": "https://arxiv.org/abs/2511.03177", "authors": ["Takumi Anzawa"], "title": "A Lie algebra associated with adjoint multiple zeta values", "comment": null, "summary": "Jarossay introduced adjoint multiple zeta values, and he found\n$\\mathbb{Q}$-algebraic relations among adjoint multiple zeta values, referred\nto as the \\emph{adjoint double shuffle relations}, by using Racinet's dual\nformulation of the generating series of multiple zeta values. Jarossay defined\nthe affine scheme $\\mathrm{AdDMR}_0$ determined by the adjoint double shuffle\nrelations and posed a question whether $\\mathrm{AdDMR}_0$ is isomorphic to\nRacinet's double shuffle group $\\mathrm{DMR}_0$. In this paper, we refine\nJarossay's question by formulating what we call the adjoint conditions and by\naddressing its Lie algebraic side. Within this framework, we construct the Lie\nalgebra associated with the adjoint double shuffle relations by imposing\nHirose's parity results."}
{"id": "2511.03294", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.03294", "abs": "https://arxiv.org/abs/2511.03294", "authors": ["Valentin Blomer", "Junxian Li"], "title": "A higher rank shifted convolution problem with applications to L-functions", "comment": "29 pages", "summary": "While several instances of shifted convolution problems for GL(3) x GL(2)\nhave been solved, the case where one factor is the classical divisor function\nand one factor is a GL(3) Fourier coefficient has remained open. We solve this\ncase in the present paper. The proof involves two intertwined applications of\ndifferent types of delta symbol methods. As an application we establish an\nasymptotic formula for central values of L-functions for a GL(3) automorphic\nform twisted by Dirichlet characters to moduli q < Q."}
{"id": "2511.03101", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.03101", "abs": "https://arxiv.org/abs/2511.03101", "authors": ["Shoumin Liu", "Zhaohuan Peng", "Xumin Wang"], "title": "Coxeter groups and the proper joint spectrums of their faithful representations", "comment": "11 pages", "summary": "In this paper, we analyze the faithful representations of the dihedral\ngroups, and prove that the Coxeter groups can be determined by the proper joint\nspectrum of their faithful representations."}
{"id": "2511.03331", "categories": ["math.NT", "11Y50, 11R04, 11D25"], "pdf": "https://arxiv.org/pdf/2511.03331", "abs": "https://arxiv.org/abs/2511.03331", "authors": ["István Gaál"], "title": "Calculating generators of power integral bases in sextic fields with a quadratic subfield: the general case", "comment": null, "summary": "In some previous works we gave algorithms for determining generators of power\nintegral basis in sextic fields with a quadratic subfield, under certain\nrestrictions. The purpose of the present paper is to extend those methods to\nthe general case, when the relative integral basis of the sextic field over the\nquadratic subfield is of general form. This raises several technical\ndifficulties, that we consider here."}
{"id": "2511.03385", "categories": ["math.RT", "math.CO", "16G10, 16E10, 06A11"], "pdf": "https://arxiv.org/pdf/2511.03385", "abs": "https://arxiv.org/abs/2511.03385", "authors": ["Tal Gottesman", "Viktória Klász", "Markus Kleinau", "Rene Marczinzik"], "title": "Pure minimal injective resolutions and perfect modules for lattices", "comment": "13 pages", "summary": "In a recent article, Iyama and Marczinzik showed that a lattice is\ndistributive if and only if the incidence algebra is Auslander regular, giving\na new connection between homological algebra and lattice theory. In this\narticle we study when a distributive lattice has a pure minimal injective\ncoresolution, a notion first introduced and studied in a work of Ajitabh, Smith\nand Zhang. We will see that this problem naturally leads to studying when\ncertain antichain modules are perfect modules. We give a classification of\nperfect antichain modules under the assumption that their canonical antichain\nresolution is minimal and use this to give a completion classification in\nlattice theoretic terms of incidence algebras of distributive lattices with\npure minimal injective coresolution."}
{"id": "2511.03428", "categories": ["math.NT", "math.AC", "math.CO", "math.RA", "13F60, 11D09, 11B39"], "pdf": "https://arxiv.org/pdf/2511.03428", "abs": "https://arxiv.org/abs/2511.03428", "authors": ["Zhichao Chen", "Zelin Jia"], "title": "Tropicalization and cluster asymptotic phenomenon of generalized Markov equations", "comment": "38 pages, 10 figures. All comments are welcome!", "summary": "The generalized Markov equations are deeply connected with the generalized\ncluster algebras of Markov type. We construct a deformed Fock-Goncharov\ntropicalization for the generalized Markov equations and prove that their\ntropicalized tree structure is essentially the same as that of the classical\nEuclid tree. We then define the generalized Euclid tree and prove that it\nconverges to the classical Euclid tree up to a scalar multiple. Moreover, by\nmeans of cluster mutations, we exhibit an asymptotic phenomenon, up to some\nlimit q, between the logarithmic generalized Markov tree and the classical\nEuclid tree. A rationality conjecture of q is then put forward. We also propose\na generalized Markov uniqueness conjecture for the generalized Markov\nequations, which illustrates an application of the asymptotic phenomenon."}
{"id": "2511.03484", "categories": ["math.RT", "math.CO", "05E10, 20C30, 05A17"], "pdf": "https://arxiv.org/pdf/2511.03484", "abs": "https://arxiv.org/abs/2511.03484", "authors": ["Mahdi Ebrahimi"], "title": "Manivel's semi-group property for Kronecker coefficients, generalized blocks of symmetric groups and Saxl conjecture", "comment": null, "summary": "Given an positive integer $k$, let $n:=\\binom{k+1}{2}$. In 2012, during a\ntalk at UCLA, Jan Saxl conjectured that all irreducible representations of the\nsymmetric group $S_n$ occur in the decomposition of the tensor square of the\nirreducible representation corresponding to the staircase partition. In this\npaper, we investigate two useful methods to obtain some irreducible\nrepresentations that occur in this decomposition. Our main tolls are the\nsemi-group property for Kronecker coefficients and generalized blocks of\nsymmetric groups."}
{"id": "2511.03430", "categories": ["math.NT", "math.CA", "math.CV", "math.FA", "math.PR"], "pdf": "https://arxiv.org/pdf/2511.03430", "abs": "https://arxiv.org/abs/2511.03430", "authors": ["Seth Hardy", "Max Wenqiang Xu"], "title": "Helson's conjecture for smooth numbers", "comment": "43 pages, including a 10-page introduction", "summary": "Let $\\Psi(x,y)$ denote the count of $y$-smooth numbers below $x$ and $P(n)$\ndenote the largest prime factor of $n$. We prove that for $f$ a Steinhaus\nrandom multiplicative function, the partial sums over $y$-smooth numbers enjoy\nbetter than squareroot cancellation, in the sense that $$ \\mathbb E\n\\Big|\\sum_{\\substack{1\\leq n \\leq x\\\\ P(n) \\leq y}} f(n) \\Big| = o\\left(\n\\Psi(x,y)^{1/2} \\right),$$ uniformly for $(\\log x)^{30} \\leq y \\leq x$. Our\nbounds are quantitative and give a large saving when $y$ isn't too close to\n$x$."}
{"id": "2511.03536", "categories": ["math.RT", "math.CO", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.03536", "abs": "https://arxiv.org/abs/2511.03536", "authors": ["Allan Berele", "Giovanni Cerulli Irelli", "Javier De Loera Chávez", "Elena Pascucci"], "title": "Polynomial identities for quivers via incidence algebras", "comment": "4 pages", "summary": "We show that the path algebra of a quiver satisfies the same polynomial\nidentities of an algebra of matrices, if any. In particular, the algebra of nxn\nmatrices is PI-equivalent to the path algebra of the oriented cycle with n\nvertices."}
{"id": "2511.03431", "categories": ["math.NT", "11M32, 11B83, 05A19"], "pdf": "https://arxiv.org/pdf/2511.03431", "abs": "https://arxiv.org/abs/2511.03431", "authors": ["Kwang-Wu Chen"], "title": "Coincidence among sum formulas for zeta-like multiple values", "comment": "17 pages", "summary": "We study two families of zeta-like multiple series -- the multiple\n$\\rho$-values and the multiple $\\eta$-values -- defined by nested sums with\nshifted denominators. An explicit factorial formula for $\\rho$ reveals its\nintrinsic combinatorial structure and leads to closed expressions for fixed\nweight and depth. A remarkable identity emerges from a weighted-sum\ntransformation, exhibiting a perfect discrete balance. The main theorem proves\nthat the total sums of $\\rho$- and $\\eta$-values coincide for equal weight but\ncomplementary depths. This correspondence provides an analytic basis for\nintegral representations of $\\eta$-values and for deriving weighted sum\nrelations. Together, these results show that the $\\rho$- and $\\eta$-families\nform two complementary realizations of a unified analytic-combinatorial\nstructure, bridging factorial and harmonic formulations in zeta-like multiple\nsums."}
{"id": "2511.03446", "categories": ["math.NT", "math.GT", "57K10, 11R45 (Primary) 11R18, 11R23 (Secondary)"], "pdf": "https://arxiv.org/pdf/2511.03446", "abs": "https://arxiv.org/abs/2511.03446", "authors": ["Anwesh Ray", "Tanushree Shah"], "title": "Arithmetic invariants of torus links", "comment": "Version 1: 29 pages", "summary": "The classical analogy between knots and primes motivates the study of\nAlexander polynomials through an arithmetic perspective. In this article we\nstudy the two-parameter family of torus knots and links $T_{p,q}$ and analyze\nthe asymptotic behaviour of the zeros of their Alexander polynomials\n$\\Delta_{p,q}(t)$, defined with respect to the total linking number covering.\nWe prove that as $p,q\\to\\infty$ these zeros become equidistributed on the unit\ncircle and derive an explicit formula for the limiting frequency with which\nprimitive $r$-th roots of unity appear. To capture finer statistical\ninformation, we introduce the moment sequence of the zero distribution and\ncompute its generating function in closed form. We further examine the Iwasawa\ntheory of the corresponding branched covers, determining the Iwasawa\ninvariants. The logarithmic Mahler measure of $\\Delta_{p,q}(t)$ vanishes\nidentically and the associated homological growth in towers of abelian covers\nof $S^3$ branched along $T_{p,q}$ is subexponential."}
{"id": "2511.03458", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.03458", "abs": "https://arxiv.org/abs/2511.03458", "authors": ["Xiaoyu Qu", "Jiahong Yu"], "title": "Rational Hodge--Tate prismatic crystals of quasi-l.c.i algebras and non-abelian $p$-adic Hodge theory", "comment": null, "summary": "Consider a bounded prism $(A,I)$ and a bounded quasi-l.c.i algebra $R$ over\n$\\overline{A}$. In this paper, for any prism $S/A$ with a surjection $S\\to R$\nsuch that $\\widehat{\\mathbb L}_{\\overline{S}/\\overline{A}}$ is a $p$-completely\nflat module over $\\overline{S}$, we establish an equivalence of categories\nbetween rational Hodge-Tate crystals on $(R/A)_{\\Delta}$ and topologically\nnilpotent integrable connections on the Hodge--Tate cohomology ring\n$\\overline{\\Delta}_{R/S}$. As an application, for a non-zero divisor $a\\in\n\\overline{A}$, we introduce the concept of $a$-smallness for a rational\nHodge-Tate prismatic crystal on $(R/A)_{\\Delta}$. Finally, we focus on some\nspecial algebras $R$ over $\\mathcal O_{\\mathbb C_p}$ (or generally, the ring of\nintegers of an algebraic closed and complete non-archimedean field) including\nall $p$-completely smooth algebras, $p$-complete algebras with semi-stable\nreductions and geometric valuation rings. By using our equivalence, we analyze\nthe restriction functor from the category of $a$-small rational Hodge-Tate\nprismatic crystals to the category of $v$-vector bundles. This yields some new\nresults in $p$-adic non-abelian Hodge Theory."}
