{"id": "2511.21785", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.21785", "abs": "https://arxiv.org/abs/2511.21785", "authors": ["Rene Marczinzik"], "title": "On a question of Auslander and Bridger on 2-reflexive modules", "comment": null, "summary": "We answer a question raised by Auslander and Bridger by showing that not every 2-reflexive module is reflexive."}
{"id": "2511.22051", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2511.22051", "abs": "https://arxiv.org/abs/2511.22051", "authors": ["Minghui Zhao"], "title": "Geometric realizations of Ringel-Hall algebras of continuous quivers of type $A$", "comment": null, "summary": "Lusztig introduced the geometric realizations of quantum groups associated to finite quivers and defined their canonical bases. Sala and Schiffmann introduced the Ringel-Hall algebra of line and realized it as the direct limit of Ringel-Hall algebras of finite quivers of type $A$. In this paper, we shall give geometric realizations of Ringel-Hall algebras of continuous quivers of type $A$ via the geometric realizations of Lusztig by using the method of approximation given by Sala and Schiffmann."}
{"id": "2511.22614", "categories": ["math.RT", "math.AC"], "pdf": "https://arxiv.org/pdf/2511.22614", "abs": "https://arxiv.org/abs/2511.22614", "authors": ["Antoine Caradot", "Zongzhu Lin"], "title": "Differential graded algebras with divided powers and homotopy Lie algebras", "comment": "44 pages. Preliminary version", "summary": "Given a commutative ring $R$ and a quotient module $R/\\mathfrak{m}$, we study the structure of differential graded algebra with divided powers that the resolution of $R/\\mathfrak{m}$ can possess. We provide a construction of such a resolution by making use of symmetric tensors, which does not require a Noetherian assumption on $R$. We then apply those results to study the homotopy Lie algebra associated to a the pair $(R,R/\\mathfrak{m})$, and then investigate in more details the complete intersection case."}
{"id": "2511.22635", "categories": ["math.RT", "math.OA"], "pdf": "https://arxiv.org/pdf/2511.22635", "abs": "https://arxiv.org/abs/2511.22635", "authors": ["Jacob Bradd", "Nigel Higson", "Robert Yuncken"], "title": "Lie groupoids, the Satake compactification and the tempered dual, II: The Harish-Chandra principle", "comment": null, "summary": "We give a geometric account of Harish-Chandra's principle that a tempered irreducible representation of a real reductive group is either square-integrable modulo center, or embeddable in a representation that is parabolically induced from such a representation. Our approach uses the Satake compactification, an associated groupoid that was constructed in the first paper of this series, and its $C^*$-algebra."}
{"id": "2511.21798", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.21798", "abs": "https://arxiv.org/abs/2511.21798", "authors": ["Paul Boisseau"], "title": "Residues of Rankin-Selberg Zeta integrals and the split non-tempered Gan-Gross-Prasad conjectures", "comment": null, "summary": "We construct a regularization of the Rankin-Selberg period on general linear groups for non-tempered automorphic representations using residues of Zeta integrals. We prove that it satisfies the global non-tempered Gan-Gross-Prasad conjecture and its Ichino-Ikeda refinement. We also build a local version of our regularization and show that it defines a non-zero invariant linear form on non-tempered representations. Combined with previous works of Chan, Chen and Chen, this settles the conjectures over local fields of characteristic zero."}
{"id": "2511.22637", "categories": ["math.RT", "math.OA"], "pdf": "https://arxiv.org/pdf/2511.22637", "abs": "https://arxiv.org/abs/2511.22637", "authors": ["Jacob Bradd", "Nigel Higson", "Robert Yuncken"], "title": "Lie groupoids, the Satake compactification and the tempered dual, I: The Satake groupoid", "comment": null, "summary": "The (maximal) Satake compactification associated to a real reductive group $G$ is the closure of the symmetric space of all maximal compact subgroups of $G$ within the compact space of all closed subgroups of $G$. We shall present three different views of a groupoid that may be associated to the Satake compactification. To begin, we shall define our Satake groupoid, as we shall call it, as a topological groupoid, and as a special case of a general construction of Omar Mohsen. Then we shall give a Lie-theoretic account of the Satake groupoid, borrowing from work of Toshio Oshima. Finally we shall identify the Satake groupoid with the purely geometric $b$-groupoid of the Satake compactification, using the structure of the compactification as a smooth manifold with corners. In a subsequent paper we shall use the Satake groupoid to present a new proof of Harish-Chandra's principle, that all the tempered irreducible representations of $G$ may be constructed from discrete series representations using parabolic induction."}
{"id": "2511.21899", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21899", "abs": "https://arxiv.org/abs/2511.21899", "authors": ["Dante Bonolis"], "title": "On the $2$-torsion in class groups of number fields", "comment": null, "summary": "In $2020$, Bhargava, Shankar, Taniguchi, Thorne, Tsimerman, and Zhao proved that for a finite extension $K/\\mathbb{Q}$ of degree $n\\geq 5$, the size of the $2$-torsion class group is bounded by $\\# h_{2}(K)=O_{n,\\varepsilon}(D_{K}^{\\frac{1}{2}-\\frac{1}{2n}+\\varepsilon})$, where $D_{K}$ is the absolute discriminant of $K$. In the present paper, we improve their bound by proving that $\\# h_{2}(K)=O_{n,\\varepsilon}(D_{K}^{\\frac{1}{2}-\\frac{1}{2n}-δ_{K}+\\varepsilon})$, for a constant $δ_{K}\\geq\\frac{1}{28n}-\\frac{3}{28n(n-1)}$."}
{"id": "2511.22655", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2511.22655", "abs": "https://arxiv.org/abs/2511.22655", "authors": ["Wei Xing"], "title": "Replicated algebras derived equivalent to higher Auslander algebras of type A", "comment": "28 pages", "summary": "We show that every higher Auslander algebra $A_{n+1}^d$ of type $\\mathbb{A}$ such that $\\gcd(n,d)=1$ is derived equivalent to a certain replicated algebra $B=B_0^{(n+d)}$. Moreover ${\\rm{gldim}} B = nd$ and $B$ admits an $nd$-cluster tilting subcategory consisting of all direct sums of projective modules and injective modules. We introduce a class of algebras called $2$-subhomogeneous $m$-representation finite to characterize the homological properties of $B$ and give a method to obtain derived equivalences between fractionally Calabi-Yau algebras and $2$-subhomogeneous algebras using certain tilting complexes."}
{"id": "2511.21979", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.21979", "abs": "https://arxiv.org/abs/2511.21979", "authors": ["Naman Pratap", "Anwesh Ray"], "title": "An analogue of Kida's formula for Mazur-Tate elements", "comment": "Version 1: 22 pages", "summary": "We prove an analogue of Kida's formula for the Iwasawa invariants of the Mazur-Tate elements attached to elliptic curves over $\\mathbb{Q}$. Let $p$ be an odd prime and let $L/K$ be a Galois extension of abelian number fields with $p$-power Galois group. For an elliptic curve $E/\\mathbb{Q}$, we study the Mazur-Tate elements over the finite layers of the cyclotomic $\\mathbb{Z}_p$-extensions of $K$ and $L$. We show that the vanishing of the $μ$-invariant is preserved in the extension: if the level-$n$ Mazur-Tate element over $K$ has $μ= 0$, then the corresponding element over $L$ also has $μ= 0$. Moreover, the associated $λ$-invariants satisfy an explicit transition formula. This parallels the work of Hachimori-Matsuno on Selmer groups and of Matsuno on $p$-adic $L$-functions. As an application, we obtain an analogue of Kida's formula for the analytic Iwasawa invariants associated to Pollack's signed $p$-adic $L$-functions. Since our results apply to elliptic curves with any reduction type at $p$ under mild hypotheses, including those with additive reduction, we also obtain a Kida-type formula for the $p$-adic $L$-functions constructed by Delbourgo for elliptic curves with unstable additive reduction. In particular, because Mazur-Tate elements approximate $p$-adic $L$-functions in the limit, our results unify all previously known cases of Kida's formula for analytic Iwasawa invariants."}
{"id": "2511.21798", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.21798", "abs": "https://arxiv.org/abs/2511.21798", "authors": ["Paul Boisseau"], "title": "Residues of Rankin-Selberg Zeta integrals and the split non-tempered Gan-Gross-Prasad conjectures", "comment": null, "summary": "We construct a regularization of the Rankin-Selberg period on general linear groups for non-tempered automorphic representations using residues of Zeta integrals. We prove that it satisfies the global non-tempered Gan-Gross-Prasad conjecture and its Ichino-Ikeda refinement. We also build a local version of our regularization and show that it defines a non-zero invariant linear form on non-tempered representations. Combined with previous works of Chan, Chen and Chen, this settles the conjectures over local fields of characteristic zero."}
{"id": "2511.22207", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.22207", "abs": "https://arxiv.org/abs/2511.22207", "authors": ["Debargha Banerjee", "Dron Airon", "Pranjal Vishwakarma", "Ronit Debnath"], "title": "An algorithm to compute upper bounds of dimensions for Siegel Modular Forms of Prime Level and Arbitrary Nebentypus", "comment": null, "summary": "We describe an algorithmic method to determine the image of restriction maps for Siegel modular forms with \\textit{arbitrary} characters and arbitrary weight. A program has been implemented in the mathematical software \\texttt{Java} to compute the Fourier expansion of the image of these restriction maps for Siegel modular forms of genus two. This approach allows us to compute an upper bound for the space of Siegel modular forms with {\\it non-trivial} character (which has not been previously known) and arbitrary weights (including low weight $k \\leq 4$)."}
{"id": "2511.22644", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.22644", "abs": "https://arxiv.org/abs/2511.22644", "authors": ["Liyuan Ye"], "title": "Stationary phase analysis for analytic newvectors and application to subconvexity problems", "comment": "Comments welcome", "summary": "In this paper, we extend the results of Michel-Venkatesh and Hu-Michel-Nelson to establish an upper bound for triple product and Rankin-Selberg L-functions of the form $$L(π_1 \\otimes π_2 \\otimes π_3,\\frac{1}{2})\\ll_{π_3,ε}C(π_1\\otimesπ_2)^{\\frac{1}{2} + ε} \\left( \\frac{C(π_1 \\otimes π_2)}{C(π_2 \\otimes π_2)}\\right)^{-δ}$$ in the spectral aspect, allowing conductor dropping. In particular, we obtain a subconvexity bound when $π_1\\otimesπ_2$ stays uniformly away from QUE-like case. The new ingredient is a stationary phase analysis of the analytic newvectors introduced by Jana and Nelson in \\cite{JN19}, for both $\\mathrm{PGL}_2(\\mathbb{R})$ and $\\mathrm{PGL}_2(\\mathbb{C})$, which is applied to a test vector conjecture for local triple product periods."}
{"id": "2511.22755", "categories": ["math.NT", "math.FA", "math.OA"], "pdf": "https://arxiv.org/pdf/2511.22755", "abs": "https://arxiv.org/abs/2511.22755", "authors": ["Alain Connes", "Caterina Consani", "Henri Moscovici"], "title": "Zeta Spectral Triples", "comment": "34 pages, 4 Figures, to appear in EMS series Lectures Notes in Mathematics Title : Applications of Noncommutative Geometry to Gauge Theories, Field Theories, and Quantum Space-Time", "summary": "We propose and investigate a strategy toward a proof of the Riemann Hypothesis based on a spectral realization of its non-trivial zeros. Our approach constructs self-adjoint operators obtained as rank-one perturbations of the spectral triple associated with the scaling operator on the interval $[λ^{-1}, λ]$. The construction only involves the Euler products over the primes $p \\leq x = λ^2$ and produces self-adjoint operators whose spectra coincide, with striking numerical accuracy, with the lowest non-trivial zeros of $ζ(1/2 + i s)$, even for small values of $x$.\n  The theoretical foundation rests on the framework introduced in \"Spectral triples and zeta-cycles\" (Enseign. Math. 69 (2023), no. 1-2, 93-148), together with the extension in \"Quadratic Forms, Real Zeros and Echoes of the Spectral Action\" (Commun. Math. Phys. (2025)) of the classical Caratheodory-Fejer theorem for Toeplitz matrices, which guarantees the necessary self-adjointness.\n  Numerical experiments show that the spectra of the operators converge towards the zeros of $ζ(1/2 + i s)$ as the parameters $N, λ\\to \\infty$. A rigorous proof of this convergence would establish the Riemann Hypothesis. We further compute the regularized determinants of these operators and discuss the analytic role they play in controlling and potentially proving the above result by showing that, suitably normalized, they converge towards the Riemann $Ξ$ function."}
{"id": "2511.22797", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.22797", "abs": "https://arxiv.org/abs/2511.22797", "authors": ["Zev Rosengarten"], "title": "Splitting p-primary cohomology classes of tori in characteristic p", "comment": "22 pages", "summary": "We prove that $p$-primary cohomology classes of a torus $T$ over a global function field of characteristic $p$ may be split by suitable separable $p$-primary extensions. More precisely, we show that such cohomology classes will split in any ``large'' $p$-primary extension (and in fact, prove the same for $\\ell$-primary classes over ``large'' $\\ell$-primary extensions for every prime $\\ell$, including $\\ell \\neq \\mathrm{char}(K)$), and we prove that $p^n$-torsion classes may be split by a (solvable) separable $p$-primary extension of degree $\\leq (p^n)^{1+cm\\mathrm{log}(m)^3}$ for an explicitly computable universal constant $c > 0$, where $m$ is the degree of a finite Galois extension splitting the torus $T$. Along the way, we also prove Grunwald-Wang type results of independent interest which allow one to approximate a given finite list of abelian $p$-primary local extensions of places of a global function field by a suitable global extension."}
{"id": "2511.22811", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.22811", "abs": "https://arxiv.org/abs/2511.22811", "authors": ["Moqing Chen"], "title": "Monodromy Groups of Supersingular Abelian Surfaces over $\\mathbb{Q}_p$", "comment": null, "summary": "For primes $p\\ge 7$, we give a parametrization of the filtered $\\varphi$-modules attached to the $p$-adic Tate modules of abelian surfaces over $\\mathbb{Q}_p$ with supersingular good reduction. We use this classification to determine the neutral components of the monodromy groups of the associated $p$-adic representations up to $\\bar{\\mathbb{Q}}_p$-isomorphism. Furthermore, we analyze the $p$-adic distribution of these groups in the moduli space of filtered $\\varphi$-modules. In particular, we prove that the neutral components are generically isomorphic to $\\mathbf{GL}_2 \\times_{\\det} \\mathbf{GL}_2$."}
{"id": "2511.22814", "categories": ["math.NT", "math.AC", "math.RA"], "pdf": "https://arxiv.org/pdf/2511.22814", "abs": "https://arxiv.org/abs/2511.22814", "authors": ["Vanni Noferini"], "title": "Eventual periodicity of the Smith forms of integer matrix powers", "comment": null, "summary": "We prove that the Smith forms of the powers of an integer square matrix behave in an eventually periodic manner. More precisely, if $\\mathrm{SF}(M)$ denotes the Smith form of $M \\in \\Z^{m \\times m}$, then for every $A \\in \\Z^{m \\times m}$ there exist $n_0 \\in \\N$, an integer $T \\geq 1$, and a constant diagonal matrix $D \\in \\Z^{m \\times m}$ such that $n \\geq n_0$ implies $\\mathrm{SF}(A^{n+T})=D \\cdot \\mathrm{SF}(A^n)$. This provides an eventually affirmative answer to a conjecture posed in 2013 by R. Bruner. We also show that both $n_0$ and $T$ can be arbitrarily large."}
{"id": "2511.22877", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2511.22877", "abs": "https://arxiv.org/abs/2511.22877", "authors": ["Wooyeon Kim", "Andreas Wieser", "Pengyu Yang"], "title": "Representations of binary forms by quaternary quadratic forms", "comment": "10 pages", "summary": "We prove a local-global principle for representations of binary by quaternary quadratic forms. One of the main ingredients is a recent measure rigidity result of Einsiedler and Lindenstrauss for diagonalizable actions on quotients of products of $\\mathrm{SL}_2$'s. Based on this, it suffices to show that limits of the uniform measures on the associated rank one adelic toral packets have more entropy than one half of the maximal entropy. The latter is proved using the Siegel mass formula and the determinant method as developed by Bombieri and Pila as well as Heath-Brown."}
{"id": "2511.22881", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.22881", "abs": "https://arxiv.org/abs/2511.22881", "authors": ["Foivos Chnaras", "Noah Kupinsky"], "title": "The Structure and Degrees of Polynomials Computing Square Roots $\\mod p$", "comment": null, "summary": "For an odd prime $p$, we say a polynomial $f\\in \\mathbb F_p[X]$ computes square roots if $f(a)^2=a$ for all nonzero, perfect squares $a\\in \\mathbb F_p$. When $p\\equiv 3 \\mod 4$, it is easy to see that $f(X)=X^{\\frac{p+1}{4}}$ is the smallest such polynomial. For $p\\equiv 1 \\mod 4$, the situation is less clear. Tonelli-Shanks offers an algorithm for constructing polynomials that compute square roots, but the question of whether their degree is minimal remains. In this paper, we study the various degrees and structures of polynomials computing square roots."}
{"id": "2511.22905", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2511.22905", "abs": "https://arxiv.org/abs/2511.22905", "authors": ["Declan Hoban", "Jibran Iqbal Shah", "Nadya-Catherine Ismail", "William Verreault", "Asif Zaman"], "title": "Central limit theorems for random multiplicative functions over function fields", "comment": "31 pages", "summary": "We provide a sufficient characterization for subsets $\\mathcal{A}$ of the polynomial ring $\\mathbb{F}_q[t]$ for which partial sums of Steinhaus random multiplicative functions approach a complex standard normal distribution. This extends recent work of Soundararajan and Xu to the function field setting. We apply this characterization to deduce central limit theorems in four cases: polynomials in short intervals, polynomials with few prime factors, shifted primes, and rough polynomials. In doing so, we also establish an explicit Hildebrand inequality for smooth polynomials in short intervals, a function field form of Shiu's theorem for multiplicative functions, and an explicit Chebyshev bound for rough polynomials in short intervals."}
{"id": "2511.23096", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.23096", "abs": "https://arxiv.org/abs/2511.23096", "authors": ["Esrafil Ali Molla"], "title": "Average Shifted Convolution sum for $GL(d_1)\\times GL(d_2)$", "comment": "17 pages", "summary": "We study the average shifted convolution sum $$ B(H,N):= \\frac{1}{H} \\sum_{h \\sim H} \\sum_{n \\sim N} A_{π_1}(n)\\, A_{π_2}(n+h), $$ where $A_{π_i}(n)$ denotes the Fourier coefficients of a Hecke--Maass cusp form $π_i$ for $SL(d_i,\\mathbb{Z})$ with $d_i\\ge 4$, $i=1,2$. For the cases $d_1 = d_2 + 1$ and $d_1 = d_2$, we establish a nontrivial power-saving bound of $B(H,N)$ for the range of the shift $H\\ge N^{1-\\frac{4}{d_1+d_2}+\\varepsilon}$ for any $\\varepsilon>0$, extending beyond the results of Friedlander and Iwaniec. In particular, when $d_1 = d_2$, we reach the critical threshold $H\\ge N^{1-2/d+\\varepsilon}$ such that any further improvement in this range yields a subconvexity bound for the corresponding standard $L$-function in the $t$-aspect."}
{"id": "2511.23223", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.23223", "abs": "https://arxiv.org/abs/2511.23223", "authors": ["Hai-Liang Wu", "Yue-Feng She"], "title": "On restricted sums of four squares and Zhi-Wei Sun's $x+24y$ conjecture", "comment": "14 pages. Comments are welcome", "summary": "In this paper, by using the arithmetic theory of ternary quadratic forms, we study some refinements on Lagrange's four-square theorem. For example, given positive integers $a,b$ satisfying some algebraic conditions and a positive integer $C\\ge3$, we will show that for any sufficiently large integer $n$ with $\\ord_2(n)\\le C$, there exist non-negative integers $x,y,z,w$ such that\n  $$ \\begin{cases}\n  x^2+y^2+z^2+w^2=n,\n  ax+by\\in\\mathcal{S},\n  \\end{cases} $$\n  where $\\mathcal{S}$ is the set of all squares over $\\mathbb{Z}$. In particular, we obtain some progress on Zhi-Wei Sun's $x+24y$ conjecture."}
{"id": "2511.23255", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.23255", "abs": "https://arxiv.org/abs/2511.23255", "authors": ["Hidekazu Furusho", "David Jarossay"], "title": "$p$-adic multiple zeta values and binomial multiple harmonic sums", "comment": "11 pages", "summary": "We present a concise method for deriving an explicit formula for $p$-adic multiple zeta values. The formula features a variant of multiple harmonic sums, termed binomial multiple harmonic sums."}
{"id": "2511.23308", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.23308", "abs": "https://arxiv.org/abs/2511.23308", "authors": ["Jiaqi Wang", "Rong Ma"], "title": "On a kind of generilized multi-harmonic sums", "comment": "11 pages, no figures", "summary": "Let $p$ be an odd prime, Jianqiang Zhao has established a curious congruence, which is $$\n  \\sum_{i+j+k=p \\atop i,j,k > 0} \\frac{1}{ijk} \\equiv -2B_{p-3}\\pmod p , $$ where $B_{n}$ denotes the $n$-th Bernoulli number. In this paper, we will generalize this kind of sums and prove a family of similar congruences modulo prime powers $p^r$."}
{"id": "2511.23381", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.23381", "abs": "https://arxiv.org/abs/2511.23381", "authors": ["Sam Allen", "Tyler Genao"], "title": "Uniform bounds on the level of cyclotomic division fields of elliptic curves", "comment": "16 pages", "summary": "In this paper, we prove that for each number field $F$ there exists a uniform bound on the prime levels $p$ of elliptic curves $E/F$ for which $F(E[p])=F(ζ_p)$. Under the Generalized Riemann Hypothesis, we also give uniform bounds on $p$ for which $F(E[p])/F$ is abelian, provided that $F$ has no rational complex multiplication. These are generalizations of results of González-Jiménez and Lozano-Robledo to general number fields."}
{"id": "2511.23401", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.23401", "abs": "https://arxiv.org/abs/2511.23401", "authors": ["Elisa Bellah", "Claire Dunn", "Vernon Naidu", "Alette Wells"], "title": "Connectedness of special points in the Markoff mod $p$ graphs", "comment": "10 pages, 1 figure", "summary": "It is conjectured that the Markoff equation $X^2+Y^2+Z^2=3XYZ$ satisfies the special Diophantine property that every mod $p$ solution lifts to an integer solution. Progress toward this conjecture has been made by studying the connectedness of the graphs obtained from the action of the Vieta group on the nonzero mod $p$ solutions to the Markoff equation. In this paper, we use results on Pisano periods of the Fibonacci sequence to obtain explicit results on the connectedness of special points in this graph for primes $p$ where $p+1$ has large $2$-adic valuation. In particular, for Mersenne primes $p \\equiv \\pm 2 \\,(\\text{mod}\\, 5)$, we show that the special point $(1, 1, 1)$ which is fixed under reduction modulo $p$ lies in a component of this graph which is known to be connected."}
