{"id": "2509.23070", "categories": ["math.RT", "14J10, 17C55, 17C10"], "pdf": "https://arxiv.org/pdf/2509.23070", "abs": "https://arxiv.org/abs/2509.23070", "authors": ["Iryna Kashuba", "Vera Serganova"], "title": "Special modules over Jordan algebras", "comment": "23 pages", "summary": "In this paper we study special representations of finite-dimensional Jordan\nalgebra $J$ whose $Rad^2 J=0$. For each Jordan algebra $J$ of this class we\nconsider its Tits-Kantor-Koecher construction $TKK(J)$ and then associate to\nthe latter a quiver with relations $Q$ such that the category of\nrepresentations of $Q$ is isomorphic to the category of special representations\nof $J$."}
{"id": "2509.23349", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2509.23349", "abs": "https://arxiv.org/abs/2509.23349", "authors": ["Ram Karan Choudhary", "Sunil Kumar Prajapati"], "title": "A Combinatorial Technique for the Wedderburn Decomposition of Rational Group Algebras of Nested GVZ $p$-groups", "comment": null, "summary": "In this article, we present a combinatorial formula for the Wedderburn\ndecomposition of rational group algebras of nested GVZ $p$-groups, where $p$ is\nan odd prime. Using this formula, we derive an explicit combinatorial\nexpression for the Wedderburn decomposition of rational group algebras of all\ntwo-generator $p$-groups of class $2$. Additionally, we provide explicit\ncombinatorial formulas for the Wedderburn decomposition of rational group\nalgebras of certain families of nested GVZ $p$-groups with arbitrarily large\nnilpotency class. We also classify all nested GVZ $p$-groups of order at most\n$p^5$ and compute the Wedderburn decomposition of their rational group\nalgebras. Finally, we determine a complete set of primitive central idempotents\nfor the rational group algebras of nested GVZ $p$-groups."}
{"id": "2509.24184", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2509.24184", "abs": "https://arxiv.org/abs/2509.24184", "authors": ["Zhen Zhang"], "title": "A construction of simple-minded systems over domestic Brauer graph algebras", "comment": "38 pages, comments are welcome", "summary": "Let $A$ be a 2-domestic Brauer graph algebra. We present a construction for a\nfamily of objects on $A$-$\\stmod$ to be a simple-minded system and our\nconstruction provides all simple-minded systems on $A$-$\\stmod$. As a\nbyproduct, we provide a new proof of AR-conjecture for 2-domestic Brauer graph\nalgebras and we prove that a weakly simple-minded system with a finite\ncardinality is a simple-minded system on $A$-$\\stmod$. We also prove that an\northogonal system $\\mathcal{S}$ which contains at least one object for an\nEuclidean component extends to a simple-minded system on $A$-$\\stmod$ and its\nextension closure $\\mathcal{F}(\\mathcal{S})$ is functorially finite."}
{"id": "2509.24190", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2509.24190", "abs": "https://arxiv.org/abs/2509.24190", "authors": ["Zhi-qiang Lai", "Xue-ping Wang"], "title": "A characterization of a class of border continuous triangular conorms", "comment": "13", "summary": "Let $T^*:[0,1]^2\\rightarrow[0,1]$ be a continuous, non-decreasing and\nassociative function with neutral element, $f: [0,1]\\rightarrow [0,1]$ be a\nstrictly monotone function and $f^{(-1)}:[0,1]\\rightarrow[0,1]$ be the\npseudo-inverse of $f$. This article characterizes the function $T: [0,1]^2\n\\rightarrow [0,1]$ defined by $T(x,y)=f^{(-1)}(T^*(f(x),f(y)))$ when it is a\nborder continuous triangular conorm."}
{"id": "2509.22672", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.22672", "abs": "https://arxiv.org/abs/2509.22672", "authors": ["Madhavi Prakash"], "title": "Effective height bounds via Mordell Weil lattice symmetries", "comment": null, "summary": "We obtain explicit, computable upper bounds for the Neron-Tate height of\nrational points on curves of genus at least two over number fields. The bounds\nuse automorphisms acting on the Mordell-Weil lattice of the Jacobian. We prove\nan averaged spectral-gap criterion that replaces the 'large enough automorphism\ngroup' requirement of prior work. As a special case, when some automorphism\nacts trivially on V the method gives the sharper bound. In rank 2 we provide a\npractical Bravais-lattice test, using the height Gram matrix, to detect when\nthis situation occurs. We illustrate the method on a genus-2, rank-2 curve\nwhere the earlier large-automorphisms hypothesis does not apply."}
{"id": "2509.24292", "categories": ["math.RT", "20M30, 20M50"], "pdf": "https://arxiv.org/pdf/2509.24292", "abs": "https://arxiv.org/abs/2509.24292", "authors": ["Ali Madanshekaf Farideh Farsad"], "title": "Strongly Hopfian and Co-Hopfian Acts over Monoids: Structure and Characterizations", "comment": null, "summary": "In this paper, we introduce and explore new classes of S-acts over a monoid\nS, namely, strongly Hopfian and strongly co-Hopfian acts, as well as their\nweaker counterparts, Hopfian and co-Hopfian acts. We investigate the\nrelationships between these newly defined structures and well-studied classes\nof S-acts, including Noetherian, Artinian, injective, projective,\nquasi-injective, and quasi-projective acts. A key result shows that, under\ncertain conditions, a quasi-projective (respectively quasi-injective) S-act\nthat is strongly co-Hopfian (respectively strongly Hopfian) is also strongly\nHopfian (respectively strongly co-Hopfian). Moreover, we provide a variety of\nexamples and structural results concerning the behavior of subacts and quotient\nacts of strongly Hopfian and strongly co-Hopfian S-acts, further elucidating\nthe internal structure and interrelationships within this extended framework."}
{"id": "2509.22837", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2509.22837", "abs": "https://arxiv.org/abs/2509.22837", "authors": ["Andrew Phillips"], "title": "Special endomorphisms of QM abelian surfaces", "comment": "13 pages, comments welcome", "summary": "In this paper we generalize a theorem of Kudla-Rapoport-Yang which gives a\nformula for the arithmetic degree of the moduli space of CM elliptic curves\ntogether with a special endomorphism of a specified degree. Our extension is to\nthe moduli space of QM abelian surfaces with CM together with a special\nendomorphism of a specified QM degree."}
{"id": "2509.24346", "categories": ["math.RT", "Primary 22E47, Secondary 17B10, 17B08"], "pdf": "https://arxiv.org/pdf/2509.24346", "abs": "https://arxiv.org/abs/2509.24346", "authors": ["Zhanqiang Bai", "Fan Gao", "Yutong Wang", "Xun Xie"], "title": "Gelfand-Kirillov dimensions and annihilator varieties of highest weight modules of exceptional Lie algebras", "comment": "78pages", "summary": "In this paper, we give an efficient algorithm to compute the Gelfand-Kirillov\ndimensions of simple highest weight modules of exceptional Lie algebras. By\nusing the Sommers-Achar duality, we also determine the annihilator varieties of\nthese highest weight modules."}
{"id": "2509.22895", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.22895", "abs": "https://arxiv.org/abs/2509.22895", "authors": ["Michael Cerchia", "Rakvi"], "title": "Modular curves of prime-power level with infinitely many quadratic points", "comment": "26 pages. Comments welcome", "summary": "We completely determine the $1085$ open subgroups $H$ of\n$\\operatorname{GL}_2(\\widehat{\\mathbb{Z}})$ of prime-power level that satisfy\n$-I \\in H$ and $\\operatorname{det}(H)=\\widehat{\\mathbb{Z}}^{\\times}$ for which\nthe corresponding modular curve $X_H$ has infinitely many quadratic points.\nWhen $g(X_H)\\geq 2$ this is equivalent to determining all the hyperelliptic\nmodular curves of prime-power level and all the bielliptic modular curves of\nprime-power level that admit a degree two map to a positive rank elliptic\ncurve. From the moduli perspective, this means that there are exactly 1085\nsubgroups $H$ of $\\operatorname{GL}_2(\\widehat{\\mathbb{Z}})$ of prime-power\nlevel for which there are infinitely many elliptic curves $E/K$ over quadratic\nextensions such that $\\rho_E(G_k)$ is conjugate to a subgroup of $H$."}
{"id": "2509.24571", "categories": ["math.RT", "22E50 (Primary) 11F70 (Secondary)"], "pdf": "https://arxiv.org/pdf/2509.24571", "abs": "https://arxiv.org/abs/2509.24571", "authors": ["Wen-Wei Li"], "title": "Decomposed Levi subgroups in BD-covers of classical groups", "comment": "17 pages", "summary": "For finite topological central extensions of $p$-adic classical groups,\nHeiermann and Wu introduced the notion of decomposed Levi subgroups in their\nstudy of intertwining algebras. In this note, we show that for symplectic and\nspecial orthogonal groups over local fields, except the split $\\mathrm{SO}(4)$,\nall Levi subgroups are decomposed if the central extension arises from the\nBrylinski-Deligne construction. Discussions for certain unitary groups,\n$\\mathrm{SO}(4)$ and $\\mathrm{GSpin}(2n+1)$ are also given."}
{"id": "2509.22962", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2509.22962", "abs": "https://arxiv.org/abs/2509.22962", "authors": ["Sarah Peluse"], "title": "Finding arithmetic progressions in dense sets of integers", "comment": "26 pages, 1 figure; This is the article written to accompany my talk\n  in the 2025 JMM Current Events Bulletin", "summary": "One of the central problems in additive combinatorics is to determine how\nlarge a subset of the first $N$ integers can be before it is forced to contain\n$k$ elements forming an arithmetic progression. Around 25 years ago, Gowers\nproved the first reasonable upper bounds in this problem for progressions of\nlength four and longer. In this work, Gowers initiated the study of\n\"higher-order Fourier analysis\", which has developed over the past couple of\ndecades into a rich theory with numerous other combinatorial applications. I\nwill report on some very recent progress in higher-order Fourier analysis and\nhow it has led to the first ever quantitative improvement on Gowers's upper\nbounds when $k\\geq 5$."}
{"id": "2509.24574", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2509.24574", "abs": "https://arxiv.org/abs/2509.24574", "authors": ["Zhiqiang Li", "Shaobin Tan", "Qing Wang"], "title": "Whittaker modules over the loop Virasoro algebra", "comment": "24 pages", "summary": "In this paper, we first study two classes of Whittaker modules over the loop\nWitt algebra ${\\mathfrak g}:=\\mathcal{W}\\otimes\\mathcal{A}$, where\n$\\mathcal{W}=\\text{Der}({\\mathbb{C}}[t])$,\n$\\mathcal{A}={\\mathbb{C}}[t,t^{-1}]$. The necessary and sufficient conditions\nfor these Whittaker modules being simple are determined. Furthermore, we study\na family of Whittaker modules over the loop Virasoro algebra\n$\\mathfrak{L}:=Vir\\otimes\\mathcal{A}$, where $Vir$ is the Virasoro algebra. The\nirreducibility criterion for these Whittaker modules are obtained. As an\napplication, we give the irreducibility criterion for universal Whittaker\nmodules of the affine Lie algebra $\\widehat{\\mathfrak{sl}_{2}}$."}
{"id": "2509.23059", "categories": ["math.NT", "11K55, 28A80"], "pdf": "https://arxiv.org/pdf/2509.23059", "abs": "https://arxiv.org/abs/2509.23059", "authors": ["Xiaoyan Tan", "Zhenliang Zhang"], "title": "Convergence exponent of Dirichlet non-improvable numbers in the theory of continued fractions", "comment": null, "summary": "Let $x \\in [0,1)$ be an irrational number with continued fraction expansion\n$[a_1(x),a_2(x), \\cdots,a_n(x),\\cdots]$ and $q_n(x)$ be the denominator of its\n$n$-th convergent.\n  We establish, for any $\\alpha,\\beta$ in $[0,+\\infty]$, the Hausdorff\ndimension formula of the intersections of the sets of Dirichlet non-improvable\nnumbers and the level set of convergent exponent, i.e. $$ G(\\alpha,\\beta):\n=\\left\\{x\\in[0,1)\\colon \\tau(x)=\\alpha,\\,\\,\\text{and} \\,\\,\n\\limsup_{n\\to\\infty}\\frac{\\log (a_n(x)a_{n+1}(x))}{\\log\nq_n(x)}\\geq\\beta\\right\\}, $$ and $$ E(\\alpha,\\beta): =\\left\\{x\\in[0,1)\\colon\n\\tau(x)=\\alpha,\\,\\,\\text{and} \\,\\, \\limsup_{n\\to\\infty}\\frac{\\log\n(a_n(x)a_{n+1}(x))}{\\log q_n(x)}=\\beta\\right\\}, $$ where $$ \\tau(x):=\n\\inf\\Big\\{s \\geq 0: \\sum_{n \\geq 1} a^{-s}_n(x)<\\infty\\Big\\}. $$"}
{"id": "2509.24707", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2509.24707", "abs": "https://arxiv.org/abs/2509.24707", "authors": ["Christoffer Söderberg"], "title": "Mutating Species with Potentials and Cluster Tilting Objects", "comment": null, "summary": "Buan, Iyama, Reiten and Smith proved that cluster-tilting objects in\ntriangulated 2-Calabi--Yau categories are closely connected with mutation of\nquivers with potentials over an algebraically closed field. We prove a more\ngeneral statement where instead of working with quivers with potentials we\nconsider species with potential over a perfect field.\n  We describe the $3$-preprojective algebra of the tensor product of two tensor\nalgebras of acyclic species using a species with potential. In the case when\nthe Jacobian algebra of a species with potential is self-injective, we provide\na description of the Nakayama automorphism of a particular case of mutation of\nthe species with potential where you mutate along orbits of the Nakayama\npermutation, which preserves self-injectivity.\n  For certain types of Jacobian algebras of species with potentials, we prove\nthat they lie in the scope of the derived Auslander-Iyama correspondence due to\nJasso-Muro. Mutating along orbits of the Nakayama permutation stays within this\nsetting, yielding a rich source of examples. All $2$-representation finite\n$l$-homogeneous algebras that are constructed using certain species with\npotential and mutations of such species with potentials are considered."}
{"id": "2509.23151", "categories": ["math.NT", "Primary 05A20, 11N37, 11P82, Secondary 11B57, 11F20"], "pdf": "https://arxiv.org/pdf/2509.23151", "abs": "https://arxiv.org/abs/2509.23151", "authors": ["Archit Agarwal", "Meghali Garg", "Bibekananda Maji"], "title": "Rademacher-type exact formula and higher order Turán inequalities for cubic overpartitions", "comment": "38 pages, comments are welcome!", "summary": "In 1918, Hardy and Ramanujan made a breakthrough by developing the circle\nmethod to deduce an asymptotic formula for the partition function $p(n)$, which\nwas later refined by Rademacher in 1937 to produce an absolutely convergent\nseries representation for $p(n)$. Since then, Rademacher-type exact formulas\nfor various partition functions have been investigated by many mathematicians.\nThe concept of overpartitions was introduced by Lovejoy and Corteel in 2004.\nKim, in 2010, studied an overpartition analogue of cubic partitions, termed as\ncubic overpartitions. The main objective of this paper is to establish a\nRademacher-type exact formula for cubic overpartitions and, as an application,\nto derive an explicit error term that leads to their log-concavity.\nFurthermore, applying a result of Griffin, Ono, Rolen, and Zagier, we establish\nhigher-order Tur\\'{a}n inequalities for cubic overpartitions. In addition, we\nobtain log-subadditivity and generalized log-concavity properties for cubic\noverpartitions inspired by the work of Bessenrodt-Ono and DeSalvo-Pak on the\nordinary partition function."}
{"id": "2509.24795", "categories": ["math.RT", "20C20"], "pdf": "https://arxiv.org/pdf/2509.24795", "abs": "https://arxiv.org/abs/2509.24795", "authors": ["Conghui Li"], "title": "Stable equivalence of Morita type and quotient fusion system", "comment": null, "summary": "In this note, we prove that stable equivalences of Morita type between blocks\nof finite groups induce identification of certain quotient fusion systems under\nsone assumption. We also collect some related results for separable\nequivalences."}
{"id": "2509.23245", "categories": ["math.NT", "11T30, 11T23, 12E20"], "pdf": "https://arxiv.org/pdf/2509.23245", "abs": "https://arxiv.org/abs/2509.23245", "authors": ["Theodoulos Garefalakis", "Giorgos Kapetanakis"], "title": "Translates of completely normal elements and the Morgan-Mullen conjecture", "comment": null, "summary": "Denote by $\\mathbb F_q$ the finite field of order $q$ and by $\\mathbb\nF_{q^n}$ its extension of degree $n$. Some $a\\in\\mathbb F_{q^n}$ is called\nprimitive if it generates the multiplicative group $\\mathbb F_{q^n}^*$ and it\nis called $q^n/q$-normal if its $\\mathbb F_q$-conjugates form an $\\mathbb\nF_q$-basis of $\\mathbb F_{q^n}$ if the latter is viewed as an $\\mathbb\nF_q$-vector space. Furthermore, some $a\\in\\mathbb F_{q^n}$ is called\n$q^n/q$-completely normal if it is $q^n/q^d$-normal for all $d\\mid n$. In this\nwork we prove a new construction of sets of completely normal elements and, we\nestablish, under conditions, the existence of elements that are simultaneously\nprimitive and $q^n/q$-completely normal, covering some yet unresolved cases of\na 30-year-old conjecture by Morgan and Mullen."}
{"id": "2509.25012", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2509.25012", "abs": "https://arxiv.org/abs/2509.25012", "authors": ["Benjamin Dequêne", "Sunny Roy"], "title": "Exact structures and maximal canonically Jordan recoverable subcategories for modules over type $A$ algebras", "comment": null, "summary": "On one hand, exact structures were introduced by D. Quillen in the '70s. They\ncan be defined as collections of short exact sequences in a fixed abelian\ncategory satisfying additional properties.\n  On the other hand, in a recent work, A. Garver, R. Patrias, and H. Thomas\nintroduced Jordan recoverability. Given a bounded quiver $(Q,R)$, a full\nadditive subcategory of $\\operatorname{rep}(Q,R)$ is said to be Jordan\nrecoverable if any $X \\in \\mathscr{C}$ can be recovered, up to isomorphism,\nfrom the Jordan form of its generic nilpotent endomorphisms. Such a subcategory\n$\\mathscr{C}$ is said to be canonically Jordan recoverable if, moreover, there\nexists a precise algebraic procedure that allows one to get back $X \\in\n\\mathscr{C}$ from that same Jordan form data.\n  We introduce a new family of operators, called Gen-Sub operators\n$\\operatorname{GS}_\\mathcal{E}$, parametrized by the exact structures\n$\\mathcal{E}$ of abelian categories. After showing some properties of those\noperators in hereditary abelian categories, by focusing on the setting of\nmodules over type $A$ quivers endowed with the diamond exact structure\n$\\mathcal{E}_\\diamond$, we establish that the maximal canonically Jordan\nrecoverable subcategories are precisely of the form\n$\\operatorname{GS}_{\\mathcal{E}_\\diamond}(T)$ for some tilting object $T$."}
{"id": "2509.23260", "categories": ["math.NT", "11L07 (Primary) 11M26, 11N25, 11P55 (Secondary)"], "pdf": "https://arxiv.org/pdf/2509.23260", "abs": "https://arxiv.org/abs/2509.23260", "authors": ["Olivier Ramare", "GK Viswanadham"], "title": "The trigonometric polynomial on sums of two squares, an additive problem and generalisation", "comment": "Transactions of AMS (2025)", "summary": "Let $B$ be the set of odd integers that are sums of two coprime squares. We\nprove that the trigonometric polynomial $S(\\alpha;N)=\\sum_{b\\in B,b\\leq N}\ne(b\\alpha)$ satisfies \\[ \\frac{S(\\alpha; N)}{N/\\sqrt{\\log N}}<<_{A,A'}\n\\frac{1}{\\phi(q)} + \\sqrt{\\frac{q}{N}}(\\log N)^{7} +\\frac{1}{(\\log N)^A} \\] for\nany $A,A'\\geq 0$ and when $(a,q)=1$ and $|q\\alpha-a|\\leq (\\log N)^{A'}/N$. We\nuse this estimate together with a variant of the circle method influenced by\nGreen and Tao's Transference Principle to obtain the number of representations\nof a large enough odd integer $N$ as a sum $b+b_1+b_2$, where $b\\in B$ while\n$b_1$ (resp. $b_2$) belongs to a general subset $B_1$ (resp. $B_2$) of $B$ of\nrelative positive density. We further show that the above bound is effective\nwhen $0\\leq A<1/2$."}
{"id": "2509.25156", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2509.25156", "abs": "https://arxiv.org/abs/2509.25156", "authors": ["Pablo Boixeda Alvarez", "Calder Morton-Ferguson"], "title": "Weight modules and gluing of sheaves on the flag variety", "comment": "39 pages, 4 figures", "summary": "We study a natural enlargement of the BGG Category O for a semisimple Lie\nalgebra: the category of weight modules with trivial central character and\nfinite-dimensional weight spaces supported on the root lattice. We give a\ngeometric realization of this category as unipotently monodromic sheaves on the\nflag variety satisfying a singular support condition. We then explain that a\nderived version $\\mathcal{D}$ of this category is Koszul dual to the\nKazhdan-Laumon Category O, a different enlargement of the BGG Category O\nobtained from a gluing construction for sheaves on the flag variety. This\ncharacterizes $\\mathcal{D}$ as the category of algebras over a natural monad on\na direct sum of copies of the derived Category O. These results give new\ninterpretations of certain classical algebraic constructions of weight modules\nover semisimple Lie algebras due to Fernando and Mathieu. We also conjecture\nthat our results fit naturally into a proposed Koszul duality relating the\nsmall quantum group and the semi-infinite flag variety to the geometry of\naffine Springer fibers."}
{"id": "2509.23283", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2509.23283", "abs": "https://arxiv.org/abs/2509.23283", "authors": ["Enrique González-Jiménez", "Joan-C. Lario"], "title": "Faltings elliptic curves in twisted $\\mathbb Q$-isogeny classes", "comment": "Supplementary material in GitHub repository", "summary": "Let $G$ be the graph attached to the $\\mathbb Q$-isogeny class of an elliptic\ncurve defined over $\\mathbb Q$: that is, a vertex for every elliptic curve\ndefined over $\\mathbb Q$ in the isogeny class, and edges in correspondence with\nthe prime degree rational isogenies between them. Stevens shows that there is a\nunique elliptic curve in $G$ with minimal Faltings height. We call this curve\nthe Faltings elliptic curve in $G$.\n  For every square-free integer $d$, we consider the graph~$G^d$ attached to\nthe twisted elliptic curves in $G$ by the quadratic character of $\\mathbb\nQ(\\sqrt{d})$. It turns out that $G$ and $G^d$ are canonically isomorphic as\nabstract graphs (the isomorphism identifies the vertices with equal\n$j$-invariant). In this paper we determine which vertex is the Faltings\nelliptic curve in $G^d$. We also obtain the probability of a vertex in $G$ to\nbe the Faltings elliptic curve in~$G^d$. It turns out that this probability\ndepends on the $p$-adic valuations of rational values of certain modular\nfunctions."}
{"id": "2509.23320", "categories": ["math.NT", "math.DS", "14G05, 37A17, 11N35"], "pdf": "https://arxiv.org/pdf/2509.23320", "abs": "https://arxiv.org/abs/2509.23320", "authors": ["Yang Cao", "Zhizhong Huang", "Runlin Zhang"], "title": "Effective equidistribution, arithmetic purity of strong approximation, and geometric sieve for affine quadrics", "comment": null, "summary": "Let $k$ be a number field. Let $q(x_1,\\cdots,x_n)$ be a non-degenerate\nintegral quadratic form in $n\\geq 3$ variables with coefficients in $k$ and\n$m\\in k^\\times$. Let $X$ be the affine quadric defined by $q=m$ in\n$\\mathbb{A}^n_k$. Based on results on effective equidistribution of\n$S$-integral points in symmetric spaces, we establish the following:\n  (i) The arithmetic purity of strong approximation off any single place of $k$\nfor $X$;\n  (ii) The geometric sieve for $p_0$-integral points on $X$ when $k=\\mathbb{Q}$\nand $p_0$ is a prime number."}
{"id": "2509.23540", "categories": ["math.NT", "11D41, 11D61, 11G30, 11G20, 11F80"], "pdf": "https://arxiv.org/pdf/2509.23540", "abs": "https://arxiv.org/abs/2509.23540", "authors": ["Imin Chen", "Lucas Villagra Torcomian"], "title": "A note on conductors of Frey representations at $2$", "comment": "13 pages", "summary": "In 2000, Darmon introduced the notion of Frey representations within the\nframework of the modular method for studying the generalized Fermat equation. A\ncentral step in this program is the computation of their conductors, with the\ncase at the prime $2$ presenting particular challenges. In this article we\nstudy the conductor exponent at $2$ for Frey representations of signatures\n$(p,p,r)$, $(r,r,p)$, $(2,r,p)$, and $(3,5,p)$, all of which have hyperelliptic\nrealizations. In particular we are able to determine the conductor at $2$ for\neven degree Frey representations of signature $(p,p,r)$ and $(3,5,p)$ and all\nrational parameters."}
{"id": "2509.23696", "categories": ["math.NT", "math.MG", "math.OC", "11H50 (Primary) 11Y16, 15A23, 90C20 (Secondary)"], "pdf": "https://arxiv.org/pdf/2509.23696", "abs": "https://arxiv.org/abs/2509.23696", "authors": ["Alexander Oertel", "Achill Schürmann"], "title": "On Computing the Copositive Minimum and its Representatives", "comment": "19 pages, 2 figures", "summary": "Computing the copositive minimum of a strictly copositive quadratic form is a\nnatural generalization of computing the arithmetical minimum of a positive\ndefinite one. In this paper we show that this generalized problem is\nNP-complete. Moreover, we describe a practical method to calculate all shortest\nvectors using the LDLT-decomposition in a big class of special cases. Our\nnumerical tests show that our method performs significantly better than\nprevious approaches."}
{"id": "2509.23857", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.23857", "abs": "https://arxiv.org/abs/2509.23857", "authors": ["Simona Fryšová", "Magdaléna Tinková"], "title": "Additively indecomposable quadratic forms over biquadratic and simplest cubic fields", "comment": null, "summary": "In this paper, we study additively indecomposable quadratic forms over real\nbiquadratic and simplest cubic fields. In particular, we show that over these\nfields, we can always find such a classical form in 2 variables, which differs\nfrom the situation for forms over integers. Moreover, for some cases, we derive\na lower bound on the number of classical, additively indecomposable binary\nquadratic forms up to equivalence."}
{"id": "2509.23940", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.23940", "abs": "https://arxiv.org/abs/2509.23940", "authors": ["Shih-Yu Chen"], "title": "Algebraicity of adjoint $L$-functions for quasi-split groups", "comment": null, "summary": "For a globally generic cuspidal automorphic representation $\\mathit{\\Pi}$ of\na quasi-split reductive group $G$ over $\\mathbb Q$, E. Lapid and Z. Mao\nproposed a conjecture on the decomposition of the global Whittaker functionals\non $\\mathit{\\Pi}$ into products of an adjoint $L$-value of $\\mathit{\\Pi}$ and\nthe local Whittaker functionals. In this paper, we consider the algebraic\naspect of the Lapid-Mao conjecture. More precisely, when $\\mathit{\\Pi}$ is\n$C$-algebraic, we show that the algebraicity of the adjoint $L$-value can be\nexpressed in terms of the Petersson norm of Whittaker-rational cusp forms in\n$\\mathit{\\Pi}$, subject to the validity of the Lapid-Mao conjecture. For\nunitary similitude groups, we also establish an unconditional and more refined\nalgebraicity result. Additionally, we give an explicit formula for the case\n$G={\\rm U}(2,1)$."}
{"id": "2509.24057", "categories": ["math.NT", "11B39, 11D61, 11D45, 11J86"], "pdf": "https://arxiv.org/pdf/2509.24057", "abs": "https://arxiv.org/abs/2509.24057", "authors": ["Alex Behakanira Tumwesigye", "Mahadi Ddamulira", "Prosper Kaggwa"], "title": "On concatenations of two $k$-generalized Lucas numbers", "comment": "15 pages", "summary": "For an integer \\( k \\geq 2 \\), the sequence of \\( k \\)-generalized Lucas\nnumbers is defined by the recurrence relation \\( L_n^{(k)} = L_{n-1}^{(k)} +\n\\cdots + L_{n-k}^{(k)} \\) for all \\( n \\geq 2 \\), with initial conditions \\(\nL_0^{(k)} = 2 \\), \\( L_1^{(k)} = 1 \\) for all \\( k \\geq 2 \\), and \\(\nL_{2-k}^{(k)} = \\cdots = L_{-1}^{(k)} = 0 \\) for \\( k \\geq 3 \\). In this paper,\nwe determine all \\( k \\)-generalized Lucas numbers that are concatenations of\ntwo terms of the same sequence and completely solve this problem for \\( k \\geq\n3 \\). Our approach combines nonzero lower bounds for linear forms in\nlogarithms, reduction techniques based on the Baker--Davenport method and the\nLLL-algorithm, together with continued fraction analysis and computational\nverification using SageMath."}
{"id": "2509.24119", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.24119", "abs": "https://arxiv.org/abs/2509.24119", "authors": ["Kimball Martin"], "title": "Rationality fields of CM modular forms", "comment": "17 pages", "summary": "We formulate a conjecture on the finitude of rationality fields (i.e.,\nFourier coefficient fields) of newforms of bounded degree, and prove this for\nCM forms assuming a generalized Riemann hypothesis. Then we explicitly\ndetermine what quadratic and cubic rationality fields occur for weight 2 CM\nforms, which is related to classifications of CM abelian varieties of GL(2)\ntype. Several of these fields do not appear in the existing tables of newforms\nin the LMFDB."}
{"id": "2509.24152", "categories": ["math.NT", "11F30, 11P55"], "pdf": "https://arxiv.org/pdf/2509.24152", "abs": "https://arxiv.org/abs/2509.24152", "authors": ["Jiseong Kim"], "title": "On Averages of Shifted Convolutions with Applications to $GL(2)$ and $GL(3)$ Fourier Coefficients", "comment": "7 pages", "summary": "In this paper, we study the average of shifted sum for general multiplicative\nfunctions. As applications, we prove non-trivial upper bounds for weighted\naverages of shifted convolutions involving $GL(2)$ and $GL(3)$ Fourier\ncoefficients without smoothing. We apply square-root cancellation on average\nover short intervals for $GL(2)$ Fourier coefficients with the standard\nHardy-Littlewood circle method."}
{"id": "2509.24324", "categories": ["math.NT", "05A17 (Primary), 11P83 (Secondary)"], "pdf": "https://arxiv.org/pdf/2509.24324", "abs": "https://arxiv.org/abs/2509.24324", "authors": ["M. P. Thejitha", "S. N. Fathima"], "title": "Arithmetic Properties of Partitions with 1 colored Even Parts and r colored Odd Parts", "comment": "15 pages", "summary": "Recently, Hirschhorn and Sellers defined the partition function a_r(n), which\ncounts the number of partitions of n wherein even parts come in only one color,\nwhile the odd parts may appear in one of r-colors for fixed r greater than or\nequal to 1. In this paper, we employ an identity of Newman to derive infinite\nfamilies of congruences modulo 5 for a_3(n), and use arithmetic theory of\nmodular forms to prove congruences modulo 3 and modulo 5 for a_5(n)."}
{"id": "2509.24363", "categories": ["math.NT", "11G40 11G50 14G10 14G35 14G40"], "pdf": "https://arxiv.org/pdf/2509.24363", "abs": "https://arxiv.org/abs/2509.24363", "authors": ["Ziqi Guo"], "title": "Modular Heights of Unitary Shimura Varieties", "comment": null, "summary": "The goal of this paper is to prove a formula expressing the modular height of\na unitary Shimura variety over a CM number field in terms of the logarithm\nderivative of the Hecke L-function associated with the CM extension. In a more\nspecific term, we will introduce a global canonical integral model of such a\nunitary Shimura variety, and compute the arithmetic top self-intersection\nnumber of a canonical arithmetic line bundle with Hermitian metric on such\nintegral model. At the same time, we also delve into a thorough investigation\nof the arithmetic generating series of divisors on unitary Shimura varieties.\nTherefore, we will also obtain the so-called ``arithmetic Siegel-Weil formula''\nin our setting."}
{"id": "2509.24456", "categories": ["math.NT", "11N37"], "pdf": "https://arxiv.org/pdf/2509.24456", "abs": "https://arxiv.org/abs/2509.24456", "authors": ["Giovanni Coppola"], "title": "Good Ramanujan Expansions: A suitably enhanced decay of coefficients has important consequences", "comment": "We introduce the Good Ramanujan Expansions: with good decay for\n  coefficients, studying the consequences", "summary": "In this self-contained short note, we introduce the new definition of Good\nRamanujan Expansion, say G.R.E., for a fixed arithmetic function $F$, building\nupon a good decay of its coefficients $G$; this, gains $\\log-$powers w.r.t. the\ntrivial bound for $G$ and precisely $\\log^{1+\\eta}$, where the present\nparameter $\\eta>0$ is real. This property alone has important consequences for\nall the $F$ having a G.R.E. : mainly, 1) the Eratosthenes Transform $F'$ of our\n$F$ is infinitesimal (see in Theorem 1); 2) when $\\eta>1$ (an enhanced decay)\nwe have uniqueness of $G$ (actually, these are the classic Wintner-Carmichael\ncoefficients, see Th.2); 3) we get a bound for $F$ (in Th.3); 4) an important\nnew class of arithmetic functions $F$ can't have a G.R.E. (see Th.4). These are\na generalization of Correlations; which in this way, if are, say, a kind of\n\"far from constants\", may not have a G.R.E., whence, a fortiori, can't have the\nR.E.E.F. This is the Ramanujan Exact Explicit Formula, that we introduced with\nProf. Ram Murty."}
{"id": "2509.24604", "categories": ["math.NT", "math.AG", "11G30, 11D41, 14G05, 11Y50, 11-04, 11G10, 14G25, 14H25, 14H40, 14Q05"], "pdf": "https://arxiv.org/pdf/2509.24604", "abs": "https://arxiv.org/abs/2509.24604", "authors": ["Michael Stoll"], "title": "Determining the rational points on a curve of genus 2 and Mordell-Weil rank 1", "comment": "19 pages", "summary": "We explain how one can efficiently determine the (finite) set of rational\npoints on a curve of genus 2 over $\\mathbb Q$ with Jacobian variety $J$, given\na point $P \\in J(\\mathbb Q)$ generating a subgroup of finite index in\n$J(\\mathbb Q)$."}
{"id": "2509.24609", "categories": ["math.NT", "11J81, 11J61, 11D88"], "pdf": "https://arxiv.org/pdf/2509.24609", "abs": "https://arxiv.org/abs/2509.24609", "authors": ["Shanwen Wang", "Yijun Yuan"], "title": "On the $p$-adic transcendence of $\\sum_{k=1}^\\infty p^{-1/p^k}$", "comment": "10 pages", "summary": "Let $p$ be a prime number. In this article, we prove that the $p$-adic Hahn\nseries $\\sum_{k=1}^\\infty p^{-1/p^k}$, which is the mixed-characteristic\nanalogue of Abhyankar's solution $\\sum_{k=1}^\\infty t^{-1/p^k}$ to the\nArtin-Schreier equation $X^p-X-t^{-1}=0$ over\n$\\mathbf{F}_p\\left(\\!\\left(t\\right)\\!\\right)$, is a $p$-adic complex number,\nbut not a $p$-adic algebraic number. Based on this result, we formulate a\nconjecture about the possible order type of the support of an algebraic\n$p$-adic Hahn series and prove that it is implied by a tentative observation of\nKedlaya."}
{"id": "2509.24690", "categories": ["math.NT", "11M06, 11F72"], "pdf": "https://arxiv.org/pdf/2509.24690", "abs": "https://arxiv.org/abs/2509.24690", "authors": ["Peng Gao", "Xiaosheng Wu", "Liangyi Zhao"], "title": "The mollified fourth moment of Dirichlet $L$-functions", "comment": "41pages, comments are welcome", "summary": "We evaluate the mollified four moment on the critical line of the family of\nDirichlet $L$-functions to a fixed general modulus, obtaining an asymptotic\nformula with a power saving error term."}
{"id": "2509.24874", "categories": ["math.NT", "11F30, 11M41 (Primary), 53C22 (Secondary)"], "pdf": "https://arxiv.org/pdf/2509.24874", "abs": "https://arxiv.org/abs/2509.24874", "authors": ["Maximiliano Sanchez Garza"], "title": "The Geodesic Restriction Problem for Arithmetic Spherical Harmonics", "comment": "32 pages, 2 figures", "summary": "Given a Riemannian manifold $M$ and an $L^2$-normalized Laplacian\neigenfunction $\\psi$ on $M$ with eigenvalue $\\lambda^2$, a general problem in\nanalysis is to understand how the mass of $\\psi$ distributes around $M$. There\nare different ways to attack this problem. One of them is to analyze the\n$L^p$-norm of $\\psi$ restricted to a submanifold of $M$. Here, we concentrate\non the case $M=S^2$, $p=2$, and we restrict to geodesics of the sphere. Burq,\nG\\'erard, and Tzvetkov showed, for $\\gamma$ a geodesic of $S^2$ (and indeed for\nmore general surfaces), that $||\\psi|_{\\gamma}||_{L^2} \\ll \\lambda^{1/4}$ and\nthat this bound is optimal in general. In this paper, we specialize to the case\nin which $\\psi$ is an eigenfunction of all the Hecke operators on the sphere\nand consider the set of geodesics $\\mathcal{C}_{D}$ of $S^2$ associated to\nfundamental discriminants $D<0$. By combining approaches of Ali and Magee, we\nimprove the previous upper bound to $||\\psi|_{\\mathcal{C}_{D}}||_{L^2}\n\\ll_{D,\\varepsilon} \\lambda^{\\varepsilon}$ for any $\\varepsilon>0$, which is\nessentially sharp."}
{"id": "2509.24918", "categories": ["math.NT", "cs.DM", "11B37 (Primary) 26A18, 39B22, 39-08, 41A60, 65Q20 (Secondary)"], "pdf": "https://arxiv.org/pdf/2509.24918", "abs": "https://arxiv.org/abs/2509.24918", "authors": ["Steven Finch"], "title": "Exercises in Iterational Asymptotics IV", "comment": "10 pages, 2 figures", "summary": "Abel's functional equation for $2^{x/2}$ and half-iterates of $\\lambda x\n(1-x)$ & $\\sqrt{1+x}$ are featured in this collection of exercises ($0 <\n\\lambda \\neq 1 < 2$)."}
{"id": "2509.24937", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.24937", "abs": "https://arxiv.org/abs/2509.24937", "authors": ["Peter Koymans", "Adam Morgan"], "title": "Constructing Jacobians of rank 1", "comment": null, "summary": "Let $K$ be a number field, let $g \\geq 1$ be an integer and let $f(x) = (x -\na_1) \\cdots (x - a_{2g + 1}) \\in O_K[x]$ be a polynomial that splits into $2g +\n1$ distinct linear factors. Write $C$ for the hyperelliptic curve given by $C:\ny^2 = f(x)$ and write $J = \\mathrm{Jac}(C)$ for its Jacobian. Under mild\ntechnical assumptions on $f$ that are satisfied almost always, we prove that\nthere exists some $d \\in K^\\times$ such that the quadratic twist $J^d$ has rank\nexactly equal to $1$. As a consequence, we deduce that for any positive integer\n$g$, there exists an absolutely simple abelian variety over $K$ with dimension\nequal to $g$ and rank equal to $1$."}
{"id": "2509.24971", "categories": ["math.NT", "math.CA", "math.CO", "11D68, 11B05, 11B13, 40A05"], "pdf": "https://arxiv.org/pdf/2509.24971", "abs": "https://arxiv.org/abs/2509.24971", "authors": ["Wouter van Doorn", "Vjekoslav Kovač"], "title": "Lacunary sequences whose reciprocal sums represent all rationals in an interval", "comment": "16 pages, 2 figures", "summary": "Answering a question of Michael Bleicher and Paul Erd\\H{o}s, we show that\nthere exists a lacunary sequence of positive integers such that finite sums of\nreciprocals of its terms attain all rational numbers from a non-empty open\ninterval. We also study several stronger variants of their original problem:\ndetermining the value of the optimal lacunarity parameter, representing\nrationals infinitely many times, finding such lacunary sequences with\narbitrarily large jumps, and relating the maximal length of a filled interval\nto a prescribed lacunarity parameter."}
{"id": "2509.25025", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2509.25025", "abs": "https://arxiv.org/abs/2509.25025", "authors": ["Yuchen Ding", "Huixi Li", "Zihan Zhang"], "title": "A modular version of the Brunn-Minkowski inequality and its applications", "comment": "comments are welcome", "summary": "Let $\\alpha>1$ be an irrational number and $k\\ge 2$ a positive integer. Let\n$f(x)$ be a polynomial with positive integer coefficients. Solving a 2001\nproblem of S\\'ark\\\"ozy on special sequences, Hegyv\\'ari proved in 2003 that\nthere exists an infinite sequence $A$ with density\n$\\frac{1}{k}-\\frac{1}{k\\alpha}$ such that $$ \\big\\{f(a_1)+\\ldots+f(a_k): a_i\\in\nA, 1\\le i\\le k\\big\\}\\cap \\big\\{\\lfloor n\\alpha\\rfloor: n\\in\n\\mathbb{N}\\big\\}=\\emptyset. $$ Hegyv\\'ari also proved that the density given by\nhim is optimal for $k=2$. In this article, we show that the density\n$\\frac{1}{k}-\\frac{1}{k\\alpha}$ given by Hegyv\\'ari is actually optimal for all\n$k\\ge 2$. The proof will follow from a modular version of the Brunn-Minkowski\ninequality established here."}
{"id": "2509.25038", "categories": ["math.NT", "math.CO", "Primary 11B37, 11A07, 37C25, Secondary 05A17, 13F35, 11R18"], "pdf": "https://arxiv.org/pdf/2509.25038", "abs": "https://arxiv.org/abs/2509.25038", "authors": ["Hartosh Singh Bal"], "title": "Dold-Gauss Congruences, Norm Descent, and Rational Rigidity", "comment": null, "summary": "We develop a Witt--Hadamard calculus for Euler products that unifies the\nclassical Gauss congruences with their modern refinement, the Dold congruences.\nWithin this framework we prove \\emph{norm descent}: Dold congruences are\nfunctorial under finite extensions and preserved by prime--ideal norms\n$N_{K/\\mathbb{Q}}$, yielding integer ghosts from algebraic ones. We extend the\ntheory from $\\mathbb{Z}$ to Dedekind domains, and show that integrality is\nstable under both Hadamard and Witt products. Two rigidity theorems lie at the\ncore: a \\emph{cyclotomic residues theorem}, asserting that if the logarithmic\nderivative has only cyclotomic poles then integrality forces rationality; and a\nstronger \\emph{Dold$^{+}$ rigidity theorem}, showing that any algebraic series\nsatisfying refined Dold congruences is necessarily rational. These results\nsharpen the Gauss--Dold picture: ordinary congruences enforce integrality,\nwhile the strengthened form collapses algebraic cases to rational ones.\nApplications include prime--ideal ladders in number fields and exact product\nlaws for dynamical zeta functions, illustrated for subshifts of finite type and\ncircle doubling."}
