{"id": "2511.05857", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.05857", "abs": "https://arxiv.org/abs/2511.05857", "authors": ["Alexander E. Patkowski"], "title": "On an spt function for the $4$-th symmetrized crank function", "comment": null, "summary": "In this paper we find the smallest part function related to the $4$-th symmetrized crank function, corresponding to the one obtained in Patkowski [11] for the $4$-th symmetrized rank function. This provides us with a direct relationship with Garvan's second order smallest part function. We obtain some congruences for these $spt$ functions, as well as asymptotics and inequalities. A finite $q$-series which generates an $spt$ function related to the second crank moment is also stated. This identity has an important relationship to the one obtained by Patkowski [12] related to the second rank moment."}
{"id": "2511.06534", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.06534", "abs": "https://arxiv.org/abs/2511.06534", "authors": ["Sinnou David", "Noriko Hirata-Kohno", "Makoto Kawashima"], "title": "Linear independence of values of hypergeometric functions and arithmetic Gevrey series", "comment": "55 pages", "summary": "We prove new linear independence results for the values of generalized hypergeometric functions ${}_pF_q$ at several distinct algebraic points, over arbitrary algebraic number fields. Our approach combines constructions of type II Padé approximants with a novel non-vanishing argument for generalized Wronskians of Hermite type. The method applies uniformly across all parameter regimes. Even for $p = q+1$, we extend known results from single-point to multi-point settings over general number fields, in the both complex and $p$-adic settings. When $p < q+1$, we establish linear independence results over arbitrary number fields; and for $p > q+1$, we confirm that the values do not satisfy global linear relations in the $p$-adic setting. Our results generalize and strengthen earlier work by Chudnovsky's, Nesterenko, Sorokin, Delaygue and others, and demonstrate the flexibility of our Padé construction for families of contiguous hypergeometric values."}
{"id": "2511.06584", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2511.06584", "abs": "https://arxiv.org/abs/2511.06584", "authors": ["Siddharth Ramakrishnan Cherukara"], "title": "Atkin-Lehner Decompositions for Quaternionic modular forms", "comment": null, "summary": "In this paper, we obtain Atkin--Lehner decompositions for spaces of modular forms on definite quaternion algebras. Similar to Casselman's approach our methods are representation theoretic. Using Jacquet--Langlands correspondence we also obtain isomorphisms between spaces of quaternionic modular forms and corresponding spaces of Hilbert modular forms."}
{"id": "2511.06654", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.06654", "abs": "https://arxiv.org/abs/2511.06654", "authors": ["Fangu Chen"], "title": "Infinitely many supersingular primes for some Mumford's abelian fourfolds", "comment": null, "summary": "Elkies proved the infinitude of supersingular primes for elliptic curves over real number fields. We generalize Elkies' result to some abelian fourfolds in Mumford's families, and more generally, to certain families of Kuga-Satake abelian varieties. The proof relies on the study of local deformation spaces at closed points of the integral model of a Hodge-type Shimura variety, based on the work of Madapusi, and on the analysis of real points of a Shimura curve, based on the work of Shimura."}
{"id": "2511.06725", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.06725", "abs": "https://arxiv.org/abs/2511.06725", "authors": ["Ryoji Shimizu", "Naganori Yamaguchi"], "title": "Étale Fundamental Groups of Smooth Arithmetic Surfaces and the Grothendieck Conjecture", "comment": "27 pages, zero pictures", "summary": "We study the structure of the étale fundamental groups of smooth curves over certain arithmetic schemes, and investigate the relative version of Grothendieck's anabelian conjecture in this setting. Consequently, every hyperbolic curve over the ring of S-integers of a number field in which a rational prime is inverted is anabelian, i.e., its schematic structure is completely determined by its étale fundamental group. Moreover, we obtain a partial result toward the semi-absolute version of Grothendieck's anabelian conjecture in this context."}
{"id": "2511.06969", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.06969", "abs": "https://arxiv.org/abs/2511.06969", "authors": ["Nilanjan Bag", "Dwaipayan Mazumder"], "title": "Moment of double exponential sums", "comment": "7 Pages, Comments are welcome", "summary": "This paper is devoted to finding moments of double exponential sums with monomials over arbitrary sets and intervals in finite fields. The study of such sums dates back to the work of Heath-Brown, who studied such sums in a work on least square-free numbers in an arithmetic progression."}
{"id": "2511.07060", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2511.07060", "abs": "https://arxiv.org/abs/2511.07060", "authors": ["Lorenzo Andreaus"], "title": "Counting rational points on smooth quartic and quintic surfaces", "comment": "7 pages. All comments are welcome!", "summary": "Let $X$ be a smooth projective surface of degree $d\\ge 4$ defined over a number field $K$, and let $N_{X^{\\prime}}(B)$ be the number of rational points of $X$ of height at most $B$ that do not lie on lines contained in $X$. Assuming a suitable hypothesis on the size of the rank of abelian varieties, we show that $N_{X^{\\prime}}(B)\\ll_X B^{4/3+\\varepsilon}$ for any fixed $\\varepsilon>0$. This improves an unconditional and uniform bound from Salberger for $d=4$ and $d=5$. The proof, based on an argument of Heath-Brown, consists of cutting $X$ by projective planes and using a uniform version of Faltings's Theorem due to Dimitrov, Gao, and Habegger, to bound the number of rational points on the plane sections of $X$."}
{"id": "2511.07100", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07100", "abs": "https://arxiv.org/abs/2511.07100", "authors": ["Ramūnas Garunkštis", "Jokūbas Putrius"], "title": "Selberg Zeta Functions Have Second Moment At $σ= 1$", "comment": "12 pages, 0 figures", "summary": "In this paper, we demonstrate the existence of the second moment of the Selberg zeta function for a Fuchsian group of the first kind at $σ= 1$. The prime geodesic theorem plays a crucial role in this context. The proof extends to Beurling zeta-functions satisfying a weak form of the Riemann hypothesis and to general Dirichlet series with positive coefficients, the partial sums of which are well-behaved. Note that by employing the recent approach of Broucke and Hilberdink in proving the second moment theorem, we can circumvent the separation condition introduced by Landau for general Dirichlet series."}
{"id": "2511.07121", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07121", "abs": "https://arxiv.org/abs/2511.07121", "authors": ["Zhen Guo", "Jinjiang Li", "Linji Long", "Min Zhang"], "title": "On the mean square of the error term for the asymmetric two-dimensional divisor problem with congruence conditions", "comment": "15 pages", "summary": "Suppose that $a$ and $b$ are positive integers subject to $(a,b)=1$. For $n\\in\\mathbb{Z}^+$, denote by $τ_{a,b}(n;\\ell_1,M_1,l_2,M_2)$ the asymmetric two--dimensional divisor function with congruence conditions, i.e., \\begin{equation*} τ_{a,b}(n;\\ell_1,M_1,l_2,M_2)=\\sum_{\\substack{n=n_1^an_2^b\\\\ n_1\\equiv\\ell_1\\!\\!\\!\\!\\!\\pmod{M_1}\\\\ n_2\\equiv\\ell_2\\!\\!\\!\\!\\!\\pmod{M_2}}}1. \\end{equation*} In this paper, we shall establish an asymptotic formula of the mean square of the error term of the sum $\\sum_{n\\leqslant M_1^aM_2^bx}τ_{a,b}(n;\\ell_1,M_1,l_2,M_2)$. This result constitutes an enhancement upon the previous result of Zhai and Cao [16]."}
{"id": "2511.07131", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07131", "abs": "https://arxiv.org/abs/2511.07131", "authors": ["Beyza Mevlüde Amir", "Mohammad Sadek", "Nermine El-Sissi"], "title": "Families of twists of tuples of hyperelliptic curves", "comment": null, "summary": "Let $f \\in \\mathbb Q[x]$ be a square-free polynomial of degree at least $3$, $m_i$, $i=1,2,3$, odd positive integers, and $a_i$, $i=1,2,3$, non-zero rational numbers. We show the existence of a rational function $D\\in\\mathbb{Q}(v_1,v_2,v_3,v_4)$ such that the Jacobian of the quadratic twist of $y^2=f(x)$ and the Jacobian of the $m_i$-twist, respectively $2m_i$-twist, of $y^2=x^{m_i}+a_i^2$, $i=1,2,3$, by $D$ are all of positive Mordell-Weil ranks. As an application, we present families of hyperelliptic curves with large Mordell-Weil rank."}
{"id": "2511.07132", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07132", "abs": "https://arxiv.org/abs/2511.07132", "authors": ["Yi Cai", "Jinjiang Li", "Yankun Sui", "Fei Xue", "Min Zhang"], "title": "On Higher-Power Moments of $ Δ_a(x) $ for $-1/2<a<0$", "comment": "10 pages", "summary": "Let $-1/2<a<0$ be a fixed real number and \n\\begin{equation*} Δ_{a}(x)=\\sideset{}{'}\\sum_{n\\leq x} σ_a(n)-ζ(1-a)x-\\frac{ζ(1+a)}{1+a}x^{1+a}+\\frac{1}{2}ζ(-a). \\end{equation*} In this paper, we investigate the higher--power moments of $Δ_a(x)$ and give the corresponding asymptotic formula for the integral $\\int_{1}^{T}Δ_a^k(x)\\mathrm{d}x$, which constitutes an improvement upon the previous result of Zhai [9] for $k=3,4,5$ and an enlargement of the upper bound of $k$ to $7$."}
{"id": "2511.07146", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07146", "abs": "https://arxiv.org/abs/2511.07146", "authors": ["Min Zhang", "Jinjiang Li", "Linji Long", "Yuhan Yang"], "title": "On a system of two Diophantine inequalities with five prime variables", "comment": "21 pages", "summary": "Suppose that $c,d,α,β$ are real numbers satisfying the inequalities $1<d<c<39/37$ and $1<α<β<5^{1-d/c}$. In this paper, it is proved that, for sufficiently large real numbers $N_1$ and $N_2$ subject to $α\\leqslant N_2/N_1^{d/c}\\leqslantβ$, the following Diophantine inequalities system \\begin{equation*} \\begin{cases} \\big|p_1^c+p_2^c+p_3^c+p_4^c+p_5^c-N_1\\big|<\\varepsilon_1(N_1) \\\\ \\big|p_1^d+p_2^d+p_3^d+p_4^d+p_5^d-N_2\\big|<\\varepsilon_2(N_2) \\end{cases} \\end{equation*} is solvable in prime variables $p_1,p_2,p_3,p_4,p_5$, where \\begin{equation*} \\begin{cases} \\varepsilon_1(N_1)=N_1^{-(1/c)(39/37-c)}(\\log N_1)^{201}, \\\\ \\varepsilon_2(N_2)=N_2^{-(1/d)(39/37-d)}(\\log N_2)^{201}. \\end{cases} \\end{equation*} This result constitutes an improvement upon a series of previous results of Zhai [14] and Tolev [12]."}
{"id": "2511.07154", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07154", "abs": "https://arxiv.org/abs/2511.07154", "authors": ["Xiaotian Li", "Jinjiang Li", "Min Zhang"], "title": "Vinogradov's three primes theorem in the intersection of multiple Piatetski-Shapiro sets", "comment": "14 pages", "summary": "Vinogradov's three primes theorem indicates that, for every sufficiently large odd integer $N$, the equation $N=p_1+p_2+p_3$ is solvable in prime variables $p_1,p_2,p_3$. In this paper, it is proved that Vinogradov's three primes theorem still holds with three prime variables constrained in the intersection of multiple Piatetski-Shapiro sequences."}
{"id": "2511.07164", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07164", "abs": "https://arxiv.org/abs/2511.07164", "authors": ["Linji Long", "Jinjiang Li", "Min Zhang", "Yankun Sui"], "title": "Cubic Waring-Goldbach problem with Piatetski-Shapiro primes", "comment": "17 pages", "summary": "In this paper, it is proved that, for $γ\\in(\\frac{317}{320},1)$, every sufficiently large odd integer can be written as the sum of nine cubes of primes, each of which is of the form $[n^{1/γ}]$. This result constitutes an improvement upon the previous result of Akbal and Güloğlu [1]."}
{"id": "2511.07203", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2511.07203", "abs": "https://arxiv.org/abs/2511.07203", "authors": ["Dominik Bullach", "Matthew H. L. Honnor"], "title": "On the refined `Birch--Swinnerton-Dyer type' conjectures of Mazur and Tate", "comment": "74 pages, comments welcome!", "summary": "We prove a substantial part of conjectures of Mazur and Tate that refine the conjecture of Birch and Swinnerton-Dyer. Our approach, which also leads to some results even finer than the predictions of Mazur and Tate, is via the `rank-zero component' of the relevant case of the equivariant Tamagawa Number conjecture."}
{"id": "2511.07302", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2511.07302", "abs": "https://arxiv.org/abs/2511.07302", "authors": ["Benjamin Brindle"], "title": "On the structure of Multiple q-Zeta Values", "comment": "Comments welcome! In particular, comments about the 'box product' and whether it occurs somewhere else already would be great!", "summary": "In 2015, Bachmann \\cite{Ba3} conjectured that the~$\\Q$-vector space~$\\Zq$ of (formal)~$q$-analogues of Multiple Zeta Values (\\qmzv s) is spanned by a very particular set compared to known spanning sets. In this work, we prove that this conjecture is true for a subspace of~$\\Zq$ spanned by words satisfying some condition on their number of zeros and depth. According to this partial result, we give an explicit approach to the whole conjecture, based on particular~$\\Q$-linear relations among formal Multiple~$q$-Zeta Values which are implied by duality."}
{"id": "2511.04378", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2511.04378", "abs": "https://arxiv.org/abs/2511.04378", "authors": ["Michael M. Schein", "Re'em Waxman"], "title": "On the structure of modular principal series representations of $\\mathrm{GL}_2$ over some finite rings", "comment": "42 pp., comments welcome", "summary": "The submodule structure of mod $p$ principal series representations of $\\mathrm{GL}_2(k)$, for $k$ a finite field of characteristic $p$, was described by Bardoe and Sin and has played an important role in subsequent work on the mod $p$ local Langlands correspondence. The present paper studies the structure of mod $p$ principal series representations of $\\mathrm{GL}_2(\\mathcal{O} / \\mathfrak{m}^n)$, where $\\mathcal{O}$ is the ring of integers of a $p$-adic field $F$ and $\\mathfrak{m}$ its maximal ideal. In particular, the multiset of Jordan-Hölder constituents is determined.\n  In the case $n = 2$, more precise results are obtained. If $F / \\mathbb{Q}_p$ is totally ramified, the submodule structure of the principal series is determined completely. Otherwise the submodule structure is infinite. When $F$ is ramified but not totally ramified, the socle and radical filtrations are determined and a specific family of submodules, providing a filtration of the principal series with irreducible quotients, is studied; this family is closely related to the image of a functor of Breuil. In the case of unramified $F$, the structure of a particular submodule of the principal series is studied; this provides a more precise description of the structure of a module constructed by Breuil and Pauskūnas in the context of their work on diagrams giving rise to supersingular mod $p$ representations of $\\mathrm{GL}_2(F)$."}
