{"id": "2512.08994", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.08994", "abs": "https://arxiv.org/abs/2512.08994", "authors": ["Neil Kolekar"], "title": "Irreducible Polynomials with Coefficients in an Affine Algebraic Set", "comment": null, "summary": "In this paper, we give error bounds on the number of monic irreducible polynomials $a_0+a_1x+\\dots+a_{n-1}x^{n-1}+x^n$ over a finite field $\\mathbb{F}_q$ of degree $n$ with $(a_0, a_1, \\dots, a_{n-1}, 1)$ lying in a fixed affine algebraic set $V$ of points in $\\mathbb{F}_q^{n+1}$."}
{"id": "2512.09002", "categories": ["math.NT", "math.CV"], "pdf": "https://arxiv.org/pdf/2512.09002", "abs": "https://arxiv.org/abs/2512.09002", "authors": ["Mahmoud Annaby", "Shimaa Elsayed-Abdullah"], "title": "On the Zeros of $q$-Hankel Transform by Using Pólya-Hurwitz Partial Fraction Method", "comment": "14 pages", "summary": "The technique of Pólya-Hurwitz of partial fractions is implemented to investigate the zeros of finite $q$-Hankel transforms, which are defined in terms of the third $q$-Bessel function of Jackson. The new approach, which is a $q$-counterpart of Pólya-Hurwitz technique relaxes the restrictive conditions imposed on $q$ in the previously obtained results. In the present study, we use the $q$-type sampling theorems of the $q$-Hankel transforms, which lead directly to $q$-partial fractions. Various experimental examples are established."}
{"id": "2512.09188", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09188", "abs": "https://arxiv.org/abs/2512.09188", "authors": ["Gabriele Bogo"], "title": "Integrality of Picard-Fuchs differential equations of Kobayashi geodesics and applications", "comment": null, "summary": "We prove that the holomorphic solutions of Picard-Fuchs differential equations associated with one-parameter families of abelian varieties with real multiplication admit power series expansions with $S$-integral coefficients at a maximal unipotent monodromy point. This extends classical integrality results for hypergeometric functions and Bouw-Möller's work on Teichmüller curves. The integral solutions are related to the non-ordinary locus of the modulo $p$ reduction of the family, whose cardinality we bound in terms of the Euler characteristic and Lyapunov exponents of the base curve. In some cases, the non-ordinary locus can be recovered by truncating the integral solutions, as in Igusa's classical observation for the Legendre family. We also establish $S$-integrality of expansions of modular forms at cusps in terms of a modular function for (not necessarily arithmetic) Fuchsian groups with modular embeddings, and deduce congruences. These results are applied in subsequent work to construct lifts of partial Hasse invariants for rational curves in Hilbert modular varieties."}
{"id": "2512.09203", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09203", "abs": "https://arxiv.org/abs/2512.09203", "authors": ["Zhenpeng Tang", "Xiaosheng Wu"], "title": "Mixed moments of twisted $L$-functions", "comment": "25pages", "summary": "We establish an asymptotic formula with a power-saving error term for the twisted mixed moment of Dirichlet $L$-functions and automorphic $L$-functions twisted by all primitive characters modulo $q$, valid for all admissible moduli. As a special case, this extends the asymptotic result of Blomer, Fouvry, Kowalski, Michel, and Milićević to general moduli, achieving an error term as sharp as the best bound recently proved by Khan and Zhang for prime moduli."}
{"id": "2512.09564", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.09564", "abs": "https://arxiv.org/abs/2512.09564", "authors": ["Jinfeng Song", "Jeff York Ye"], "title": "Reductive monoids and cluster algebras", "comment": "20 pages", "summary": "We show that the coordinate ring of the Vinberg monoid of a simply connected semisimple complex group is an upper cluster algebra. As an application, we construct cluster structures on a large class of flat reductive monoids. After localization, we obtain cluster structures on any connected reductive group whose commutator group is simply connected."}
{"id": "2512.09231", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09231", "abs": "https://arxiv.org/abs/2512.09231", "authors": ["Kaiji. Kondo"], "title": "Anabelian aspects of the outer automorphism groups of the absolute Galois groups of mixed-characteristic local fields", "comment": null, "summary": "In the present paper, we study the outer automorphism groups of the absolute Galois groups of mixed-characteristic local fields from the point of view of anabelian geometry. In particular, we show that, under certain mild assumptions, the image of the natural homomorphism from the automorphism group of a mixed-characteristic local field to the outer automorphism group of the associated absolute Galois group is not a normal subgroup. Furthermore, we show that, for the absolute Galois group of a mixed-characteristic local field satisfying certain assumptions, there exist a continuous representation and a continuous automorphism of the group such that the former is irreducible, abelian, and crystalline, but the continuous representation obtained as the composite of the former with the latter is not even Hodge-Tate.\n  These results significantly generalize previous works by Hoshi and Nishio. A key observation in obtaining these results is to focus on the analogy between the mapping class groups of topological surfaces and the outer automorphism groups of the absolute Galois groups of mixed-characteristic local fields. To the best of the author's knowledge, this is the first work applying results from the theory of mapping class groups to the anabelian geometry of mixed-characteristic local fields, going beyond a mere analogy between the two."}
{"id": "2512.09618", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.09618", "abs": "https://arxiv.org/abs/2512.09618", "authors": ["Job Daisie Rock", "Hugh Thomas"], "title": "Preprojective categories of type A", "comment": "31 pages, 7 figures, comments welcome", "summary": "We introduce a continuous version of preprojective algebras of type $A$. In particular, we are interested in the preprojective category over an open, bounded subinterval $\\mathbb{I}$ of $\\mathbb{R}$, denoted $Λ_{\\mathbb{I}}$. We study the representable projective modules and define a useful type of sub- and quotient module called decorous modules. These are completely described by a function from the closure $\\overline{\\mathbb{I}}$ of $\\mathbb{I}$ to $\\mathbb{R}$ whose 'slopes' are not too steep anywhere. We later use these to describe permuton ideals, a generalization of the support $τ$-tilting ideals of preprojective algebras of type $A_n$, which we call permutation ideals. Once we have our generalization, we show that permutation ideals can be recovered from permuton ideals. Moreover, permutation ideals are $τ$-rigid and we show an analogous property for our permuton ideals. Along the way, we classify all the brick $Λ_{\\mathbb{I}}$-modules."}
{"id": "2512.09245", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09245", "abs": "https://arxiv.org/abs/2512.09245", "authors": ["Do Duc Tam"], "title": "On the largest prime factors of shifted semiprime numbers", "comment": null, "summary": "A natural number $n$ is called semi-prime if it is a product of two primes or a square of a prime. We denote $\\mathbb{P}_2$ the set of all semi-primes. Our goal is to prove that for fixed integer number $a$ and sufficiently large $x$ the largest prime factor of number $$ \\prod_{\\substack{n\\in \\mathbb{P}_2\\\\n\\leq x}}(n+a) $$ exceeds $x^θ$, where $θ= 0.5-\\varepsilon,$ $0<\\varepsilon\\leq 0.01$ is arbitrarily small."}
{"id": "2512.09631", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2512.09631", "abs": "https://arxiv.org/abs/2512.09631", "authors": ["Heizo Sakamoto"], "title": "Classification of real and imaginary modules of quantum affine algebras in monoidal categorifications of affine cluster algebras", "comment": "60pages", "summary": "Recently, Kashiwara-Kim-Oh-Park introduced a wide family of monoidal categories of finite-dimensional representations of quantum affine algebras, which provide monoidal categorifications of cluster algebras. In this paper, we prove that, for types $ADE$, some of these categories provide monoidal categorifications of cluster algebras of affine type. Moreover, by means of the combinatorial theory of affine type cluster algebras, we give a complete classification of real and imaginary simple modules in these categories. In particular, we show that, in these cases, the conjecture asserting that real simple modules correspond exactly to cluster monomials holds."}
{"id": "2512.09526", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09526", "abs": "https://arxiv.org/abs/2512.09526", "authors": ["Liam Baker", "Richard Griffon", "Fabien Pazuki"], "title": "A parallelogram height inequality for Drinfeld modules", "comment": "17 pages. Comments are welcome!", "summary": "We prove inequalities relating the Taguchi heights, respectively the graded heights, of four Drinfeld modules arranged in a ``parallelogram of isogenies''. This inequality is the analogue for Drinfeld modules of the parallelogram inequality of Rémond (2022) for abelian varieties over number fields and of Griffon--Le Fourn--Pazuki (2025) for abelian varieties over function fields."}
{"id": "2512.09692", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.09692", "abs": "https://arxiv.org/abs/2512.09692", "authors": ["Weikang Weng"], "title": "A recollement approach to Brieskorn-Pham singularities", "comment": "27 pages", "summary": "In this paper, we construct recollements and ladders for Brieskorn-Pham singularities via reduction/insertion functors, and study the singularity categories of the Brieskorn-Pham singularities using these ladders.\n  In particular, we construct a class of tilting objects, called the extended tilting $n$-cuboids, whose endomorphism algebras are $n$-fold tensor products of certain Nakayama algebras. Moreover, we show that such an endomorphism algebra is derived equivalent to a certain replicated algebra. This generalizes the Happel-Seidel symmetry to the context of Brieskorn-Pham singularities."}
{"id": "2512.09601", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09601", "abs": "https://arxiv.org/abs/2512.09601", "authors": ["Edison H L Au-Yeung"], "title": "Explicit valuation of elliptic nets for elliptic curves with complex multiplication", "comment": null, "summary": "Division polynomials associated to an elliptic curve $E/K$ are polynomials $φ_n, ψ_n^2$ that arise from the sequence of points $\\{nP\\}_{n \\in \\mathbb{N}}$ on this curve. If one wishes to study $\\mathbb{Z}$--linear combination of points on $E(K)$, we can use net polynomials $Φ_{v}, Ψ_{v}^2$ which are higher--dimensional analogue of division polynomials. It turns out they are also elliptic nets, an $n$--dimensional array with values in $K$ satisfying the same nonlinear recurrence relation that division polynomials do as well. Now further assume the elliptic curve $E/K$ has complex multiplication by an order of a quadratic imaginary field $F \\subseteq K$, we will prove a formula for the common valuation of $Φ_{v}$ and $Ψ_{v}^2$ associated to multiples of points by elements of an order in $F$. As an application, we will use the formula to show that elliptic divisibility sequences associated to multiples of points indexed by elements of an order also satisfy a recurrence relation when indexed by elements of an order, subject to certain conditions on the indices. Additionally, we also expect that the formula may also be used in computing $\\mathcal{O}_K$--integral points of an elliptic curve of rank $2$ with complex multiplication (this is future work)."}
{"id": "2512.09771", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09771", "abs": "https://arxiv.org/abs/2512.09771", "authors": ["S. I. Dimitrov"], "title": "Diophantine approximation with mixed powers of Piatetski-Shapiro primes", "comment": null, "summary": "Let $[\\,\\cdot\\,]$ denote the floor function. In this paper, we show that whenever $η$ is real and the constants $λ_i$ satisfy some necessary conditions, then for any fixed $\\frac{63}{64}<γ<1$ and $θ>0$, there exist infinitely many prime triples $p_1,\\, p_2,\\, p_3$ satisfying the inequality \\begin{equation*} |λ_1p_1 + λ_2p_2 + λ_3p^2_3+η|<\\big(\\max \\{p_1, p_2, p^2_3\\}\\big)^{{\\frac{63-64γ}{52}}+θ} \\end{equation*} and such that $p_i=[n_i^{1/γ}]$,\\;\\;$i=1,\\,2,\\,3$."}
{"id": "2512.09812", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.09812", "abs": "https://arxiv.org/abs/2512.09812", "authors": ["Jan Moser"], "title": "Jacob's ladders, our old formula (1985) and new $ζ$-equivalent of the Fermat-Wiles theorem on two-parametric set of lemniscates of Bernoulli", "comment": null, "summary": "In our paper from 1985 we have constructed two integrals of the Riemann's function $Z^2(t)$ over two disconnected sets with asymptotically equal measures such that these two integrals differ by considerably big excess. In the present paper we use the formula for that excess to construct a new $ζ$-equivalent of the Fermat-Wiles theorem on a two-parametric set of lemniscates of Bernoulli."}
