{"id": "2512.22346", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.22346", "abs": "https://arxiv.org/abs/2512.22346", "authors": ["Sroyon Sengupta"], "title": "Higher Order Dualities between Prime Ideals", "comment": "Will be submitted for publication soon", "summary": "Extending the works of Alladi and Sweeting and Woo, we state and prove the general higher order duality between prime ideals in number rings. We then use the second order duality to obtain the a new formula for the Chebotarev Density involving sums of the generalized Möbius function and the prime ideal counting function. We also provide two estimates of such sums as an application of the duality identity. A discussion of the duality in a slightly more general setting is done at the end."}
{"id": "2512.22413", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.22413", "abs": "https://arxiv.org/abs/2512.22413", "authors": ["Matt Visser"], "title": "Sierpinski's Hypothesis H1", "comment": "15 pages", "summary": "Sierpinski's Hypothesis H1, formulated in 1958, is the conjecture that (provided $n\\geq 2$), when the first $n^2$ counting numbers, $1, 2,3,\\dots n^2$, are arranged in a square, then each row contains at least one prime. This conjecture is particularly interesting in that it subsumes and is stronger than both the Oppermann and Legrendre conjectures. Herein I shall verify Sierpinski's Hypothesis H1 for (at least) the first $n \\leq \\hbox{4 553 432 387} \\approx 4.5 \\hbox{ billion}$ of these Sierpinski matrices. I shall also demonstrate some partial but more general results. For example: Even for arbitrary $n\\geq \\hbox{4 553 432 388}$ at least one quarter of the rows of the $n$th Sierpinski matrix contain at least one prime. Furthermore, even for arbitrary $n\\geq \\hbox{4 553 432 388}$ at least the first $\\hbox{131 294}$ rows of the $n$th Sierpinski matrix always contain at least one prime. These and related results are obtained largely by using the locations and values of the known maximal prime gaps, the pigeonhole principle, and some recent bounds on the first Chebyshev function."}
{"id": "2512.22451", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.22451", "abs": "https://arxiv.org/abs/2512.22451", "authors": ["Anji Dong", "Nawapan Wattanawanichkul", "Alexandru Zaharescu"], "title": "Zeros of Polynomials in Derivatives of Automorphic $L$-functions", "comment": "29 pages, 1 figure", "summary": "Let $\\mathfrak{F}_m$ be the set of all cuspidal automorphic representations of $\\mathrm{GL}_m(\\mathbb{A}_{\\mathbb{Q}})$, and let $F(s,\\boldsymbolπ)$ be a polynomial in the derivatives of $L$-functions associated with representations $π_u \\in \\cup_{m=1}^{\\infty} \\mathfrak{F}_m$. We establish an asymptotic formula for the number of nontrivial zeros of $F(s,\\boldsymbolπ)$ with $0 < \\operatorname{Im}(s) < T$. We explicitly determine the main term of this formula in terms of the degrees, the ranks, the arithmetic conductors, and the orders of differentiation of the component $L$-functions. Furthermore, we show that, under certain conditions, almost all nontrivial zeros of $F(s,\\boldsymbolπ)$ lie near the critical line $\\operatorname{Re}(s)=1/2$."}
{"id": "2512.22494", "categories": ["math.NT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.22494", "abs": "https://arxiv.org/abs/2512.22494", "authors": ["Thang Pang Ern", "Malcolm Tan Jun Xi", "Loh Wei Xuan Ryan"], "title": "On the Limiting Density of a gcd Map", "comment": null, "summary": "The function \\[f(a,b)=\\frac{\\gcd(a+b,ab)}{\\gcd(a,b)}\\] is of interest in this paper. We then ask a natural question regarding how often $f(a,b)=1$ is. We yield the limiting density $ρ=\\prod_{p}\\left(1-\\frac{1}{p^2(p+1)}\\right)\\approx 0.88151$ which is an Euler product that unexpectedly matches the quadratic class number constant from the theory of real quadratic fields. We also consider its higher-order analogue $f_r$, where the problem collapses to coprimality and the density becomes $1/ζ(2)=6/π^2$."}
{"id": "2512.22353", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.22353", "abs": "https://arxiv.org/abs/2512.22353", "authors": ["Mihalis Maliakas", "Dimitra-Dionysia Stergiopoulou"], "title": "Tableaux and orbit harmonics quotients for finite transformation monoids", "comment": "Comments welcome", "summary": "We extend Grood's tableau construction of irreducible representations of the rook monoid and Steinberg's analogous result for the full transformation monoid. Our approach is characteristic-free and applies to any submonoid $\\mathcal{M}(n)$ of the partial transformation monoid on an $n$-element set that contains the symmetric group. To achieve this, we introduce and study a functor from the category of rational representations of the monoid of $n \\times n$ matrices to the category of finite dimensional representations of $\\mathcal{M}(n)$. We establish two branching rules. Our main results describe graded module structures of orbit harmonics quotients for the rook, partial transformation, and full transformation monoids. This yields analogs of the Cauchy decomposition for polynomial rings in $n\\times n$ variables."}
{"id": "2512.22509", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.22509", "abs": "https://arxiv.org/abs/2512.22509", "authors": ["Peng Gao", "Liangyi Zhao"], "title": "First Moment of Quadratic Hecke $L$-Functions with Lower Order Term", "comment": "15 pages", "summary": "We evaluate the first moment of the family of primitive quadratic Hecke $L$-functions in the Gaussian field using the method of double Dirichlet series under the Riemann hypothesis and the Lindelöf hypothesis. We obtain asymptotic formulas with secondary main terms and error terms of size that is one quarter of that of the main term."}
{"id": "2512.22713", "categories": ["math.RT", "math.NT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.22713", "abs": "https://arxiv.org/abs/2512.22713", "authors": ["Luis Arenas-Carmona", "Claudio Bravo"], "title": "Computing quaternionic representations via twisted forms of Bruhat-Tits trees", "comment": "Comments are welcome", "summary": "This work is devoted to the study of representations of finite subgroups of the group of units of quaternion division algebras over a global or local field arising from the inclusion via extension of scalars splitting the algebra. Following a question by Serre, we study the set $\\mathrm{IF}$ of conjugacy classes of integral representations that are conjugates of the given representation over the field. The set $\\mathrm{IF}$ is often called the set of integral forms in the literature. In previous works we have seen that, for a given representation, the set $\\mathrm{IF}$ can be indexed by the vertex set of a suitable subgraph of the Bruhat-Tits tree for the special linear group. In this work, we describe a construction that allows the simultaneous study of the set $\\mathrm{IF}$ over different splitting fields. For this, we devise and use a theory of twisted Galois form of Bruhat-Tits trees. With this tool, we explicitly compute, in most cases, the cardinality of $\\mathrm{IF}$ for the representation of the classical quaternion group of order $8$ studied by Serre, Feit and others, as much as for other similar groups."}
{"id": "2512.22520", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.22520", "abs": "https://arxiv.org/abs/2512.22520", "authors": ["Madoka Horie", "Takuya Yamauchi"], "title": "The $L$-function of the surface parametrizing cuboids", "comment": "9 pages", "summary": "In this note, we compute the $L$-function of the projective smooth surface $S$ over $\\mathbb{Q}$ that parametrizes cuboids whose geometric properties are studied in detailby Stoll and Testa. As a byproduct, we completely determine the structure of ${\\rm Pic}(S_{\\overline{\\mathbb{Q}}})$ as a ${\\rm Gal}(\\overline{\\mathbb{Q}}/\\mathbb{Q})$-module."}
{"id": "2512.22985", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.22985", "abs": "https://arxiv.org/abs/2512.22985", "authors": ["Michael J. Larsen"], "title": "Tensor Power Asymptotics for Linearly Reductive Groups", "comment": "8 pages", "summary": "Given a finite-dimensional faithful representation $V$ of a linearly reductive group $G$ over a field $K=\\bar K$, we consider the growth of the number of irreducible factors of $V^{\\otimes n}$ when $n$ is large. We prove that there exist upper and lower bounds which are constant multiples of $n^{-u/2} (\\dim V)^n$, where $u$ is the dimension of any maximal unipotent subgroup of $G$."}
{"id": "2512.22614", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.22614", "abs": "https://arxiv.org/abs/2512.22614", "authors": ["Felipe Rivera-Mesas"], "title": "van Hamel-Lichtenbaum duality for singular varieties over $p$-adic fields", "comment": "38 pages", "summary": "In this article, we extend the van Hamel-Lichtenbaum duality theorem to (not necessarily smooth) proper and geometrically integral varieties defined over a $p$-adic field $k$. More precisely, we prove that for such variety $X$ there exists a natural continuous perfect pairing \\[ \\mathrm{Br}_1(X)\\times H_0(X,\\mathbb{Z})_τ^{\\wedge} \\to \\mathbb{Q}/\\mathbb{Z}, \\] where $\\mathrm{Br}_1(X):=\\ker(\\mathrm{Br}(X)\\to\\mathrm{Br}(\\overline{X}))$ is the algebraic Brauer group of $X$, $H_0(X,\\mathbb{Z})_τ$ is the zeroth group of truncated homology $\\mathrm{Hom}_{D(k_{\\mathrm{sm}})}(τ_{\\leq 1}Rφ_*\\mathbb{G}_{m,X},\\mathbb{G}_{m,k})$, $φ$ is the structure morphism of $X$, and $(-)^{\\wedge}$ is the profinite completion functor."}
{"id": "2512.23285", "categories": ["math.RT", "math.CO", "math.PR"], "pdf": "https://arxiv.org/pdf/2512.23285", "abs": "https://arxiv.org/abs/2512.23285", "authors": ["Persi Diaconis", "Andrew Lin", "Arun Ram"], "title": "Schur--Weyl duality for diagonalizing a Markov chain on the hypercube", "comment": "Please feel free to make comments! This is a companion paper split off from arXiv:2511.01245, which originally contained the content of this work", "summary": "We show how the tools of modern algebraic combinatorics -- representation theory, Murphy elements, and particularly Schur--Weyl duality -- can be used to give an explicit orthonormal basis of eigenfunctions for a \"curiously slowly mixing Markov chain\" on the space of binary $n$-tuples. The basis is used to give sharp rates of convergence to stationarity."}
{"id": "2512.22798", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.22798", "abs": "https://arxiv.org/abs/2512.22798", "authors": ["Zongkun Zheng"], "title": "Primes in simultaneous arithmetic progressions", "comment": "49 pages. All comments are welcome!", "summary": "We prove a new mean value theorem on the distribution of primes in two simultaneous arithmetic progressions. Our approach builds on previous arguments of Bombieri, Fouvry, Friedlander, and Iwaniec appealing to spectral theory of Kloosterman sums, as well as the $q$-analogue of van der Corput method. In particular, we need estimates for exponential sums coming from the spectral theory of automorphic forms (sums of Kloosterman sums) and from algebraic geometry (Weil--Deligne bound for algebraic exponential sums). As an application, we show that the greatest prime factor of $p + 6$ for Chen prime $p$ is infinitely often greater than $p^{0.217}$."}
{"id": "2512.23218", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.23218", "abs": "https://arxiv.org/abs/2512.23218", "authors": ["Yeansu Kim", "Gyujin Oh"], "title": "Aubert duals of strongly positive representations for metaplectic groups", "comment": null, "summary": "We determine the Aubert duals of strongly positive representations of the metaplectic group \\(\\widetilde{Sp}(n)\\) over a non-Archimedean local field $F$ of characteristic different from two. Using the classification of Matić and an explicit analysis of Jacquet modules, we describe these duals in terms of precise inducing data. Our results extend known descriptions for classical groups to the metaplectic groups case and clarify the role of Aubert duality for non-linear covering groups, providing a foundation for future applications to the study of unitary representations for those cases. Furthermore, We are able to show that the same method applies to odd general spin groups $GSpin(2n+1)$, yielding an explicit description of Aubert duals in that setting as well."}
{"id": "2512.22849", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.22849", "abs": "https://arxiv.org/abs/2512.22849", "authors": ["Peter Koymans", "Yuan Liu"], "title": "Statistics of bad parts of class groups", "comment": null, "summary": "Let $p$ be an odd prime. We give a formula for the bad part of $p$-class groups that is valid for $100\\%$ of the abelian $p$-extensions when ordered by product of ramified primes."}
{"id": "2512.22902", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.22902", "abs": "https://arxiv.org/abs/2512.22902", "authors": ["Goran Dražić", "Matija Kazalicki", "Rudi Mrazović"], "title": "Equidistribution of Diophantine pairs among the equivalence classes of quadratic forms", "comment": "16 pages", "summary": "For a fixed integer n, a pair of nonzero integers {a, c} is called a D(n)-pair if the product ac plus n is a perfect square.\n  In this short note we prove that D(n)-pairs are asymptotically equidistributed (via their associated quadratic forms) among proper SL_2(Z)-equivalence classes of binary quadratic forms of discriminant 4n with fixed content. As a consequence, we obtain a more streamlined and simpler proof of Badesa's asymptotic formula for the number of D(n)-pairs."}
{"id": "2512.23052", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23052", "abs": "https://arxiv.org/abs/2512.23052", "authors": ["Romain Branchereau"], "title": "A regularized theta lift on the symmetric space of $SL_N$", "comment": null, "summary": "We define a regularized lift from harmonic weak Maass forms of weight $2-N$ to differential forms of degree $N-1$ on the symmetric space $\\SL_N(\\R)/\\SO(N)$, that are smooth outside of certain modular symbols. We show that this lift is adjoint to the derivative of a theta lift. We compute periods of the regularized lift over tori and relate them to Fourier coefficients of Hilbert-Eisenstein series."}
{"id": "2512.23064", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23064", "abs": "https://arxiv.org/abs/2512.23064", "authors": ["Victor Amberger"], "title": "Bounding the integral of the argument of the Riemann Zeta function", "comment": "17 pages, 8 tables", "summary": "This article improves the estimate of $|S_1(t_2)-S_1(t_1)|$, which is the definite integral of the argument of the Riemann zeta-function between $t_1$ and $t_2$. Estimates of this quantity are needed to apply Turing's method to compute the exact number of zeta zeros up to a given height."}
{"id": "2512.23204", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23204", "abs": "https://arxiv.org/abs/2512.23204", "authors": ["Jonathan Hickman", "Rajula Srivastava", "James Wright"], "title": "Counting rational points near manifolds: a refined estimate, a conjecture and a variant", "comment": "32 pages. Comments are welcome", "summary": "Refining an argument of the second author, we improve the known bounds for the number of rational points near a submanifold of $\\mathbb{R}^d$ of intermediate dimension under a natural curvature condition. Furthermore, in the codimension $2$ case we formulate a conjecture concerning this count. The conjecture is motivated in part by interpreting certain codimension $2$ submanifolds of $\\mathbb{R}^{2m+2}$ as complex hypersurfaces in $\\mathbb{C}^{m+1}$ and using the complex structure to provide a natural reformulation of the curvature condition. Finally, we provide further evidence for the conjecture by proving a natural variant for $n \\geq 2$ in which rationals are replaced with Gaussian rationals."}
{"id": "2512.23218", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.23218", "abs": "https://arxiv.org/abs/2512.23218", "authors": ["Yeansu Kim", "Gyujin Oh"], "title": "Aubert duals of strongly positive representations for metaplectic groups", "comment": null, "summary": "We determine the Aubert duals of strongly positive representations of the metaplectic group \\(\\widetilde{Sp}(n)\\) over a non-Archimedean local field $F$ of characteristic different from two. Using the classification of Matić and an explicit analysis of Jacquet modules, we describe these duals in terms of precise inducing data. Our results extend known descriptions for classical groups to the metaplectic groups case and clarify the role of Aubert duality for non-linear covering groups, providing a foundation for future applications to the study of unitary representations for those cases. Furthermore, We are able to show that the same method applies to odd general spin groups $GSpin(2n+1)$, yielding an explicit description of Aubert duals in that setting as well."}
{"id": "2512.23276", "categories": ["math.NT", "math.CO", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.23276", "abs": "https://arxiv.org/abs/2512.23276", "authors": ["Soonki Hong", "Sanghoon Kwon"], "title": "Chamber zeta function and closed galleries in the standard non-uniform complex from $\\operatorname{PGL}_3$", "comment": "22 pages, 6 figures", "summary": "We introduce the \\emph{chamber zeta function} for a complex of groups, defined via an Euler product over primitive tailless chamber galleries, extending the Ihara--Bass framework from weighted graphs to higher-rank settings. Let $\\mathcal{B}$ be the Bruhat--Tits building of $\\mathrm{PGL}_{3}(F)$ for a non-archimedean local field $F$ with residue field $\\mathbb{F}_{q}$. For the standard arithmetic quotient $Γ\\backslash\\mathcal{B}$ with $Γ=\\mathrm{PGL}_{3}(\\mathbb{F}_{q}[t])$, we prove an Ihara--Bass type \\emph{determinant formula} expressing the chamber zeta function as the reciprocal of a characteristic polynomial of a naturally defined chamber transfer operator. In particular, the chamber zeta function is \\emph{rational} in its complex parameter. As an application of the determinant formula, we obtain explicit counting results for closed gallery classes arising from tailless galleries in $\\mathcal{B}$, including exact identities and spectral asymptotics governed by the chamber operator."}
{"id": "2512.23302", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23302", "abs": "https://arxiv.org/abs/2512.23302", "authors": ["Mounir Hayani"], "title": "Chebyshev's bias without linear independence", "comment": null, "summary": "We confirm Chebyshev's observation that primes are strikingly more abundant in non-square residue classes modulo a fixed integer under the Generalized Riemann Hypothesis (GRH) by proving a (natural) density 1 statement for prime counting functions in residue classes where each prime is weighted by its inverse square root. In contrast to the majority of the existing literature on the subject, we do not need to restrict to logarithmic densities to measure Chebyshev's bias and we do not rely on any hypothesis related to L-function zeros that is stronger than GRH."}
{"id": "2512.23391", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23391", "abs": "https://arxiv.org/abs/2512.23391", "authors": ["George E. Andrews", "Mohamed El Bachraoui"], "title": "Two-color partitions with evens in one color", "comment": "Submitted for publications. 10 pages", "summary": "We consider sequences counting integer partitions in two colors (red and blue) in which the even parts occur only in blue color. We focus on subsequences defined by constraints on the parity and color of the summands. We establish formulas for our sequences and deduce identities of integer partitions."}
{"id": "2512.23402", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2512.23402", "abs": "https://arxiv.org/abs/2512.23402", "authors": ["Hiroki Takahasi"], "title": "Hausdorff dimension of intersections between the Jarník sets and Diophantine fractals", "comment": "16 pages, no figure", "summary": "The irrationality exponent of a real number measures how well that number can be approximated by rationals. Real numbers with irrationality exponent strictly greater than $2$ are transcendental numbers, and form a set with rich fractal structure. We show that this set intersects the limit set of any parabolic iterated function system arising from the backward continued fraction in a set of full Hausdorff dimension. As a corollary, we show that the set of irrationals whose irrationality exponents are strictly bigger than $2$ and whose backward continued fraction expansions have bounded partial quotients is of Hausdorff dimension $1$. This is a sharp contrast to the fact that there exists no irrational whose irrationality exponent is strictly greater than $2$ and whose regular continued fraction expansion has bounded partial quotients."}
{"id": "2512.23534", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23534", "abs": "https://arxiv.org/abs/2512.23534", "authors": ["Andrés Chirre", "Markus Valås Hagen"], "title": "On Goldbach numbers in short intervals", "comment": null, "summary": "Assuming the Riemann Hypothesis, we prove that for all $x\\geq 2$, there exists at least one even integer within the interval $(x, x+123\\log^2x]$, that can be expressed as the sum of two primes. This result is an improvement over the recent work of Cully-Hugill and Dudek, who obtained the constant $9696$ instead of $123$."}
{"id": "2512.23549", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23549", "abs": "https://arxiv.org/abs/2512.23549", "authors": ["Pengcheng Zhang"], "title": "A note on the hypergeometric datum $\\big((\\frac{1}{2},\\frac{1}{6},\\frac{5}{6}),(1,1)\\big)$ and symmetric squares of elliptic curves", "comment": "11 pages", "summary": "This is an expository note on a mod $p$ congruence relating the truncated hypergeometric sums associated to $\\big((\\frac{1}{2},\\frac{1}{6},\\frac{5}{6}),(1,1)\\big)$ to symmetric squares of elliptic curves."}
{"id": "2512.23574", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23574", "abs": "https://arxiv.org/abs/2512.23574", "authors": ["Melvyn B. Nathanson"], "title": "Intersections of sumsets in additive number theory", "comment": "6 pages", "summary": "Let $A$ be a subset of an additive abelian semigroup and let $hA$ be the $h$-fold sumset of $A$. The following question is considered: Let $(A_q)_{q=1}^{\\infty}$ be a strictly decreasing sequence of sets in the semigroup and let $A = \\bigcap_{q=1}^{\\infty} A_q$. When does one have \\[ hA = \\bigcap_{q=1}^{\\infty} hA_q \\] for some or all $h \\geq 2$?"}
{"id": "2512.23615", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.23615", "abs": "https://arxiv.org/abs/2512.23615", "authors": ["Julian Demeio", "Damián Gvirtz-Chen"], "title": "Galois Realisations of $\\operatorname{PSL}_2(\\mathbb{F}_{p^2})$ via non-unirational Hilbert Irreducibility", "comment": "31 pages", "summary": "We establish non-unirational versions of Hilbert Irreducibility for all Hilbert modular surfaces which are of K3 type. As an application we prove new instances of the regular Inverse Galois Problem for the simple groups $\\operatorname{PSL}_2(\\mathbb{F}_{p^2})$ subject to congruence conditions on $p$."}
{"id": "2512.23668", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23668", "abs": "https://arxiv.org/abs/2512.23668", "authors": ["Shin-ichiro Seki"], "title": "Diamond lift of Hirose--Sato's formula involving the Hoffman basis", "comment": "9 pages", "summary": "In this paper, we give a new proof of Hirose--Sato's formula for the expansion of $ζ(\\{2\\}^{a_1-1},3,\\dots,\\{2\\}^{a_r-1},3,\\{2\\}^{c-1},1,\\{2\\}^{b_1},\\dots, 1,\\{2\\}^{b_s})$ in the Hoffman basis, using the drop 1 relation."}
{"id": "2512.23677", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23677", "abs": "https://arxiv.org/abs/2512.23677", "authors": ["Dylan Scofield", "Hanson Smith"], "title": "Prime Splitting and Common $N$-Index Divisors in Radical Extensions: Part $p=2$", "comment": "26 pages including many examples and constructions, comments welcome!", "summary": "Following work of Vélez, we explicitly describe the splitting of the integral prime 2 in the radical extension $\\mathbb{Q}(\\sqrt[n]{a})$, where $x^n-a$ is an irreducible polynomial in $\\mathbb{Z}[x]$. With previous work of the second author, this fully describes the splitting of any prime in $\\mathbb{Q}(\\sqrt[n]{a})$. Using this description, we classify common index divisors (the primes whose splitting prevents the existence of a power integral basis for the ring of integers). Using work of Pleasants, we extend this to describe common $N$-index divisors (primes that divide the index of any order generated over $\\mathbb{Z}$ by $N$ elements). We also present two novel constructions of non-monogenic fields with no common index divisors as well as constructions of number rings requiring $N$ ring generators for any $N>1$. Examples are provided throughout."}
{"id": "2512.23679", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23679", "abs": "https://arxiv.org/abs/2512.23679", "authors": ["Gargi Mukherjee"], "title": "Asymptotics of the shifted finite differences of the overpatition function and a problem of Wang--Xie--Zhang", "comment": null, "summary": "Let $\\overline{p}(n)$ denote the overpartition function, and for $j\\in \\mathbb{N}$, $Δ^r_j$ denote the $r$-fold applications of the shifted difference operator $Δ_j$ defined by $Δ_j(a)(n):=a(n)-a(n-j)$. The main goal of this paper is to derive an asymptotic expansion of $Δ^r_j(\\overline{p})(n)$ with an effective error bound which subsequently gives an answer to a problem of Wang, Xie, and Zhang. In order to get the asymptotics of $Δ^r_j(\\overline{p})(n)$, we derive an asymptotic expansion of the shifted overpartition function $\\overline{p}(n+k)$ for any integer $k\\neq 0$."}
{"id": "2512.23681", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.23681", "abs": "https://arxiv.org/abs/2512.23681", "authors": ["Adam J. Harper"], "title": "Better than squareroot cancellation in number theory", "comment": "27 pages. A version of this paper will appear in the Proceedings of the ICM 2026", "summary": "We give a short survey of the phenomenon of better than squareroot cancellation, specifically as it applies to averages of multiplicative character sums (such as $\\frac{1}{r-1} \\sum_{χ\\; \\text{mod} \\; r} |\\sum_{n \\leq x} χ(n)|^{2q}$) thanks to their connection with so-called multiplicative chaos.\n  We focus on the number theoretic aspects of the arguments, and also touch on some possible applications."}
{"id": "2512.22713", "categories": ["math.RT", "math.NT", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.22713", "abs": "https://arxiv.org/abs/2512.22713", "authors": ["Luis Arenas-Carmona", "Claudio Bravo"], "title": "Computing quaternionic representations via twisted forms of Bruhat-Tits trees", "comment": "Comments are welcome", "summary": "This work is devoted to the study of representations of finite subgroups of the group of units of quaternion division algebras over a global or local field arising from the inclusion via extension of scalars splitting the algebra. Following a question by Serre, we study the set $\\mathrm{IF}$ of conjugacy classes of integral representations that are conjugates of the given representation over the field. The set $\\mathrm{IF}$ is often called the set of integral forms in the literature. In previous works we have seen that, for a given representation, the set $\\mathrm{IF}$ can be indexed by the vertex set of a suitable subgraph of the Bruhat-Tits tree for the special linear group. In this work, we describe a construction that allows the simultaneous study of the set $\\mathrm{IF}$ over different splitting fields. For this, we devise and use a theory of twisted Galois form of Bruhat-Tits trees. With this tool, we explicitly compute, in most cases, the cardinality of $\\mathrm{IF}$ for the representation of the classical quaternion group of order $8$ studied by Serre, Feit and others, as much as for other similar groups."}
