{"id": "2512.03367", "categories": ["math.RT", "math.CO", "math.RA"], "pdf": "https://arxiv.org/pdf/2512.03367", "abs": "https://arxiv.org/abs/2512.03367", "authors": ["Weixi Chen", "Mee Seong Im", "Mikhail Khovanov", "Catherine Lillja", "Nicolas Rugo"], "title": "Pairs of eventually constant maps and nilpotent pairs", "comment": "15 pages, 3 figures", "summary": "Tom Leinster gave a bijective correspondence between the set of operators on a finite-dimensional vector space $V$ and the set of pairs consisting of a nilpotent operator and a vector in $V$. Over a finite field this bijection implies that the probability that an operator be nilpotent is the reciprocal of the number of vectors in $V$. We generalize this correspondence to pairs of operators between pairs of vector spaces and determine the probability that a random pair of operators be nilpotent. We also determine the set-theoretical counterpart of this construction and compute the number of eventually constant pairs of maps between two finite sets, closely related to the number of spanning trees in a complete bipartite graph."}
{"id": "2512.03425", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2512.03425", "abs": "https://arxiv.org/abs/2512.03425", "authors": ["Masaki Kashiwara", "Myungho Kim", "Se-jin Oh", "Euiyong Park"], "title": "Faithful action of braid group on bosonic extensions", "comment": "12pages", "summary": "The braid group action on the bosonic extension of the quantum group has been introduced in recent works, and it can be regarded as a generalization of Lusztig's symmetries on the quantum group. In this notes, we prove the faithfulness of this braid group action."}
{"id": "2512.03836", "categories": ["math.RT", "math.AG", "math.CT", "math.KT"], "pdf": "https://arxiv.org/pdf/2512.03836", "abs": "https://arxiv.org/abs/2512.03836", "authors": ["Norihiro Hanihara", "Junyang Liu"], "title": "Calabi-Yau structures on derived and singularity categories of symmetric orders", "comment": "18 pages", "summary": "We construct left and right Calabi-Yau structures on derived respectively singularity categories of symmetric orders $Λ$ over commutative Gorenstein rings $R$. For this, we first construct Calabi-Yau structures over $R$ by lifting Amiot's construction of Calabi-Yau structures on Verdier quotients to the dg level. Then we prove base change properties relating Calabi-Yau structures over $R$ to those over the base field $k$. As a result, we prove the existence of a right Calabi-Yau structure on the dg singularity category associated with $Λ$ which is a cyclic lift of the weak Calabi-Yau structure constructed by the first-named author and Iyama. We also show the existence of a left Calabi-Yau structure on the dg bounded derived category of $Λ$. This is a non-commutative generalization of a result by Brav and Dyckerhoff. By combining the existence of the right Calabi-Yau structure on the dg singularity category with a structure theorem by Keller and the second-named author, we deduce that under suitable hypotheses, the singularity category associated with $Λ$ is triangle equivalent to a generalized cluster category in the sense of Amiot."}
{"id": "2512.03320", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.03320", "abs": "https://arxiv.org/abs/2512.03320", "authors": ["Chen Wan"], "title": "A relative trace formula identity for non-tempered spherical varieties", "comment": "22 pages, comments are welcome!", "summary": "In this paper, motivated by some previous works in residue method and the recent theory of the relative Langlands duality, we prove a relative trace formula identity that compares the period integral of non-tempered spherical varieties with the period integral of a tempered spherical varieties associated to a Levi subgroup. This allows us to incorporate numerous relative trace formula comparisons studied during the last four decades under the relative Langlands duality framework. We will also propose a conjectural comparison for general non-tempered Hamiltonian spaces."}
{"id": "2512.03188", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03188", "abs": "https://arxiv.org/abs/2512.03188", "authors": ["Joshua Cooper", "Joseph Preuss"], "title": "On the sparsity of integers $a$ in solutions to $a!b!=c!$", "comment": "8 pages, 0 figures", "summary": "We consider the Diophantine equation $$ a!b! = c! $$ due to Erdős, where we assume $a \\leq b$. It is widely believed that there are only finitely many nontrivial solutions, and considerable work has been dedicated to showing this. In one direction, Luca (2007) showed that the set of $c$'s which can appear in solutions has density zero. Here we show that the set of $a$'s appearing in solutions is also sparse. In particular, $a$ cannot be one less than a large fraction of primes, and, under the assumption that $\\sqrt[k]{a!} \\mod 1$ is equidistributed in an appropriate sense, we show that the set of such $a$ has asymptotic density zero."}
{"id": "2512.03412", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.03412", "abs": "https://arxiv.org/abs/2512.03412", "authors": ["Henry H. Kim", "Takuya Yamauchi"], "title": "Ikeda type lift on $\\SO(3,n+1)$", "comment": "53 pages", "summary": "By using Ikeda's theory for a compatible family of Eisenstein series, we explicitly construct Ikeda type lifts on the special orthogonal group $G=\\SO(3,n+1)$ over $\\Q$ with $n\\ge 3$ which splits everywhere at finite places. Our lifts are Hecke eigen cusp forms of weight $l$ ($l\\ge n+2$, even) and come from elliptic newforms with respect to $\\SL_2(\\Z)$ which are of weight $l-\\frac{n-2}{2}$ when $n$ is even and\n  $2l-n+1$ when $n$ is odd."}
{"id": "2512.03288", "categories": ["math.NT", "math.CO", "math.SP"], "pdf": "https://arxiv.org/pdf/2512.03288", "abs": "https://arxiv.org/abs/2512.03288", "authors": ["Alexander Caicedo", "Julio C. Ramos-Fernández"], "title": "Structural Existence of Prime Constellations: Asymptotic Spectral Stability in Finite Sieve Windows", "comment": null, "summary": "The distribution of prime constellations, such as Twin Primes ($p, p+2$), is traditionally analyzed via probabilistic models or analytic sieve theory. While heuristic predictions are accurate, rigorous proofs are obstructed by the \"Parity Barrier\", which prevents classical sieves from distinguishing primes from semi-primes in the asymptotic limit. In this work, we present a structural proof of existence based on deterministic signal processing. We treat the sequence of integers as a signal generated by a rigid Diophantine basis ($N=2n+3m$) and define a fundamental certification window $\\mathcal{W} = [P, m_0^2)$ derived from the basis limit $m_0$. We demonstrate that the non-existence of constellations (the \"Null Hypothesis\") constitutes a low-entropy signal state, a \"Prime Desert\", that requires infinite spectral resolution to maintain over a quadratic window. Since the sieving basis is finite ($p \\le m_0$), the system is band-limited and structurally incapable of synthesizing the destructive interference required to sustain a zero count. By invoking the Chinese Remainder Theorem and analyzing the detailed correlation structure of residue classes, we prove that positive and negative correlations between sieved positions cancel at leading order, constraining the variance of the signal to scale linearly with the mean ($O(μ)$) rather than the quadratic scaling ($Ω(μ^2)$) required to support a Prime Desert. This Variance Gap implies that the signal must strictly oscillate around its mean, rendering the existence of prime constellations a mandatory consequence of the system's finite spectral bandwidth."}
{"id": "2512.03291", "categories": ["math.NT", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.03291", "abs": "https://arxiv.org/abs/2512.03291", "authors": ["Jiaqi Hou", "Xiaoqi Huang"], "title": "Weighted geodesic restrictions of arithmetic eigenfunctions", "comment": null, "summary": "Let $X$ be an arithmetic hyperbolic surface, $ψ$ a Hecke-Maass form, $\\ell$ a geodesic segment on $X$, and $μ$ a Borel measure supported on $\\ell$ with dimension greater than 1/2. We obtain a power saving over the local bound of Eswarathasan and Pramanik for the $L^2$ norm of $ψ$ with respect to $μ$, which is a weighted generalization of Marshall's geodesic restriction bound and is proved by applying the method of arithmetic amplification. On a general 2-dimensional Riemannian manifold, we also obtain a Kakeya-Nikodym bound for the $L^2$ norm of any Laplace-Beltrami eigenfunction with respect to a Borel measure supported on a geodesic segment with dimension greater than 1/2."}
{"id": "2512.03292", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03292", "abs": "https://arxiv.org/abs/2512.03292", "authors": ["Noah Kravitz", "Katharine Woo", "Max Wenqiang Xu"], "title": "The distribution of prime values of random polynomials", "comment": null, "summary": "The Bateman--Horn Conjecture predicts how often an irreducible polynomial $f(x) \\in \\mathbb{Z}[x]$ assumes prime values. We demonstrate that with sufficient averaging in the coefficients of $f$ (viz. exponential in the size of the inputs), one can not only prove Bateman--Horn results on average but also pin down precise information about the distribution of prime values. We show that 100\\% of polynomials (in an $L^k$ sense for all $k \\in \\mathbb{N}$) satisfy the Bateman--Horn Conjecture, and that that 100\\% of polynomials (in an $L^2$ sense) satisfy an appropriate polynomial analogue of the Hardy--Littlewood Prime Tuples Conjecture. We use the latter to prove that 100\\% of polynomials satisfy the appropriate analogue of the Poisson Tail Conjecture, in the sense that the distribution of the gaps between consecutive prime values around the average spacing is Poisson.\n  We also study the frequencies of sign patterns of the Liouville function evaluated at the consecutive outputs of $f$; viewing $f$ as a random variable, we establish the limiting distribution for every sign pattern. The Chowla problem along random polynomials is a special case. A key input behind all of our arguments is Leng's recent quantitative work on the higher-order Fourier uniformity of the von Mangoldt and Möbius functions (in turn relying on Leng, Sah, and Sawhney's quantitative inverse theorem for the Gowers norms)."}
{"id": "2512.03297", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03297", "abs": "https://arxiv.org/abs/2512.03297", "authors": ["Ramūnas Garunkštis", "Julija Paliulionytė"], "title": "Mean values of the Riemann zeta function at shifted zeros under the Riemann Hypothesis", "comment": null, "summary": "Assuming the Riemann hypothesis, we obtain asymptotic formulas for $\\sum_{0<γ<T}ζ(ρ+δ)ζ(1-ρ+\\overlineδ)$ in the region $-\\frac{a}{\\log T} \\leq \\Re δ\\leq \\frac{1}{2}+\\frac{a}{\\log T}$, $|\\Im δ|\\ll 1$. Unconditionally, this asymptotic formula was recently obtained by Garunkštis and Novikas in essentially the same region, with a slight incompleteness. Assuming RH, we obtain a sharper error term, and we also correct an inaccuracy in the unconditional error term there."}
{"id": "2512.03299", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2512.03299", "abs": "https://arxiv.org/abs/2512.03299", "authors": ["Justin Chen", "Heidi Goodson", "Rezwan Hoque", "Sabeeha Malikah"], "title": "Degeneracy and Sato-Tate groups of $y^2=x^{p^2}-1$", "comment": "15 pages, 1 figure. Comments are welcome!", "summary": "We say that an abelian variety is degenerate if its Hodge ring is not generated by divisor classes. Degeneracy leads to some interesting challenges when computing Sato-Tate groups, and there are currently few examples and techniques presented in the literature. In this paper we focus on the Jacobians of the family of curves $C_{p^2}: y^2=x^{p^2}-1$, where $p$ is an odd prime. Using a construction developed by Shioda in the 1980s, we are able to characterize so-called indecomposable Hodge classes as well as the Sato-Tate groups of these Jacobian varieties. Our work is inspired by computation, and examples and methods are described throughout the paper."}
{"id": "2512.03305", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03305", "abs": "https://arxiv.org/abs/2512.03305", "authors": ["Liyang Yang"], "title": "Spectral Reciprocity: A Fourier--Analytic Approach", "comment": "158 pages", "summary": "We develop a Fourier--analytic framework for establishing spectral reciprocity formulas linking $\\mathrm{GL}_3$ and $\\mathrm{GL}_2$ automorphic spectra over number fields. The method applies uniformly to cuspidal and non-cuspidal $\\mathrm{GL}_3$ representations and treats Motohashi-type and Blomer--Khan-type reciprocities in a parallel manner, revealing intrinsic connections between them and extending each to new settings. We also obtain explicit weight transforms in the analytic newvector and spherical cases. Applications include first-moment estimates for $\\mathrm{GL}_3\\times\\mathrm{GL}_2$ $L$-functions over number fields, an explicit twisted fourth moment for $\\mathrm{GL}_2$ $L$-functions over totally real fields, a sharp upper bound for the fifth moment, subconvexity for triple product $L$-functions, and new simultaneous nonvanishing results."}
{"id": "2512.03320", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.03320", "abs": "https://arxiv.org/abs/2512.03320", "authors": ["Chen Wan"], "title": "A relative trace formula identity for non-tempered spherical varieties", "comment": "22 pages, comments are welcome!", "summary": "In this paper, motivated by some previous works in residue method and the recent theory of the relative Langlands duality, we prove a relative trace formula identity that compares the period integral of non-tempered spherical varieties with the period integral of a tempered spherical varieties associated to a Levi subgroup. This allows us to incorporate numerous relative trace formula comparisons studied during the last four decades under the relative Langlands duality framework. We will also propose a conjectural comparison for general non-tempered Hamiltonian spaces."}
{"id": "2512.03327", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03327", "abs": "https://arxiv.org/abs/2512.03327", "authors": ["Andreea Iorga", "Ravi Ramakrishna"], "title": "Increasing the Size of Tame Shafarevich Groups", "comment": null, "summary": "Let $K$ be a number field with a finite set $S$ of primes. We study the cohomology of $\\mathbb{F}_p[G_{K,S}]$-modules $A$, in particular the Shafarevich groups $\\Sha^i_S(K,A)$ for $i=1,2$ for tame sets $S$, i.e., for sets $S$ that contain no primes above $p$. When $S$ contains all primes above $p$ (the ``wild'' setting), it is a consequence of global Poitou-Tate duality that $\\Sha^1_S(K,A')^\\vee \\simeq \\Sha^2_S(K,A) \\stackrel{\\simeq}{\\hookrightarrow} \\RusB_S(K,A) $ is non-increasing as $S$ increases. The same applies when $G_{K,S}$ is replaced by its maximal pro-$p$ quotient $G_{K,S}(p)$. In [4] it was shown that for $S$ tame and $A=\\mathbb{F}_p$ with trivial action, the group $\\Sha^2_S(K, A)$ can increase as $S$ increases to $S\\cup X$, and even attain its maximal dimension, $\\dim_{\\mathbb{F}_p} \\RusB_S(K,\\mathbb{F}_p)$, for carefully chosen $X$. We strengthen this to general $\\mathbb{F}_p[G_{K,S}]$-modules $A$ where $S$ is tame. We use Liu's definition [7] of $\\RusB_S(K,A)$ to show that $\\Sha^2_S(K,A) \\hookrightarrow \\RusB_S(K,A)$ and that there exist infinitely many tame sets of primes $X$ of $K$ such that $\\Sha^2_{S\\cup X}(K,A) \\stackrel{\\simeq}{\\hookrightarrow} \\RusB_{S \\cup X}(K,A) \\stackrel{\\simeq}{\\twoheadleftarrow} \\RusB_S(K,A) \\hookleftarrow \\Sha^2_S(K,A)$."}
{"id": "2512.03412", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2512.03412", "abs": "https://arxiv.org/abs/2512.03412", "authors": ["Henry H. Kim", "Takuya Yamauchi"], "title": "Ikeda type lift on $\\SO(3,n+1)$", "comment": "53 pages", "summary": "By using Ikeda's theory for a compatible family of Eisenstein series, we explicitly construct Ikeda type lifts on the special orthogonal group $G=\\SO(3,n+1)$ over $\\Q$ with $n\\ge 3$ which splits everywhere at finite places. Our lifts are Hecke eigen cusp forms of weight $l$ ($l\\ge n+2$, even) and come from elliptic newforms with respect to $\\SL_2(\\Z)$ which are of weight $l-\\frac{n-2}{2}$ when $n$ is even and\n  $2l-n+1$ when $n$ is odd."}
{"id": "2512.03432", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03432", "abs": "https://arxiv.org/abs/2512.03432", "authors": ["José Cruz"], "title": "Classification of totally real number fields via their zeta function, regulator, and log unit lattice", "comment": "24 pages. Comments are welcome!", "summary": "In this paper, assuming the weak Schanuel Conjecture (WSC), we prove that for any collection of pairwise non-arithmetically equivalent totally real number fields, the residues at $s=1$ of their Dedekind zeta functions form a linearly independent set over the field of algebraic numbers. As a corollary, we obtain that, under WSC, two totally real number fields have the same regulator if and only if they have the same class number and Dedekind zeta function. We also prove that, under WSC, the isometry and similarity classes of the log unit lattice of a real Galois number field of degree $[K:\\Q]\\geq 4$, characterize the isomorphism class of said field. All of our results follow from establishing that, under WSC, any Gram matrix of the log unit lattice of a real Galois number field yields a generic point of certain closed irreducible $\\Q$-subvariety of the space of symmetric matrices of appropriate size."}
{"id": "2512.03441", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03441", "abs": "https://arxiv.org/abs/2512.03441", "authors": ["Kin Ming Tsang", "Chi Hoi Yip"], "title": "Bipartite Diophantine tuples and their applications", "comment": "21 pages", "summary": "This paper investigates bipartite variants of generalized Diophantine tuples and their applications. We generalize a result of Bugeaud--Dujella on a special family of bipartite Diophantine tuples and affirmatively resolve a related question posed by the second author. Additionally, we establish new connections between bipartite Diophantine tuples and several known variants of Diophantine tuples, including those introduced by Banks--Luca--Szalay and Kihel--Kihel."}
{"id": "2512.03468", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03468", "abs": "https://arxiv.org/abs/2512.03468", "authors": ["Tyler Ross", "Zhongyan Shen", "Tianxin Cai"], "title": "Cyclotomic Congruences and Lucas Sequences", "comment": "21 pages, 1 table, 1 figure", "summary": "In this paper, we extend the $p$-adic valuations originally obtained by Carmichael for the sequences obtained by applying Möbius inversion to Lucas sequences to $p$-adic congruences, from which we immediately derive corresponding congruences for Lucas sequences. As a corollary, we also establish some constraints on the entry point behavior of primes in Lucas sequences, on the basis of which we conjecture the presence of a strong Chebyshev-like bias in real regular Lucas sequences."}
{"id": "2512.03481", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03481", "abs": "https://arxiv.org/abs/2512.03481", "authors": ["Tyler Ross", "Zhongyan Shen", "Tianxin Cai"], "title": "The $p$-adic Valuations of Möbius Duals of Lucas Sequences", "comment": "10 pages, 0 figures", "summary": "In this paper, we extend the $p$-adic valuations of the Möbius duals of Lucas sequences, originally obtained by Carmichael for regular Lucas sequences to irregular Lucas sequences. We conclude with a brief observation about the relationship of these valuations to the existence of Wall-Sun-Sun primes."}
{"id": "2512.03482", "categories": ["math.NT", "math.AP"], "pdf": "https://arxiv.org/pdf/2512.03482", "abs": "https://arxiv.org/abs/2512.03482", "authors": ["Jiaqi Hou"], "title": "Kakeya-Nikodym norms of Maass forms on $\\rm{U}(2,1)$", "comment": null, "summary": "Let $ψ$ be a Hecke-Maass form with a large spectral parameter on a compact arithmetic complex hyperbolic surface. We apply the amplification method to obtain a power saving over the trivial bound for the Kakeya-Nikodym norm of $ψ$. As a consequence, we obtain power savings over the local bound of Sogge for $\\|ψ\\|_p$ when $2<p<10/3$."}
{"id": "2512.03490", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03490", "abs": "https://arxiv.org/abs/2512.03490", "authors": ["Anders Mah"], "title": "Counting rational points on affine hypersurfaces", "comment": null, "summary": "We prove an upper bound for the number of rational points of bounded height on irreducible affine hypersurfaces. More precisely, given an irreducible polynomial $f \\in \\mathbb{Z}[X_1, \\dots, X_n]$, we prove an upper bound on the number of points $(x_1, \\dots, x_n) \\in \\mathbb{Q}^n$ such that $f(x_1, \\dots, x_n) = 0$ and each component has height at most $B$. To prove this, we require a quantitative form of Hilbert's irreducibility theorem, where we bound the number of reducible specialisations of an irreducible polynomial at rational points of bounded height."}
{"id": "2512.03498", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03498", "abs": "https://arxiv.org/abs/2512.03498", "authors": ["Michael A. Bennett"], "title": "Arithmetic progressions in sumsets of geometric progressions", "comment": "31 pages", "summary": "If $a$ and $b$ are integers with $b>a>1$, we completely characterize ``long'' arithmetic progressions in the sumsets of the geometric progressions $1, a, a^2, a^3, \\ldots$ and $1, b, b^2, b^3, \\ldots$. Our proofs utilize recent applications of bounds for linear forms in logarithms to $S$-unit equations, and consequences of the modularity of Frey-Hellegouarch curves, together with elementary arguments."}
{"id": "2512.03782", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.03782", "abs": "https://arxiv.org/abs/2512.03782", "authors": ["Marco Adamo Seveso"], "title": "On the p-adic integration over Igusa towers of Siegel modular varieties", "comment": null, "summary": "We develop an explicit $p$-adic integration theory for Igusa towers of modular Siegel manifolds, which finds applications to explicit reciprocity laws."}
{"id": "2512.04026", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.04026", "abs": "https://arxiv.org/abs/2512.04026", "authors": ["Esther Banaian"], "title": "Orderings of k-Markov Numbers", "comment": "27 pages, many figures, comments are very welcome!", "summary": "The $k$-Markov numbers, introduced by Gyoda and Matsushita, are those which appear in positive integral solutions to $x^2 + y^2 + z^2 + k(xy + xz + yz) = (3+3k)xyz$. When $k =0$, this recovers the ordinary Markov numbers. A long-standing question in the theory of Markov numbers is Frobenius's unicity conjecture, concerning whether every Markov number is the maximum in a unique solution triple. Aigner gave a series of weaker, related conjectures which were confirmed to be true by Lee, Li, Rabideau, and Schiffler using techniques from the theory of cluster algebras. We show here that $k$-Markov numbers also satisfy Aigner's conjectures."}
{"id": "2512.04081", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.04081", "abs": "https://arxiv.org/abs/2512.04081", "authors": ["Joseph Harrison"], "title": "Additive relations in irrational powers", "comment": "18 pages, comments welcome", "summary": "We investigate the additive theory of the set $S = \\{1^c, 2^c, \\dots, N^c\\}$ when $c$ is a real number. In the language of additive combinatorics, we determine the asymptotic behaviour of the additive energy of $S$. When $c$ is rational, this is either known, or follows from existing results, and our contribution is a resolution of the irrational case. We deduce that for all $c \\not \\in \\{0, 1, 2\\}$, the cardinality of the sumset $S + S$ asymptotically attains its natural upper bound $N(N + 1)/2$, as $N \\to \\infty$. We show that there are infinitely many, effectively computable numbers $c$ such that the set $\\{p^c : \\textrm{$p$ prime}\\}$ is additively dissociated (actually linearly independent over $\\mathbb{Q}$), and we provide an effective procedure to compute the digits of such $c$."}
