{"id": "2512.10658", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2512.10658", "abs": "https://arxiv.org/abs/2512.10658", "authors": ["Wei Wang"], "title": "Recurrence and congruences for the smallest part function", "comment": null, "summary": "Let $\\operatorname{spt}(n)$ be the number of smallest parts in the partitions of $n$. In this paper, we give some generalized Euler-like recursive formulas for the $\\operatorname{spt}$ function in terms of Hecke trace of values of special twisted quadratic Dirichlet series. As a corollary, we give a closed form expressions of the power series $\\sum_{n\\geq 0}\\operatorname{spt}(\\ell n-δ_{\\ell})q^n\\pmod{\\ell}$, $δ_{\\ell}:=(\\ell^2-1)/24$, by Hecke traces for weight $\\ell+1 $ cusp forms on $\\operatorname{SL}_2(\\mathbb{Z})$. We further establish an incongruence result for the $\\operatorname{spt}$ function."}
{"id": "2512.10661", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.10661", "abs": "https://arxiv.org/abs/2512.10661", "authors": ["Colin Faverjon", "Julien Roques"], "title": "A purity theorem for Mahler equations", "comment": null, "summary": "The principal aim of this paper is to establish a purity theorem for Mahler functions that is reminiscent of famous purity theorems for G-functions by D. and G. Chudnovsky and for E-functions (and, more generally, for holonomic arithmetic Gevrey series) by Y. Andr{é}. Our approach is based on a preliminary study of independent interest of the nature of the solutions of Mahler equations. Roughly speaking, we prove a reduction result for Mahler systems, implying that any Mahler equation admits a complete basis of solutions formed of what we call generalized Mahler series. These are sums involving Puiseux series, Hahn series of a very special type and solutions of inhomogeneous equations of order 1 with constant coefficients. In the light of B. Adamczewski, J. P. Bell and D. Smertnig's recent height gap theorem, we introduce a natural filtration on the set of generalized Mahler series according to the arithmetic growth of the coefficients of the Puiseux series involved in their decomposition. This filtration has five pieces. Our purity theorem states that the membership of a generalized Mahler series to one of the three largest pieces of this filtration propagates to any other generalized Mahler series solution of its minimal Mahler equation. We also show that this statement does not extend to the smallest two pieces."}
{"id": "2512.10781", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2512.10781", "abs": "https://arxiv.org/abs/2512.10781", "authors": ["Nuno Freitas", "Diana Mocanu", "Ignasi Sanchez-Rodriguez"], "title": "Revisiting the equation $x^2+y^3=z^p$", "comment": null, "summary": "Let $E/\\mathbb Q$ be an elliptic curve and $p \\geq 3$ a prime. The modular curve $X_E^-(p)$ parameterizes elliptic curves with $p$-torsion modules anti-symplectically isomorphic to $E[p]$. The work of Freitas--Naskręcki--Stoll uses the modular method to show that all primitive non-trivial solutions of the Fermat-type equation $x^2 + y^3 = z^p$ give rise to rational points on $X_E^-(p)$ with $E \\in \\{27a1,54a1,96a1,288a1,864a1,864b1,864c1 \\}$. Using a criterion classifying the existence of local points due to the first two authors, we show that, for $E$ any of the curves with conductor 864 and certain primes $p \\equiv 19 \\pmod{24}$, we have $X_E^-(p)(\\mathbb Q_\\ell) = \\emptyset$. Furthermore, for each $E$ in the list and any $p$, we prove that either $X_E^-(p)$ can be discarded using the same criterion, or it cannot be discarded using purely local information."}
{"id": "2512.10556", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2512.10556", "abs": "https://arxiv.org/abs/2512.10556", "authors": ["Minoru Wakimoto"], "title": "A note on modular properties of non-principal and non-coprincipal admissible $C^{(1)}_2$-modules of integer level", "comment": null, "summary": "For the affine Lie algebra $C_2^{(1)}$ we study non-principal and non-coprincipal admissible modules of integer level and their quantum Hamiltonian reduction, and show that they have $Γ_0(2)$-modular invariance."}
{"id": "2512.10202", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2512.10202", "abs": "https://arxiv.org/abs/2512.10202", "authors": ["Jun Hu", "Huansheng Li"], "title": "Standard symmetrizing forms and Murphy bases of the cyclotomic Hecke algebras", "comment": null, "summary": "In this paper we compute the explicit value of the standard symmetrizing form of the cyclotomic Hecke algebra of type $G(\\ell,1,n)$ on each Murphy basis element. We do this for both the non-degenerate cyclotomic Hecke algebra of type $G(\\ell,1,n)$ and the degenerate cyclotomic Hecke algebra of type $G(\\ell,1,n)$. As an application, we obtain some equations on the coefficients which occur in the transition matrix between the Murphy basis elements and the seminormal basis elements of the cyclotomic Hecke algebra of type $G(\\ell,1,n)$."}
{"id": "2512.10556", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2512.10556", "abs": "https://arxiv.org/abs/2512.10556", "authors": ["Minoru Wakimoto"], "title": "A note on modular properties of non-principal and non-coprincipal admissible $C^{(1)}_2$-modules of integer level", "comment": null, "summary": "For the affine Lie algebra $C_2^{(1)}$ we study non-principal and non-coprincipal admissible modules of integer level and their quantum Hamiltonian reduction, and show that they have $Γ_0(2)$-modular invariance."}
