{"id": "2601.20027", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20027", "abs": "https://arxiv.org/abs/2601.20027", "authors": ["Jorge Antonio González Layja"], "title": "On the Evaluation of Apéry-Like Series Involving Multiple $t$-Harmonic Star Sums", "comment": null, "summary": "We evaluate, by elementary means, a new family of Apéry-like series involving multiple $t$-harmonic star sums of even weight. Using trigonometric expansions, inverse tangent integrals, and binomial recurrences, we obtain explicit closed-form evaluations of these series as finite alternating sums of products of Dirichlet beta values. Several explicit examples are derived as corollaries."}
{"id": "2601.20122", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20122", "abs": "https://arxiv.org/abs/2601.20122", "authors": ["Vefa Goksel", "Rafe Jones"], "title": "On the Arithmetic of Bicritical Rational Functions", "comment": null, "summary": "Bicritical rational functions -- those with precisely two critical points -- include the well-studied families of unicritical polynomials and quadratic rational functions. In this article we lay out general foundations for studying arithmetic dynamical properties of bicritical rational functions, and prove new Galois-theoretic results for a family with special properties. We study the field of definition of the critical points, and give a normal form up to Möbius conjugacy over this field. As a corollary, we show that after a finite extension of the ground field, the arboreal Galois representation attached to a bicritical rational function injects into an iterated wreath product of cyclic groups. We then examine the family of quadratic $φ\\in \\mathbb{Q}(x)$ with critical points $γ_1$ and $γ_2$ such that $φ(γ_1) = γ_2$. Adapting methods of Odoni-Stoll in the polynomial case to rational functions, we show that the arboreal representation is surjective for an infinite subfamily."}
{"id": "2601.20264", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20264", "abs": "https://arxiv.org/abs/2601.20264", "authors": ["R. Padhy", "S. S. Rout"], "title": "Uniform bounds on $S$-integral points in backward orbits", "comment": null, "summary": "Let $K$ be a number field with algebraic closure $\\overline{K}$ and let $S$ be a finite set of places of $K$ containing all the archimedean places. It is known from Silverman's result that a forward orbit of a rational map $\\varphi$ contains finitely many $S$-integers in the number field K when $\\varphi^2$ is not a polynomial. Sookdeo stated an analogous conjecture for the backward orbits of a rational map $\\varphi$ using a general $S$-integrality notion based on the Galois conjugates of points. He proved his conjecture for the power map $\\varphi(z) =z^d$ for $d \\geq 2$ and consequently for Chebyshev maps (J. Number Theory 131 (2011), 1229-1239). In this paper, we establish uniform bounds on the number of $S$-integral points in the backward orbits of any non-zero $β$ in $K$, relative to a non-preperiodic point $α\\in \\mathbb{P}^1(\\overline{K})$, under the power map $\\varphi(z) =z^d $."}
{"id": "2601.20395", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20395", "abs": "https://arxiv.org/abs/2601.20395", "authors": ["Yufan Luo"], "title": "Remarks on the Boston Unramified Fontaine-Mazur Conjecture, II", "comment": "20 pages", "summary": "In this paper, we investigate Boston's generalization of the unramified Fontaine-Mazur conjecture for Galois representations. From a group-theoretic perspective, we first show that the conjecture can be reduced to the case of certain distinguished classes of $p$-adic analytic groups and $\\mathbb{F}_{p}[[T]]$-adic analytic groups. Specifically, these are open subgroups of the groups of integral points of absolutely simple algebraic groups defined over non-Archimedean local fields. Furthermore, we provide a group-theoretic interpretation of the conjecture in terms of the virtually Golod-Shafarevich property. Finally, we establish a local-global principle and a prime-to-adjoint principle for the conjecture."}
{"id": "2601.20344", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.20344", "abs": "https://arxiv.org/abs/2601.20344", "authors": ["Jan Frahm", "Robin van Haastrecht", "Clemens Weiske", "Genkai Zhang"], "title": "On the degenerate principal series of $G_{2(2)}$ induced from a Heisenberg parabolic subgroup", "comment": "29 pages, 4 figures", "summary": "We study degenerate principal series representations of the split real group $G_{2(2)}$ induced from a character of a maximal parabolic subgroup whose unipotent radical is a Heisenberg group. Using the Lie algebra action on the space of $K$-finite vectors, we find the points of reducibility and the complementary series. The minimal representation and a limit of discrete series are identified as kernel of the corresponding Knapp-Stein intertwining operator. Moreover, we show that some quaternionic discrete series representations occur as the subrepresentation on which the family of intertwining operators vanishes of order two."}
{"id": "2601.20536", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20536", "abs": "https://arxiv.org/abs/2601.20536", "authors": ["Supriya Pisolkar", "Biswanath Samanta"], "title": "A universal construction of $p$-typical Witt vectors of associative rings", "comment": "17 pages, comments are welcome", "summary": "For a prime $p$ and an associative ring $R$ with unity, there are various constructions of $p$-typical Witt vectors of $R$, all of which specialize to the classical $p$-typical Witt vectors when $R$ is commutative. These constructions are endowed with a Verschiebung operator $V$ and a Teichmüller map $\\langle \\cdot \\rangle$, and they satisfy the property that the map $x \\mapsto V\\langle x^p\\rangle - p\\langle x \\rangle$ is additive. In this paper, we adapt the group-theoretic universal characterization of classical $p$-typical Witt vectors proposed in arXiv:2405.12680 to the non-commutative setting. Our main result is that this approach yields a construction of Witt vectors for associative rings, denoted $E$, which specializes correctly to the classical Witt functor in the commutative case. The construction of $E$ is inspired by the Witt functor of Cuntz--Deninger, and we show that $E$ is a universal pre-Witt functor, subject to an explicit conjecture concerning non-commutative polynomials. We further introduce the notion of a Witt functor and construct a universal Witt functor $\\hat{E}$, which is closely related to Hesselholt's Witt functor $W_H$. We suspect that $W_H$ is, in fact, the universal Morita-invariant Witt functor."}
{"id": "2601.20384", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.20384", "abs": "https://arxiv.org/abs/2601.20384", "authors": ["Jean-Yves Ducloux"], "title": "The Orbit Method and Character Formulas for Tempered representations of a Nonconnected Reductive Real Algebraic Group", "comment": null, "summary": "Let G be a possibly disconnected reductive real Lie group. In this paper, I parametrize the set of irreductible tempered characters of G. I then describe these characters using certain ``Kirillov's formulas,'' based on the descent method near each elliptic element in G. If G is linear and connected, the parameters I use are ``final basic'' parameters in the sense of Knapp and Zuckerman."}
{"id": "2601.20543", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20543", "abs": "https://arxiv.org/abs/2601.20543", "authors": ["Hsin-Yi Yang"], "title": "CM-liftability of simple superspecial abelian surfaces over prime fields", "comment": "51 pages", "summary": "For any prime $p>0$, we prove that simple superspecial abelian surfaces over $\\mathbb{F}_{p}$ admit CM liftings after base change at most to $\\mathbb{F}_{p^2}$, by using the residual reflex condition (RRC) and Lie types. The CM-liftability of ordinary simple abelian surfaces is proved by Serre-Tate, and the CM-liftability of almost ordinary simple abelian surfaces is proved by Oswal-Shankar and Bergström-Karemaker-Marseglia, respectively. As there can only be ordinary, almost ordinary, or supersingular simple abelian surfaces over $\\mathbb{F}_{p}$, our work is another step to complete the CM-liftability of simple abelian surfaces over $\\mathbb{F}_{p}$."}
{"id": "2601.20635", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.20635", "abs": "https://arxiv.org/abs/2601.20635", "authors": ["Kei Yuen Chan", "Mohammed Saad Qadri"], "title": "An inductive Ext non-vanishing theorem for the $p$-adic general linear group", "comment": null, "summary": "We study some homological properties of the parabolic induction functor for the $p$-adic general linear group. We obtain an embedding theorem of Ext-groups in the context of parabolic induction. As an application, we establish and prove a variation of the non-tempered Gan-Gross-Prasad conjecture in homological branching laws for $p$-adic general linear groups."}
{"id": "2601.20644", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20644", "abs": "https://arxiv.org/abs/2601.20644", "authors": ["Anna Chiara Lai", "Paola Loreti"], "title": "Properties of a random Cantor set with overlaps", "comment": null, "summary": "We study the topology and the Hausdorff dimension of a random Cantor set with overlaps, generated by an iterated function system with scaling ratio equal to the Golden Mean. The results extend known formulas to a case where the Open Set Condition fails. Our methodology is based on the theory of expansions in non-integer bases."}
{"id": "2601.20744", "categories": ["math.RT", "math.AG", "math.AT", "math.CT"], "pdf": "https://arxiv.org/pdf/2601.20744", "abs": "https://arxiv.org/abs/2601.20744", "authors": ["Juan Omar Gómez", "Maurcio Medina-Barcenas", "Greg Stevenson", "Bernardo Villarreal", "Ángel Zaldivar-Corichi"], "title": "Geometric purity and the frame of smashing ideals", "comment": "29 pages, comments welcome", "summary": "We introduce the notion of geometric purity in rigidly-compactly generated tt-categories by considering exact triangles that are pure at each tt-stalk. We develop a systematic study of this concept, including examples and applications. In particular, we show that geometric purity is, in general, strictly stronger than ordinary purity, and that it naturally leads to the notion of geometrically pure-injective objects. We prove that such objects arise as pushforwards of pure-injective objects from suitable tt-stalks. Moreover, we give a detailed analysis of indecomposable geometrically pure-injective objects in the derived category of the projective line. Under mild additional assumptions, we identify the geometric part of the Ziegler spectrum as a closed subset.\n  As an application, we demonstrate that this new notion of purity can be used to tackle the problem of spatiality of the frame of smashing ideals via the geometric Ziegler spectrum. In particular, we show that our approach rules out the counterexamples of Balchin and Stevenson to existing methods."}
{"id": "2601.20743", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.20743", "abs": "https://arxiv.org/abs/2601.20743", "authors": ["Hajime Kaneko", "Yuta Suzuki", "Yohei Tachiya"], "title": "Refinements of Erdős's irrationality criterion for certain sparse infinite series", "comment": "20 pages", "summary": "In this paper, we establish new irrationality criteria for certain sparse power series. As applications of these criteria, we generalize a result of Erdős and obtain several irrationality results for various infinite series involving the classical arithmetic functions. For example, we prove that for any integers $t\\ge2$ and $k\\geq0$, the numbers \\[ \\sum_{n=1}^{\\infty} \\frac{d(n)^k}{t^{σ(n)}} \\quad\\text{and}\\quad \\sum_{n=1}^{\\infty} \\frac{d(n)^k}{t^{φ(n)}} \\] are both irrational, where $d(n)$, $σ(n)$, and $φ(n)$ denote the number of divisors, the sum of divisors, and Euler's totient functions, respectively."}
{"id": "2601.20824", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.20824", "abs": "https://arxiv.org/abs/2601.20824", "authors": ["Zhao Yu Ma", "Jit Wu Yap", "Jeff Achter", "Julia Gordon"], "title": "On the pointwise convergence of the number of abelian varieties over $\\mathbb{F}_p$ with fixed trace", "comment": "56 pages; Main text by Ma and Yap; Appendix by Achter and Gordon", "summary": "Extending Katz-Sarnak heuristics, Ballini-Lombardo-Verzobio [BLV25] conjectures a limiting distribution as $p \\to \\infty$ for $\\# A_g(\\mathbb F_p,t)$, the number of $g$-dimensional PPAVs over $\\mathbb F_p$ with trace $t$, as a product of natural local factors $v_\\ell(t)$ for non-archimedean places $\\ell$ and the Sato-Tate measure $\\text{ST}_g$ corresponding to $\\infty$. We prove that their conjecture is true for all $g$. As a consequence, we obtain analogous results on the distribution of curves of genus $2$ and $3$, answering questions of Bergström-Howe-García-Ritzenthaler [BHLR24] and [BLV25]."}
