{"id": "2601.16232", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.16232", "abs": "https://arxiv.org/abs/2601.16232", "authors": ["Jorge Antonio González Layja"], "title": "Closed-Form Evaluation of Two Apéry-Like Series of Weight 4", "comment": null, "summary": "This paper presents closed-form evaluations of two new Apéry-like series of weight $4$ that involve harmonic numbers of the form $H_{2k}$. Several key results are derived and subsequently used to establish connections to the main series."}
{"id": "2601.16352", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.16352", "abs": "https://arxiv.org/abs/2601.16352", "authors": ["Anubhav Sharma", "Mohit Tripathi", "Lalit Vaishya"], "title": "Sparse Distribution of Coefficients of $\\ell$-fold Product $L$-functions at Integers Represented by Quadratic Forms", "comment": null, "summary": "Let $f \\in S_{k}(Γ_{0}(N))$ be a normalized Hecke eigenform. We study the Fourier coefficients $λ_{f \\otimes \\cdots \\otimes_{\\ell} f}(n)$ of the $\\ell$-fold product $L$-function for odd $\\ell \\ge 3$. Our focus is the distribution of this sequence over the sparse set of integers represented by a primitive, positive-definite binary quadratic form $Q$ of a fixed discriminant $D$. We establish an explicit upper bound for the summatory function of these coefficients, with dependencies on the weight, level, and discriminant. As a key application, we provide a bound for the first sign change of the sequence in this setting. We also generalize this result to find the first sign change among integers represented by any of the $h(D)$ forms of discriminant $D$, showing the bound improves as the class number increases."}
{"id": "2601.16591", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.16591", "abs": "https://arxiv.org/abs/2601.16591", "authors": ["David Corwin", "Ishai Dan-Cohen"], "title": "$p$-adic Periods and Selmer Scheme Images", "comment": "Comments and corrections welcome!", "summary": "The Chabauty--Kim method was developed with the aim of approaching effective Faltings', the problem of explicitly determining the finite set of rational points on a hyperbolic curve. This method has seen success with the more particular Quadratic Chabauty method, but this method still applies only to certain curves. Previous applications of Chabauty--Kim beyond the quadratic level, as pursued by the authors, by S. Wewers, and by others, use mixed Tate motives and the $p$-adic period map of Chatzistamatiou-Ünver to approach the particular hyperbolic curve $\\mathbb{P}^1\\setminus\\{0,1,\\infty\\}$.\n  The main purpose of this article is to lay foundations for extending the above approach to more general hyperbolic curves, in particular by defining an analogous $p$-adic period map for more general categories of motives and their non-conjectural cousins such as systems of realizations and $p$-adic Galois representations. We use this to describe a general setup for non-abelian Chabauty for an arbitrary hyperbolic curve.\n  Our period map also connects the study of $p$-adic iterated integrals with Goncharov's theory of motivic iterated integrals, and allows us to investigate Goncharov's conjectures from a $p$-adic point of view. In particular, it suggests the possibility of evaluating syntomic regulators by writing elements of $K$-theory in terms of motivic iterated integrals. Lastly, it forms the basis for a certain generalization of the $p$-adic period conjecture of Yamashita for mixed Tate motives well-suited to applications in Chabauty--Kim theory."}
{"id": "2601.16626", "categories": ["math.NT", "math.SP"], "pdf": "https://arxiv.org/pdf/2601.16626", "abs": "https://arxiv.org/abs/2601.16626", "authors": ["Jorma K. Merikoski", "Pentti Haukkanen", "Antonio Sasaki", "Timo Tossavainen"], "title": "On generalized eigenvalues of MAX matrices to MIN matrices and of LCM matrices to GCD matrices", "comment": null, "summary": "We determine, for any n $\\ge$ 1, the generalized eigenvalues of an n x n MAX matrix to the corresponding MIN matrix. We also show that a similar result holds for the generalized eigenvalues of an nxn LCM matrix to the corresponding GCD matrix when n $\\le$ 4, but breaks down for n > 4. In addition, we prove Cauchy's interlacing theorem for generalized eigenvalues, and we conjecture an unexpected connection between the OEIS sequence A004754 and the appearance of -1 as a generalized eigenvalue in the LCM-GCD setting."}
{"id": "2601.16742", "categories": ["math.RT", "math.AC", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.16742", "abs": "https://arxiv.org/abs/2601.16742", "authors": ["Vladimir Shchigolev"], "title": "Homomorphisms between Bott-Samelson bimodules corresponding to sequences of reflections", "comment": null, "summary": "We study the space of all bimodule homomorphisms $R_x\\otimes_R R(\\underline{t})\\otimes_R R_y\\to R_z\\otimes_R R(\\underline{t}')\\otimes_R R_w$ as a one-sided module, where $R_x,R_y,R_z,R_w$ are standard twisted bimodules and $R(\\underline{t})$ and $R(\\underline{t}')$ are the Bott-Samelson bimodules corresponding to sequences of reflections $\\underline{t}$ and $\\underline{t}'$ respectively. We prove that this module is always reflexive under some reasonable restrictions on the representation of the underlying Coxeter group.\n  However, unlike the case where $\\underline{t}$ and $\\underline{t}'$ contain only simple reflections, this module does not need any longer to be free. We provide a series of counterexamples already for the symmetric groups $S_n$, where $n\\ge4$. The projective dimension of the modules dual to them is $n-3$ and thus serves to measure the deviation from the free modules.\n  When placed within a geometric framework, these examples show how to find fibers of points fixed by the compact torus in the Bott-Samelson resolutions (as in the original definition by Raoul Bott and Hans Samelson) with non-vanishing odd cohomology."}
{"id": "2601.16757", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.16757", "abs": "https://arxiv.org/abs/2601.16757", "authors": ["Saša Novaković"], "title": "The Diophantine equation $P(x)=\\overset{r}{\\underset{i=1}{\\prod}}H_{n_i}$", "comment": "9 pages, comments are welcome!", "summary": "Naciri proved that for any integer $k\\geq2$, the Brocard--Ramanujan equation $n!+1=x^2$ has only finitely many integer solutions, assuming $x\\pm1$ is a $k$-free integer or a prime power. In the present paper we prove similar statements for equations of the form $P(x)=\\prod_{i=1}^rH_{n_i}$, where $P(x)$ is a polynomial and $H_{n_i}$ are divisible sequences."}
{"id": "2601.16889", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2601.16889", "abs": "https://arxiv.org/abs/2601.16889", "authors": ["Nicolas Jacon", "Abel Lacabanne"], "title": "On the computation of the canonical basis for irreducible highest weight $U_q (\\mathfrak{gl}_{\\infty})$-module", "comment": "25 pages, comments welcome", "summary": "We study canonical basis elements in higher-level Fock spaces associated with the quantum group $U_q(\\mathfrak{gl}_\\infty)$, which are conjecturally related to Calogero-Moser theory for complex reflection groups. We generalize the Leclerc-Miyachi formula to arbitrary levels by introducing new explicit constructions based on symbols, including a column removal theorem and closed formulas in several cases. These results provide explicit descriptions of canonical basis elements with applications to Calogero-Moser cellular characters and to the decomposition matrices of Ariki-Koike algebras."}
{"id": "2601.16770", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.16770", "abs": "https://arxiv.org/abs/2601.16770", "authors": ["Pawel Grzegrzolka", "Jeffrey L. Meyer"], "title": "Sums of Reciprocals of Generalized Triangular Numbers", "comment": "17 pages", "summary": "We compute the sum and the alternating sum of the reciprocals of triangular numbers using two methods: a telescoping series approach and a power series approach. We then extend these results to generalized (higher-order) triangular numbers and obtain closed-form expressions for both the non-alternating and alternating series in all orders."}
{"id": "2601.16937", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.16937", "abs": "https://arxiv.org/abs/2601.16937", "authors": ["Joseph Baine", "Chris Hone"], "title": "The geometry of tilting composition series via Richardson varieties", "comment": null, "summary": "We prove the (graded) Jordan-Hölder multiplicities of (mixed) tilting sheaves on flag varieties admit a geometric interpretation as the hypercohomology of certain sheaves on Richardson varieties in the Langlands dual flag variety. These sheaves are a motivic variant of geometric extensions, and provide a replacement for parity sheaves on the Richardson variety. We also provide an explicit formula for these multiplicities in terms of $\\ell$-Kazhdan-Lusztig polynomials."}
{"id": "2601.16929", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.16929", "abs": "https://arxiv.org/abs/2601.16929", "authors": ["Gabriele Bogo", "Yingkun Li"], "title": "Partial Hasse invariants for genus zero curves in Hilbert modular varieties", "comment": null, "summary": "We construct characteristic-zero lifts of partial Hasse invariants for genus zero non-compact curves in Hilbert modular varieties. The construction is based on recent results on the associated Picard-Fuchs differential equations. As an application, we relate the size of the non-ordinary locus of the modulo $p$ reduction of these curves to the dimension of spaces of (twisted) modular forms. We compute it explicitly for several Teichmüller curves, obtaining Deuring-like formulae. Moreover, we study the modulo $p$ reduction of (twisted) modular forms on not necessarily arithmetic genus-zero Fuchsian groups with modular embedding."}
{"id": "2601.16944", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.16944", "abs": "https://arxiv.org/abs/2601.16944", "authors": ["Gabriele Bogo", "Yingkun Li"], "title": "Atkin polynomials for families of abelian varieties with real multiplication", "comment": null, "summary": "Generalizing the work of Atkin and Kaneko-Zagier in the elliptic case, we describe the non-ordinary locus of a genus-zero non-compact curve $Y$ in a Hilbert modular variety in terms of the zeros of generalized Atkin's orthogonal polynomials. The argument relies on the recent construction of lifts of partial Hasse invariants for $Y$. We further describe these orthogonal polynomials as denominators of Padé approximants to the logarithmic derivatives of solutions of the Picard-Fuchs differential equations associated with $Y$. This provides a new link between Padé approximation and the geometry of the non-ordinary locus, extending a classical observation of Igusa for the Legendre family and applying, in particular, to situations where the Picard-Fuchs equations do not admit modular solutions. As applications, we determine the three-term recurrence relations for Atkin polynomials attached to triangle curves via hypergeometric identities, and compute the supersingular locus of a double cover of the Teichmüller curve $W_{17}$. In the latter case, we conjecture that the associated supersingular polynomial is self-reciprocal, implying that supersingular points occur in pairs."}
{"id": "2601.16972", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.16972", "abs": "https://arxiv.org/abs/2601.16972", "authors": ["Wouter van Doorn"], "title": "On the length of an interval that contains distinct multiples of the first $n$ positive integers", "comment": "2 pages", "summary": "Confirming a conjecture by Erd\\H os and Pomerance, we prove that there exist intervals of length $\\frac{cn\\log n}{\\log \\log n}$ that do not contain distinct multiples of $1, 2, \\ldots, n$."}
{"id": "2601.16975", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.16975", "abs": "https://arxiv.org/abs/2601.16975", "authors": ["Nils Bruin", "Brendan Creutz"], "title": "Explicit Brauer-Manin obstructions on plane quartics", "comment": null, "summary": "We describe a method to show a plane quartic over a number field has no rational points. The method can be adapted to show that a curve does not have divisors of degree 1 or 2 and can be generalized to arbitrary smooth projective curves. Our approach significantly improves on the applicability over previous 2-cover descent methods by not requiring the computation of the full $S$-unit group of the étale algebras involved. We illustrate the practicality with several examples, including examples where we determine plane quartics to be of index 2 or 4 when the maximum local index is strictly smaller."}
