{"id": "2602.02911", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.02911", "abs": "https://arxiv.org/abs/2602.02911", "authors": ["Julia Brandes", "Trevor D. Wooley"], "title": "Structure and paucity in affine diagonal systems, I", "comment": "17 pages", "summary": "Let $\\varepsilon>0$ and $\\mathbf h\\in \\mathbb Z^3$. We show that whenever $P$ is large and the system \\[ x_1^j+x_2^j-y_1^j-y_2^j=h_j\\quad (j=1,2,3) \\] has more than $P^\\varepsilon$ integral solutions with $1\\le x_i,y_i\\le P$, then there exist natural numbers $a$ and $b$ with $h_j=a^j-b^j$ $(j=1,2,3)$. This example illustrates the theme that, either the Diophantine system has a paucity of integral solutions, or else the coefficient tuple $\\mathbf h$ is highly structured. We examine related paucity problems as well as some consequences for problems involving more variables."}
{"id": "2602.02954", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.02954", "abs": "https://arxiv.org/abs/2602.02954", "authors": ["Amod Agashe"], "title": "The index of a certain quotient of the Hecke algebra in its normalization", "comment": null, "summary": "Let $Γ$ be a congruence subgroup of $SL_2(Z)$, and let $f$ be a normalized eigenform of weight $k$ on $Γ$. Let $K$ denote the number field generated over $Q$ by the Fourier coefficients of $f$. Let $R$ denote the the order in $K$ generated by the Fourier coefficients of $f$, which is contained in the ring of integers $O$ of $K$. We relate the primes that divide the index of $R$ in $O$ to primes $p$ such that $f$ is congruent to a conjugate of $f$ modulo a prime ideal of residue characteristic $p$. The index mentioned above is the same as the index of the quotient of the Hecke algebra by the annihilator ideal of $f$ in its normalization."}
{"id": "2602.03150", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.03150", "abs": "https://arxiv.org/abs/2602.03150", "authors": ["Dominique Manchon"], "title": "Une remarque sur l'arborification de Matula", "comment": "Article in French", "summary": "Nous esquissons une application de l'arborification de Matula à l'étude de la fonction sommatoire des fonctions de M\\\" obius et de Liouville sur les entiers naturels - We sketch an application of Matula's arborification to the study of the partial sums of both M\\\" obius and Liouville function."}
{"id": "2602.03251", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.03251", "abs": "https://arxiv.org/abs/2602.03251", "authors": ["Enrique González-Jiménez"], "title": "Squares in arithmetic progression over quadratic extensions of number fields", "comment": "To appear in International Journal of Number Theory", "summary": "We study arithmetic progressions of squares over quadratic extensions of number fields. Using a method inspired by an approach of Mordell, we characterize such progressions as quadratic points on a genus $5$ curve. Specifically, we determine the set of $K$-quadratic points on this curve under certain conditions on the base field $K$. Our main results rely on the algebraic properties of specific elliptic curves after performing a base change to suitable number fields. As a consequence, we establish that, under appropriate assumptions, any non-elementary arithmetic progression of five or six squares properly defined over a quadratic extension of $K$ must be of a specific form. Moreover, we prove the non-existence of such progressions of length greater than six under these assumptions."}
{"id": "2602.03193", "categories": ["math.RT", "math.GR", "math.RA"], "pdf": "https://arxiv.org/pdf/2602.03193", "abs": "https://arxiv.org/abs/2602.03193", "authors": ["Jiawei He", "Xiaogang Li"], "title": "Permutation groups and symmetric Hecke algebras", "comment": "21 pages", "summary": "The endomorphism algebras of the permutation modules for transitive permutation groups, known as Hecke algebras, are fundamental objects in representation theory. While group algebras are known to be symmetric over any field, it is natural to ask whether this property extends to Hecke algebras. To study this, we introduce the new concepts of $p$-$S$-permutation groups (for a prime $p$) and $S$-permutation groups. A \\emph{ $p$-$S$-permutation group} is a transitive permutation group whose associated Hecke algebra is symmetric over every field of characteristic $p$. An \\emph{ $S$-permutation group} is a transitive permutation group that is a $p$-$S$-permutation group for all primes $p$. In this paper, we study Hecke algebras from a group-theoretical perspective and we show that several classes of permutation groups are $p$-$S$-permutation groups and $S$-permutation groups in our sense. This result represents a substantial extension of earlier work by Li and He. (Transform Groups, 30(4), 2025), and reframes the question of determining when the algebra \\(\\End_{KG}(KΩ)\\) is symmetric within a more general theoretical framework."}
{"id": "2602.03399", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.03399", "abs": "https://arxiv.org/abs/2602.03399", "authors": ["Yuk-Kam Lau", "Jing Ma"], "title": "Möbius Disjointness Conjecture for a skew product on a circle and the Heisenberg nilmanifold", "comment": null, "summary": "We establish Sarnak's conjecture on Möbius disjointness for the dynamical system of a skew product on a circle and the three-dimensional Heisenberg nilmanifold, first studied by Wen Huang, Jianya Liu and Ke Wang. We advance the work of Huang, Liu, Wang, and their followers to a broad generality by removing the previously imposed restrictive symmetry condition."}
{"id": "2602.03659", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2602.03659", "abs": "https://arxiv.org/abs/2602.03659", "authors": ["Jenny August", "Johanne Haugland", "Karin M. Jacobsen", "Sondre Kvamme", "Yann Palu", "Hipolito Treffinger"], "title": "Higher torsion classes, $τ_d$-tilting theory and silting complexes", "comment": "48 pages, comments welcome", "summary": "Initiated in work by Adachi, Iyama and Reiten, the area known as $τ$-tilting theory plays a fundamental role in contemporary representation theory. In this paper we explore a higher-dimensional analogue of this theory, formulated with respect to the higher Auslander-Reiten translation $τ_d$. In particular, we associate to any functorially finite $d$-torsion class a maximal $τ_d$-rigid pair and a $(d+1)$-term silting complex. In the case $d=1$, the notions of maximal $τ_d$-rigid and support $τ$-tilting pairs coincide, and our theory recovers the classical bijections. However, the proof strategies for $d>1$ differ significantly. As an intermediate step, we prove that a $d$-cluster tilting subcategory of a module category induces a $d$-cluster tilting subcategory of the category of $(d+1)$-term complexes, producing novel examples of $d$-exact categories. We introduce the notion of a $d$-torsion class in the exact setup, and use this to obtain the aforementioned $(d+1)$-term silting complex. We moreover apply our theory to study $d$-APR tilting modules and slices. To illustrate our results, we provide explicit combinatorial descriptions of maximal $τ_d$-rigid pairs and $(d+1)$-term silting complexes for higher Auslander and higher Nakayama algebras."}
{"id": "2602.03408", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.03408", "abs": "https://arxiv.org/abs/2602.03408", "authors": ["Yuri Matiyasevich"], "title": "In Search of Approximate Polynomial Dependencies Among the Derivatives of the Alternating Zeta Function", "comment": null, "summary": "It is well-known that the Riemann zeta function does not satisfy any exact polynomial differential equation. Here we present numerical evidence for the existence of approximate polynomial dependencies between the values of the alternating zeta function and its initial derivatives.\n  A number of conjectures is stated."}
{"id": "2602.03440", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.03440", "abs": "https://arxiv.org/abs/2602.03440", "authors": ["Levent Kargın", "Merve Mutluer"], "title": "A New Expression for the Bernoulli Numbers and its Applications", "comment": null, "summary": "This paper shows that a finite discrete convolution involving Stirling numbers of both kinds and harmonic numbers can be expressed in terms of the Bernoulli numbers. As applications of this expression, the linear recurrence relation for the Bernoulli numbers given by Agoh is reproved, and a new recurrence relation for the Bernoulli numbers is obtained. Furthermore, it is shown that a cumulative sum of the Bernoulli numbers can be written in terms of the Bernoulli and di-Bernoulli numbers. Finally, congruences for the sums of the Bernoulli and Euler numbers are established."}
{"id": "2602.03513", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.03513", "abs": "https://arxiv.org/abs/2602.03513", "authors": ["Filip Najman"], "title": "Torsion groups of elliptic curves that appear infinitely often over septic fields", "comment": "5 pages", "summary": "In this short note we determine the set $Φ^\\infty(7)$ of Abelian groups that appear as torsion groups of infinitely many elliptic curves (up to $\\overline \\mathbb Q$-isomorphism) over number fields of degree 7."}
{"id": "2602.03626", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.03626", "abs": "https://arxiv.org/abs/2602.03626", "authors": ["Rick F. Lu", "Asif Zaman", "Haonan Zhao"], "title": "Numerical Computations Concerning Landau-Siegel Zeros", "comment": "20 pages, 2 figures, and 1 table", "summary": "We computationally verify that if $L(s,χ)$ is a quadratic Dirichlet $L$-function modulo $q \\leq 10^{10}$ then $L(σ,χ) \\neq 0$ for real $σ\\ge 1-1/(5\\log q)$. The number of verified moduli exceeds benchmarks due to Watkins (2004), Platt (2016), and Languasco (2023) by a factor between 66 and 25,000. Our new algorithm draws from zero-free region arguments."}
{"id": "2602.03642", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.03642", "abs": "https://arxiv.org/abs/2602.03642", "authors": ["Ivan Ermoshin"], "title": "The largest prime factor of an irreducible cubic polynomial", "comment": null, "summary": "Heath-Brown proved that for a positive proportion of integers $n$, $n^3+2$ has a prime factor larger than $n^{1+c}$ with $c=10^{-303}$.\n  We generalize this result to arbitrary monic irreducible cubic polynomial of $\\mathbb{Z}[x]$ with $c$ replaced by an exponent $c_p$ dependent on the polynomial."}
{"id": "2602.03722", "categories": ["math.NT", "math.AG", "math.GT"], "pdf": "https://arxiv.org/pdf/2602.03722", "abs": "https://arxiv.org/abs/2602.03722", "authors": ["Dawei Chen", "Evan Chen", "Kenny Lau", "Ken Ono", "Jujian Zhang"], "title": "Parity of $k$-differentials in genus zero and one", "comment": null, "summary": "Here we completely determine the spin parity of $k$-differentials with prescribed zero and pole orders on Riemann surfaces of genus zero and one. This result was previously obtained conditionally by the first author and Quentin Gendron assuming the truth of a number-theoretic hypothesis Conjecture A.10. We prove this hypothesis by reformulating it in terms of Jacobi symbols, reducing the proof to a combinatorial identity and standard facts about Jacobi symbols. The proof was obtained by AxiomProver and the system formalized the proof of the combinatorial identity in Lean/Mathlib (see the Appendix)."}
{"id": "2602.03803", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.03803", "abs": "https://arxiv.org/abs/2602.03803", "authors": ["Antoine Leudière", "Renate Scheidler"], "title": "Computing submodules of points of general Drinfeld modules over finite fields", "comment": null, "summary": "We present an algorithm for computing the structure of any submodule of the module of points of a Drinfeld $A$-module over a finite field, where $A$ is a function ring over $\\mathbb F_q$. When the function ring is $A = \\mathbb F_q[T]$, we additionally compute a Frobenius decomposition of said submodule. Our algorithms apply in particular to kernels of isogenies and torsion submodules. They are presented within the frameworks of Frobenius normal forms, presentations of modules, and Fitting ideals. They rely largely on efficient and classical linear algebra methods, combined with fast arithmetic of Ore polynomials. We analyze the complexity of our algorithms, explore optimizations, and provide an implementation in SageMath. Finally, we compute a simple invariant attached to a Drinfeld $\\mathbb F_q[T]$-module that encodes all the polynomials in $\\mathbb F_q[T]$ whose associated torsion is rational."}
