{"id": "2602.00467", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00467", "abs": "https://arxiv.org/abs/2602.00467", "authors": ["Dae san Kim", "Taekyun Kim"], "title": "Logarithms and Stirling numbers associated with delta series", "comment": "17", "summary": "This paper investigates the Stirling numbers of the first and second kind associated with a delta series f (t). These numbers provide a robust framework that satisfies the orthogonality and inverse relations, often lacking in recent probabilistic Stirling and B-Stirling numbers. Key contributions include the definition and analysis of the logarithm associated with a delta series f (t). We further establish a Schlomilch-type formula, which provides an explicit connection between the two kinds of Stirling numbers. Using this formula, we derive another expression for the associated logarithm in terms of the Stirling numbers of the second kind associated with a delta series f (t). Finally, we provide fifteen concrete examples to illustrate the versatility of this framework, demonstrating how it unifies and extends several known results in combinatorial analysis."}
{"id": "2602.00472", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00472", "abs": "https://arxiv.org/abs/2602.00472", "authors": ["Taekyun Kim", "Dae san Kim"], "title": "A note on Leibniz rule for difference quotient", "comment": "5 pages", "summary": "In this note, we derive a Leibniz rule for difference quotient."}
{"id": "2602.00572", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00572", "abs": "https://arxiv.org/abs/2602.00572", "authors": ["Yeong-Wook Kwon", "Subong Lim", "Wissam Raji"], "title": "Vector-Valued Period Polynomials and Zeta Values of Quadratic Fields", "comment": null, "summary": "Let $k\\ge 2$ and $N\\ge 1$ be integers. Let $D$ be a positive integer that is congruent to a square modulo $4N$, and fix $ρ$ with $ρ^2\\equiv D\\pmod{4N}$. In this paper, we consider two weight $2k$ cusp forms $f^{\\pm}_{k,N,D,ρ}$ on $Γ_0(N)$ defined by sums over binary quadratic forms, and investigate the vector-valued period polynomial arising from these forms. Our first main result gives a closed formula for this vector-valued period polynomial. The identity component of this formula is particularly explicit: it separates as the sum of a finite \\textit{algebraic part} coming from some binary forms and a \\textit{zeta part} involving the values at $s=k$ of certain zeta functions. Using this formula together with a symmetry of vector-valued period polynomials, we explicitly evaluate, for odd $k$, the difference between the zeta values corresponding to the two choices of square root of $D$ modulo $4N$, in terms of Bernoulli numbers and a finite quadratic-form sum. Finally, under a vanishing condition on Fricke-invariant cusp forms at lower levels, we obtain a finite divisor-sum formula for the Dedekind zeta values $ζ_{\\mathbb{Q}(\\sqrt{D})}(k)$ at even integers $k$."}
{"id": "2602.00578", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00578", "abs": "https://arxiv.org/abs/2602.00578", "authors": ["Matthew Bolan", "Ben Williams"], "title": "The degrees of irreducible factors of binomials and multiplicativity of the n-Hartley condition", "comment": "6 pages", "summary": "We prove that, over a field of characteristic $0$, the degrees of factors of a binomial $t^n-α$ are divisible by the least such degree. As a consequence, we deduce that for relatively prime natural numbers $m,n$, a polynomial has the $mn$-Hartley condition if and only if it has the $m$-Hartley and $n$-Hartley conditions."}
{"id": "2602.00274", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.00274", "abs": "https://arxiv.org/abs/2602.00274", "authors": ["Alexander Früh"], "title": "The singular Hitchin fibration, cameral data, and representation theory", "comment": "78 pages, comments welcome!", "summary": "For a complex reductive group $G$, we consider the locus $M^d$ in the moduli stack of $G$-Higgs bundles on which the centraliser dimension of the Higgs field takes a constant value $d> rk(G)$. We describe a non-abelian structure for the Hitchin fibration on $M^d$, under mild conditions on the geometry of the centraliser level set $\\mathfrak{g}_d$ in the Lie algebra. If $G$ is a classical group, we also show that the restriction of the Hitchin map to the locus of generically semisimple Higgs bundles in $M^d$ factors through an abelian fibration. The abelianised fibres can be described using a generalisation of the cameral data of Donagi and Gaitsgory.\n  We apply these constructions to $G_\\mathbb{R}$-Hitchin fibrations for real forms $G_\\mathbb{R}$. In particular we give a cameral description for an abelianisation of the $G_\\mathbb{R}$-Hitchin fibration, which extends the known description in the quasi-split case. We determine this explicitly in the examples $G_\\mathbb{R} = SU(p,q)$ and $G_{\\mathbb{R}} = SO^*(4m+2)$. Our local results also give a connection between the geometry of the Hitchin fibration on $M^d$ and the representation theory of the Lie algebra $\\mathfrak{g}$, via the orbit method. As a corollary, we determine an explicit asymptotic relationship between two notions of multiplicity, one attached to an adjoint orbit in $\\mathfrak{g}$ and one attached to a primitive ideal of the universal enveloping algebra of $\\mathfrak{g}$."}
{"id": "2602.00615", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00615", "abs": "https://arxiv.org/abs/2602.00615", "authors": ["Shun Ishii"], "title": "On graded Lie algebras associated to once-punctured elliptic curves with complex multiplication", "comment": "19 pages, submitted", "summary": "We study a graded Lie algebra arising from the Galois action on the pro-$p$ fundamental group of a once-punctured elliptic curve with complex multiplication. Among other things, we provide a minimal generating set of the rationalized Lie algebra under suitable assumptions. The proof is based on a slight variant of the theory of weighted completion of profinite groups developed by Hain and Matsumoto."}
{"id": "2602.01130", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2602.01130", "abs": "https://arxiv.org/abs/2602.01130", "authors": ["Andrei Neguţ"], "title": "A new new coproduct on quantum loop algebras", "comment": null, "summary": "Quantum loop algebras generalize $U_q(\\widehat{\\mathfrak{g}})$ for simple Lie algebras $\\mathfrak{g}$, and they include examples such as quantum affinizations of Kac-Moody Lie algebras, K-theoretic Hall algebras of quivers, and BPS algebras for toric Calabi-Yau threefolds. In the present paper, we define a coproduct on general quantum loop algebras, which coincides with the Drinfeld-Jimbo coproduct in the particular case of $U_q(\\widehat{\\mathfrak{g}})$ . We investigate the consequences of our construction for the representation theory of quantum loop algebras, particularly for tensor products of modules and R-matrices."}
{"id": "2602.00764", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00764", "abs": "https://arxiv.org/abs/2602.00764", "authors": ["Pitu Sarkar", "Nita Tamang"], "title": "Generalized Euler decomposition formula for interpolated multiple zeta values", "comment": null, "summary": "In this paper, we obtain a general t-shuffle product formula, using which we derive a generalized Euler decomposition formula for interpolated multiple zeta values. We also provide the same formula in case of height one through two different approaches: one by combinatorial description and another one by recursive formula."}
{"id": "2602.01316", "categories": ["math.RT", "math.CT", "math.RA"], "pdf": "https://arxiv.org/pdf/2602.01316", "abs": "https://arxiv.org/abs/2602.01316", "authors": ["Henning Krause"], "title": "Ordnung muss sein", "comment": "5 papges. English translation of the title: \"There must be order\"", "summary": "For any length category, we establish a set of rules (necessary and sufficient) that ensure a partial order on the isomorphism classes of simple objects such that the category is equivalent to the category of finite dimensional representations of this partially ordered set."}
{"id": "2602.00944", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00944", "abs": "https://arxiv.org/abs/2602.00944", "authors": ["Igor Rivin"], "title": "Monte-Carlo Irreducibility and Imprimitivity Detection of Polynomials over $\\mathbb{Q}$", "comment": null, "summary": "We study fast Monte-Carlo methods for testing irreducibility and detecting arithmetic imprimitivity of polynomials over $\\mathbb{Q}$. Building on the subset-sum criterion of Pemantle-Peres-Rivin, we develop a probabilistic irreducibility test whose expected running time, measured in the number of primes examined, is logarithmic in the degree for generic inputs. Unlike the standard modular irreducibility test, the method aggregates information from modular factorizations rather than discarding unsuccessful trials.\n  We show that failure of this test, when combined with a standard modular irreducibility certificate, is a strong indicator of non-generic algebraic structure. In particular, it often signals arithmetic imprimitivity of the Galois action. We present an explicit and efficient Monte-Carlo algorithm for detecting such imprimitivity via subfield extraction, yielding constructive algebraic certificates in the imprimitive case. To our knowledge, this is the first practical algorithm for detecting arithmetic imprimitivity of polynomials over $\\mathbb{Q}$ in high degree. We further show that the subset-sum data produced by the Pemantle--Peres--Rivin test provides a warm start for polynomial factorization by sharply restricting the possible degrees of rational factors, significantly accelerating subsequent lifting procedures. The proposed methods are orders of magnitude faster in practice than known deterministic algorithms, and are effective in degrees far beyond the reach of current deterministic techniques."}
{"id": "2602.01761", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2602.01761", "abs": "https://arxiv.org/abs/2602.01761", "authors": ["Nao Mochizuki"], "title": "Auslander correspondence for truncated connective DG-algebras", "comment": "20 pages", "summary": "We establish a $d$-dimensional Auslander correspondence for $d$-truncated proper connective DG-algebras via $d$-extended module categories. A $d$-truncated proper connective DG-algebra $Γ$ is called Auslander if its $d$-extended module category is a $d$-Auslander extriangulated category. Our main theorem gives a one-to-one correspondence: for any $d$-truncated proper connective DG-algebra $Λ$ whose $d$-extended module category has finitely many indecomposable objects, the DG-endomorphism algebra of an additive generator is Auslander, and conversely every Auslander $d$-truncated proper connective DG-algebra arises in this way."}
{"id": "2602.00965", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.00965", "abs": "https://arxiv.org/abs/2602.00965", "authors": ["Jia Shi"], "title": "Lifting $L$-polynomials of genus $3$ curves", "comment": null, "summary": "Let $C$ be a smooth plane quartic curve over $\\mathbb{Q}$. Costa, Harvey and Sutherland provide an algorithm with an implementation, improving Harvey's average polynomial-time algorithm, to compute the $\\bmod \\ p$ reduction of the numerator of the zeta function of $C$ at all $p\\leq B$, where $p$ is an odd prime of good reduction, in $O(B\\log^{3+o(1)} N)$ time, which is $O(\\log^{4+o(1)}p)$ time on average per prime. Alternatively, their algorithm can do this for a single prime $p$ of good reduction in $O(p^{1/2}\\log^2p)$ time. While this algorithm can be used to compute the full zeta function, no implementation of this step currently exists.\n  In this article, we provide an algorithm and an implementation for the group operation on the Jacobian of $C$ over $\\mathbb{F}_p$, where $p$ is an odd prime of good reduction. We provide a Las Vegas algorithm that takes the $\\bmod \\ p$ result of Costa, Harvey and Sutherland's algorithm and uses it to compute the full zeta function. The expected running time of the algorithm is bounded by $O(p^{1/2+o(1)})$, and under heuristic assumptions, we prove an $O(p^{1/4+o(1)})$ bound on its average running time (over all inputs). Our lifting algorithm can also be applied to hyperelliptic curves of genus 3."}
{"id": "2602.01878", "categories": ["math.RT", "math.AC", "math.CO", "math.RA"], "pdf": "https://arxiv.org/pdf/2602.01878", "abs": "https://arxiv.org/abs/2602.01878", "authors": ["Osamu Iyama", "Junyang Liu"], "title": "Triangle equivalences between Gorenstein tiled orders and incidence algebras of posets", "comment": "19 pages", "summary": "We prove that for any $\\mathbb{N}$-graded Gorenstein tiled order $A$, the stable category $\\underline{\\mathrm{CM}}^{\\mathbb{Z}}A$ is triangle equivalent to the perfect derived category of the incidence algebra of a finite poset $\\mathbb{V}_A^{op}$. Moreover, for a finite poset $P$, we prove that the incidence algebra of $P$ can be realized as the endomorphism algebra of a standard tilting object if and only if $P$ is either empty or has the maximum. We also study the behaviors of the corresponding poset under graded Morita equivalences and coverings of a Gorenstein tiled order. Finally, we classify Gorenstein tiled orders $A$ satisfying $|\\mathbb{V}_A^{op}|\\leq 3$."}
{"id": "2602.01001", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01001", "abs": "https://arxiv.org/abs/2602.01001", "authors": ["Kalyan Banerjee", "Kalyan Chakraborty", "Ankita Das"], "title": "Generalized fruit Diophantine equation and super elliptic curves", "comment": "22 pages", "summary": "In this article, we are interested in finding rational points on certain superelliptic curves."}
{"id": "2602.02021", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.02021", "abs": "https://arxiv.org/abs/2602.02021", "authors": ["Yu Qiao", "Xiaoyu Zhu"], "title": "Irreducible tensor product modules over the Takiff Lie algebra for $\\mathfrak{sl}_{2}$", "comment": null, "summary": "In this paper, we construct a class of non-weight modules over the Takiff $\\mathfrak{sl}_{2}$ by taking the tensor products of the irreducible free $U(\\overline{\\mathfrak{h}})$-modules of rank 1, where $\\overline{\\mathfrak{h}}$ is a natural Cartan subalgebra of the Takiff $\\mathfrak{sl}_{2}$, with the irreducible highest weight modules. We characterize the irreducibility of these tensor product modules and determine the necessary and sufficient conditions for isomorphisms between them. We further prove that these non-weight modules are distinct from the known non-weight modules. Finally, we reformulate some tensor product modules over the Takiff $\\mathfrak{sl}_{2}$ as induced modules derived from modules over certain subalgebras, and determine the necessary and sufficient conditions for the reducibility of these induced modules."}
{"id": "2602.01052", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01052", "abs": "https://arxiv.org/abs/2602.01052", "authors": ["Nita Tamang", "Pitu Sarkar"], "title": "Meromorphic continuation of a q-analogue of multiple zeta function", "comment": null, "summary": "In this paper, we obtain the meromorphic continuation of a q-analogue of multiple zeta function using an elementary formula called translation formula. We then obtain the matrix representation of the translation formula and using it, we locate the poles of the function and the corresponding residues. While locating the poles, we also obtain an inverse of an infinite triangular matrix in a particular case."}
{"id": "2602.02145", "categories": ["math.RT", "math.DG"], "pdf": "https://arxiv.org/pdf/2602.02145", "abs": "https://arxiv.org/abs/2602.02145", "authors": ["Rohit Joshi", "Steven Spallone"], "title": "Characteristic Classes Of Representations Of Lie Groups", "comment": null, "summary": "An irreducible representation of a reductive Lie algebra, when restricted to a Cartan subalgebra, decomposes into weights with multiplicity. The first part of this paper outlines a procedure to compute symmetric polynomials (e.g., power sums) of this multiset of weights, as functions of the highest weight. Next, let G be a connected reductive complex algebraic group with maximal torus T. We express the restrictions of the Chern classes of irreducible representations of G to T, as polynomial functions in the highest weight. We do the same for Stiefel-Whitney classes of orthogonal representations."}
{"id": "2602.01252", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01252", "abs": "https://arxiv.org/abs/2602.01252", "authors": ["Scott Duke Kominers"], "title": "Simultaneous Niven Numbers in Arithmetic Progressions for Power-Related Bases", "comment": "9 pages", "summary": "Recently, Harrington, Litman, and Wong [Bulletin of the Australian Mathematical Society, 2024; arXiv:2303.06534] proved that every arithmetic progression contains infinitely many base-$b$ Niven numbers, for any fixed $b\\ge 2$. We use a sparse repunit construction to treat a structured two-base version of the same problem, showing that every arithmetic progression with common difference relatively prime to $b$ contains infinitely many integers that are simultaneously $b$-Niven and $b^k$-Niven (indeed, we can obtain simultaneous $b^\\ell$-Niven-ness for $\\ell=1,\\ldots, k$)."}
{"id": "2602.02209", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2602.02209", "abs": "https://arxiv.org/abs/2602.02209", "authors": ["Tobias Schmidt"], "title": "Pro-p Iwahori Hecke algebras and the dual Vinberg monoid", "comment": "38 pages", "summary": "Let G be a split reductive group over the integers, F a p-adic local field with residue field Fq. We relate the pro-p-Iwahori Hecke algebra H of G(F) over Fq to the Vinberg monoid of the dual group and study this relation. As an application, in the GL(n)-case and for F/Qp unramified, we derive a parametrization of SpecZ by semisimple n-dimensional representations of the absolute Galois group of F, generalizing the known case n = 2. Here Z denotes the center of H."}
{"id": "2602.01307", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.01307", "abs": "https://arxiv.org/abs/2602.01307", "authors": ["Yubin He", "Lingmin Liao"], "title": "Jarník-type theorem for self-similar sets", "comment": null, "summary": "Let $K\\subset\\mathbb R^d$ be a compact subset equipped with a $δ$-Ahlfors regular measure $μ$. For any $τ>1/d$ and any ``inhomogeneous'' vector $\\boldsymbolθ\\in\\mathbb R^d$, let $W_d(ψ_τ,\\boldsymbolθ)$ denote the set of $(ψ_τ,\\boldsymbolθ)$-well approximable numbers, where $ψ_τ(q)=q^{-τ}$. Assuming a local estimate for the $μ$-measure of the intersections of $K$ with the neighborhoods of ``rational'' vectors $(\\mathbf p+\\boldsymbolθ)/q$, we establish a sharp upper bound for the Hausdorff dimension of $K\\cap W_d(ψ_τ,\\boldsymbolθ)$, together with some nontrivial lower bounds when $τ$ is below a certain threshold. One of the lower bounds becomes sharp in the one-dimensional homogeneous case ($d=1$, $θ=0$) for a class of sufficiently thick self-similar sets $K$, and moreover $K\\cap W_1(ψ_τ,0)$ has full $(δ+\\frac{2}{1+τ}-1)$-Hausdorff measure. These results have several applications:\n  (1) the set of homogeneous very well approximable numbers has full Hausdorff dimension within strongly irreducible self-similar sets in $\\mathbb R^d$, extending a recent result of Chen [arXiv:2510.17096];\n  (2) the set of inhomogeneous very well approximable numbers has full Hausdorff dimension within sufficiently thick missing digits sets in $\\mathbb R$, affirmatively answering a question posed by Yu [arXiv:2101.05910].\n  Our applications build on the seminal works of Yu [arXiv:2101.05910] and Bénard, He and Zhang [arXiv:2508.09076]."}
{"id": "2602.02404", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.02404", "abs": "https://arxiv.org/abs/2602.02404", "authors": ["Filippo Ambrosio", "Giovanna Carnovale", "Francesco Esposito", "Neil Saunders", "Lewis Topley"], "title": "Sheets, Jordan classes and induced orbits in the exotic and enhanced modules", "comment": null, "summary": "Kato developed an exotic Deligne-Langlands correspondence using a geometric model for the multiparameter affine Hecke algebra of type C, based on his exotic nilpotent cone. Achar-Henderson and Springer showed that this exotic nilpotent is intimately related to another, apparently simpler variety called the enhanced nilpotent cone. Each of these is defined as the Hilbert nullcone of a polar module, the exotic Sp(2n)-module and the enhanced GL(n)-module, respectively.\n  In this paper we conduct a detailed study of the geometry of these two modules, by introducing the Jordan stratification, simultaneously generalising classical results on the adjoint representation as well as the symmetric space associated to (gl(2n), sp(2n)). One of the key tools we develop is the theory of induced orbits in the enhanced and exotic nilpotent cones, following the work of Lusztig-Spaltenstein. Our main application is a classification of sheets in these modules, inspired by a theorem of Borho."}
{"id": "2602.01380", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.01380", "abs": "https://arxiv.org/abs/2602.01380", "authors": ["Enrique González-Jiménez", "Nguyen Xuan Tho"], "title": "Squares in arithmetic progression over certain non-primitive quartic number fields", "comment": null, "summary": "Let $D$ be a square-free integer. Under certain conditions on $D$, we characterize non-constant arithmetic progressions of squares over quadratic extensions of $\\mathbb{Q}(\\sqrt{D})$."}
{"id": "2602.02242", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.02242", "abs": "https://arxiv.org/abs/2602.02242", "authors": ["Stepan Konenkov", "Eric T. Mortenson"], "title": "New polar-finite forms of generalized Euler identities for $A_{1}^{(1)}$-string functions and mock theta conjecture-like identities", "comment": "77 pages", "summary": "Determining the explicit forms and modularity for string functions and branching coefficients for Kac--Moody algebras after Kac, Peterson, and Wakimoto is an important problem. For positive admissible-level string functions for the affine Kac--Moody algebra $A_{1}^{(1)}$, very little is known. Here we apply the notion of quasi-periodicity to a generalized Euler identity of Schilling and Warnaar for the affine Kac--Moody algebra $A_{1}^{(1)}$. For integral-level string functions the classical periodicity reduces the infinite sum of string functions in the generalized Euler identity to a finite sum of string functions with theta function coefficients. For admissible-level, we similarly reduce to an analogous finite sum of string functions, but we also gain an additional finite sum of the form \\begin{equation*} \\sum_{i}Φ_{i}(q)Ψ_{i}(q), \\end{equation*} where the $Φ_i(q)$'s are modular and depend only on the spin and the $Ψ_{i}(q)$'s are (mixed) mock modular Hecke-type double-sums and depend only on the quantum number. For levels $1/2$, $1/3$, and $2/3$, we shall also see that the $Ψ_{i}(q)$'s give us families of mock theta conjecture-like identities for symmetric Hecke-type double-sums. Our work here focuses on evaluating the $Ψ_{i}(q)$'s, and our expressions utilize Ramanujan's second-order mock theta function $μ_2(q)$ and third-order mock theta functions $f_{3}(q)$, $ω_3(q)$, $ψ_{3}(q)$, and $χ_3(q)$."}
{"id": "2602.01384", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.01384", "abs": "https://arxiv.org/abs/2602.01384", "authors": ["Enrique González-Jiménez"], "title": "On the squareness of the discriminant of elliptic curves with an isogeny", "comment": null, "summary": "We establish a classification of the values of \\( N \\) for which an elliptic curve defined over \\( \\mathbb{Q} \\) with square discriminant admits an \\( N \\)-isogeny. Furthermore, we determine the values of \\( N \\) for which two elliptic curves defined over \\( \\mathbb{Q} \\), both possessing square discriminants, are \\( N \\)-isogenous. In both cases, we explicitly parametrize the corresponding \\( j \\)-invariants of the elliptic curves associated with these problems."}
{"id": "2602.02492", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.02492", "abs": "https://arxiv.org/abs/2602.02492", "authors": ["Zhuoni Chi"], "title": "Spherical representations of unitary groups at ramified places and the arithmetic inner product formula", "comment": "74 pages, comments are welcome", "summary": "In this article, we study admissible representations of even unitary groups over local fields, where the quadratic extension is ramified, with invariant vectors under the action of the stabilizer of a unimodular lattice and some properties of the corresponding integral model of unitary Shimura varieties. As a direct application, we are able to improve the arithmetic inner product formula so that the places with local root number \\((-1)\\) are allowed to be ramified."}
{"id": "2602.01398", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.01398", "abs": "https://arxiv.org/abs/2602.01398", "authors": ["Enrique González-Jiménez"], "title": "Quadratic points on the Fermat quartic over number fields", "comment": "To appear in Acta Arithmetica", "summary": "Let $C$ be a curve defined over a number field $K$. A point $P\\in C(\\overline{\\mathbb{Q}})$ is called $K$-quadratic if $[K(P):K]=2$. Let $K$ be a number field such that the rank of the elliptic curves $E_1:\\,y^2= x^3 + 4x$ and $E_2:\\,y^2= x^3 - 4x$ over $K$ are $0$. Under the above condition, we prove that the set of $K$-quadratic points on the Fermat quartic $F_4\\colon X^4+Y^4=Z^4$ is finite and computable and we provide a procedure to compute this finite set. In particular, we explicitly compute all the $K$-quadratic points if $[K:\\mathbb{Q}]<8$. Moreover, if the degree of $K$ is odd, we prove that all the $K$-quadratic points corresponds just to the $\\mathbb{Q}$-quadratic points"}
{"id": "2602.01409", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01409", "abs": "https://arxiv.org/abs/2602.01409", "authors": ["Peng Gao", "Liangyi Zhao"], "title": "Shifted moments of modular $L$-functions to a fixed level", "comment": "8 pages", "summary": "We establish upper bounds for shifted moments of modular $L$-functions to a fixed prime level under the generalized Riemann hypothesis."}
{"id": "2602.01473", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01473", "abs": "https://arxiv.org/abs/2602.01473", "authors": ["Romain Branchereau"], "title": "Theta correspondence and the Borisov-Gunnells relations", "comment": "36 pages, 4 figures", "summary": "We consider a geometric theta correspondence from the first homology of a modular curve, to modular forms of weight $2$. Using Stevens' description of the homology, we find that this map sends modular symbols to product of weight one Eisenstein series, modular caps to weight $2$ Eisenstein series, and hyperbolic cycles to diagonal restrictions of Hilbert-Eisenstein series. We use it to revisit work of Borisov and Gunnells, and explain its connection to a theorem of Li. In particular, we give a geometric proof of certain relations between Eisenstein series."}
{"id": "2602.01488", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01488", "abs": "https://arxiv.org/abs/2602.01488", "authors": ["Damien Roy"], "title": "Extremal numbers and multi-parametric geometry of numbers", "comment": "52 pages, 10 figures", "summary": "We study weighted simultaneous rational approximation to points of the form $(1,ξ,ξ^2)$, for a class of extremal real numbers $ξ$, within the framework of multi-parametric geometry of numbers."}
{"id": "2602.01571", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01571", "abs": "https://arxiv.org/abs/2602.01571", "authors": ["Jiong Yang", "Zhishan Yang"], "title": "Higher moments for symmetric powers of modular forms", "comment": null, "summary": "Let $f$ be a cuspidal eigenform of weight $k$ on $\\SL_2(\\BZ)$ and let $λ_{\\Sym^d f}(n)$ be the normalized Fourier coefficients of its $d$-th symmetric power lift. This paper establishes asymptotic formulas for the moments $\\sum_{n\\leq x}λ^l_{\\Sym^d f}(n)$ for all positive integers $d$ and $l$. We also prove an asymptotic formula for the corresponding sum over the values of any positive definite binary quadratic form $Q$. Our results generalize and improve upon previous work, which was limited to small values of $d$ or $l$. The proofs rely on the decomposition of $\\ell$-adic Galois representations and the analytic properties of the associated $L$-functions."}
{"id": "2602.01784", "categories": ["math.NT", "math.GR", "math.GT"], "pdf": "https://arxiv.org/pdf/2602.01784", "abs": "https://arxiv.org/abs/2602.01784", "authors": ["Mikołaj Frączyk", "Sebastian Hurtado", "Jean Raimbault"], "title": "Benjamini--Schramm convergence of arithmetic locally symmetric spaces", "comment": "Split from v1 of arXiv:2202.13619", "summary": "We prove that the thin parts of arithmetically defined locally symmetric space take up a negligible part of their volume and deduce asymptotic results on their Betti numbers."}
{"id": "2602.01820", "categories": ["math.NT", "math.AG", "math.DG"], "pdf": "https://arxiv.org/pdf/2602.01820", "abs": "https://arxiv.org/abs/2602.01820", "authors": ["Jiawei Yu", "Xinyi Yuan", "Shengxuan Zhou"], "title": "Quantitativity on the number of rational points in the Mordell conjecture", "comment": null, "summary": "In this paper, we prove an explicit upper bound on the number of rational points on a smooth projective curve of genus at least two over a number field. This gives explicit constants in the uniform Mordell conjecture proposed by Mazur and proved by Vojta, Dimitrov-Gao-Habegger, and Kühne. The main body of this paper consists of two parts: Part I for arithmetic estimates and Part II for analytic estimates."}
{"id": "2602.01950", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.01950", "abs": "https://arxiv.org/abs/2602.01950", "authors": ["Charlotte Dombrowsky"], "title": "Central Values of $L$-Functions of Twisted Modular Forms and Local Polynomials", "comment": null, "summary": "In this paper we study the product of two central values of $L$-functions of a twisted modular. We show that it suffices to compute a local polynomial at a finite number of points to decide whether the product is zero. For the proof, we relate the local polynomial to the product of the $L$-functions using a locally harmonic Maass form and building on the Shimura-Shintani correspondence. This extends results from Ehlen, Guerzhoy, Kane and Rolen as well as Males, Mono, Rolen and Wagner."}
{"id": "2602.02012", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.02012", "abs": "https://arxiv.org/abs/2602.02012", "authors": ["Claire I. Levaillant"], "title": "Solutions to $\\sum_{i=1}^n 1/x_i=1$ in integers $p^a\\,q^b$ with $p$ and $q$ two set primes", "comment": "16 pages", "summary": "We present an algorithm for computing all the solutions in not necessarily distinct integers to the decomposition of the unit into a sum of unit fractions with denominators $p^a.q^b$ where $p$ and $q$ are two distinct primes, each appearing at least once in the solution."}
{"id": "2602.02242", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.02242", "abs": "https://arxiv.org/abs/2602.02242", "authors": ["Stepan Konenkov", "Eric T. Mortenson"], "title": "New polar-finite forms of generalized Euler identities for $A_{1}^{(1)}$-string functions and mock theta conjecture-like identities", "comment": "77 pages", "summary": "Determining the explicit forms and modularity for string functions and branching coefficients for Kac--Moody algebras after Kac, Peterson, and Wakimoto is an important problem. For positive admissible-level string functions for the affine Kac--Moody algebra $A_{1}^{(1)}$, very little is known. Here we apply the notion of quasi-periodicity to a generalized Euler identity of Schilling and Warnaar for the affine Kac--Moody algebra $A_{1}^{(1)}$. For integral-level string functions the classical periodicity reduces the infinite sum of string functions in the generalized Euler identity to a finite sum of string functions with theta function coefficients. For admissible-level, we similarly reduce to an analogous finite sum of string functions, but we also gain an additional finite sum of the form \\begin{equation*} \\sum_{i}Φ_{i}(q)Ψ_{i}(q), \\end{equation*} where the $Φ_i(q)$'s are modular and depend only on the spin and the $Ψ_{i}(q)$'s are (mixed) mock modular Hecke-type double-sums and depend only on the quantum number. For levels $1/2$, $1/3$, and $2/3$, we shall also see that the $Ψ_{i}(q)$'s give us families of mock theta conjecture-like identities for symmetric Hecke-type double-sums. Our work here focuses on evaluating the $Ψ_{i}(q)$'s, and our expressions utilize Ramanujan's second-order mock theta function $μ_2(q)$ and third-order mock theta functions $f_{3}(q)$, $ω_3(q)$, $ψ_{3}(q)$, and $χ_3(q)$."}
{"id": "2602.02349", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.02349", "abs": "https://arxiv.org/abs/2602.02349", "authors": ["Jonathan Rotgé", "Gérald Tenenbaum"], "title": "On integral boxes of minimal surface", "comment": null, "summary": "Generalising the two-dimensional case, we provide estimates for the mean-values of the lengths of the edges of an integral box with given volume and minimal surface."}
{"id": "2602.02379", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.02379", "abs": "https://arxiv.org/abs/2602.02379", "authors": ["Edouard Daviaud"], "title": "Intrinsic Diophantine approximation: a solution to Mahler's problem", "comment": null, "summary": "In this article, we compute the Hausdorff dimension of elements of a rational self-similar set that are $ψ$-approximable by rational belonging to the set, this for a large class of self-similar sets, containing in particular the middle-third Cantor set."}
{"id": "2602.02480", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.02480", "abs": "https://arxiv.org/abs/2602.02480", "authors": ["Hideaki Ishikawa", "Takao Komatsu"], "title": "Finite $q$-multiple harmonic sums on $1-\\cdots-1,A,1-\\cdots-1$ indices", "comment": null, "summary": "In this paper, we give explicit expressions about $q$-harmonic sums on $1-\\cdots-1,A,1-\\cdots-1$ indices. When $A=1$, many previous authors have studied and showed the identities, expressions, and properties. There are many results for explicit expressions about $q$-multiple zeta values or $q$-harmonic sums on $A-\\cdots-A$ indices. Though there is the way to treat $q$-multiple zeta values unless the indices are the same, it has been successful to get the explicit expression of $q$-harmonic sums on $1-\\cdots-1,A,1-\\cdots-1$ indices when $A=2$. In this paper, we shall consider more general results when $A\\ge 3$."}
{"id": "2602.02492", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.02492", "abs": "https://arxiv.org/abs/2602.02492", "authors": ["Zhuoni Chi"], "title": "Spherical representations of unitary groups at ramified places and the arithmetic inner product formula", "comment": "74 pages, comments are welcome", "summary": "In this article, we study admissible representations of even unitary groups over local fields, where the quadratic extension is ramified, with invariant vectors under the action of the stabilizer of a unimodular lattice and some properties of the corresponding integral model of unitary Shimura varieties. As a direct application, we are able to improve the arithmetic inner product formula so that the places with local root number \\((-1)\\) are allowed to be ramified."}
{"id": "2602.02209", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2602.02209", "abs": "https://arxiv.org/abs/2602.02209", "authors": ["Tobias Schmidt"], "title": "Pro-p Iwahori Hecke algebras and the dual Vinberg monoid", "comment": "38 pages", "summary": "Let G be a split reductive group over the integers, F a p-adic local field with residue field Fq. We relate the pro-p-Iwahori Hecke algebra H of G(F) over Fq to the Vinberg monoid of the dual group and study this relation. As an application, in the GL(n)-case and for F/Qp unramified, we derive a parametrization of SpecZ by semisimple n-dimensional representations of the absolute Galois group of F, generalizing the known case n = 2. Here Z denotes the center of H."}
