{"id": "2602.13401", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.13401", "abs": "https://arxiv.org/abs/2602.13401", "authors": ["Enrique González-Jiménez", "Eknath Ghate", "Jordi Quer"], "title": "On the Brauer class of Modular Endomorphism Algebras", "comment": "Updated version with references, minor corrections, and table including k=5, relative to the published version", "summary": "We investigate the Brauer class of the endomorphism algebra of the motive attached to a non-CM form. The ramification of the algebra is shown in many cases to be controlled by the normalized slopes of the form."}
{"id": "2602.13676", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.13676", "abs": "https://arxiv.org/abs/2602.13676", "authors": ["Claudia Alfes", "Paul Kiefer"], "title": "Magnetic orthogonal modular forms", "comment": null, "summary": "In this note we show that certain meromorphic orthogonal modular forms are magnetic, i.e.\\ their Fourier coefficients satisfy special divisibility criteria. These meromorphic orthogonal modular forms are counterparts to the orthogonal cusp forms considered by Oda. We show that the seminal of work of Borcherds implies the magneticity of these forms."}
{"id": "2602.13853", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.13853", "abs": "https://arxiv.org/abs/2602.13853", "authors": ["Mihoub Bouderbala", "Meselem Karras"], "title": "On the asymptotic behavior of the integral T(x)", "comment": null, "summary": "In this paper, we estimate the integral T(x) mentioned in the title, where {t} denotes the fractional part of the real number t, and x is any positive real number."}
{"id": "2602.14195", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.14195", "abs": "https://arxiv.org/abs/2602.14195", "authors": ["Hichem Gargoubi", "Sayed Kossentini"], "title": "Bicomplex Algebraic Numbers", "comment": "Submitted", "summary": "We investigate bicomplex analogues of fundamental notions from classical algebraic number theory. In particular, we show that the primitive element theorem admits a natural generalization to bicomplex extensions, giving rise to two distinct classes of extensions depending on the nature of the generating element. We further establish a key decomposition property for bicomplex extensions, which serves as a foundation for studying their rings of integers. We also observe that prime elements in the ring of integers of a number field may become semiprime in the rings of integers of suitable bicomplex extensions. Finally, we present two explicit examples of finite bicomplex extensions."}
{"id": "2602.13373", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2602.13373", "abs": "https://arxiv.org/abs/2602.13373", "authors": ["Josh Katz"], "title": "Unitary Invariants of the Finite Heisenberg Group", "comment": null, "summary": "Polynomial invariants of a group action often appear only in high degree, and in many representations the invariant ring imposes severe degree constraints before any nontrivial invariants can occur. In contrast, the larger class of unitary invariants -- polynomials in both the variables and their conjugates -- typically exhibits very different behavior, and their separating power is comparatively unexplored.\n  We highlight this contrast in the setting of the finite Heisenberg group $H_N$. Although the polynomial invariant ring $\\mathbb{C}[V]^{H_N}$ contains no nontrivial elements below degree $N$, we show that degree-six unitary invariants are already sufficient to separate generic $H_N$-orbits up to a global phase factor. These invariants arise from cubic equations involving the magnitudes of a vector and its discrete Fourier transform. A single polynomial invariant in degree $N$ then resolves the remaining global phase, yielding full generic orbit separation. Our proof utilizes fundamental results from phase retrieval. Along the way we will also explore the utility of unitary invariants in obtaining improved degree bounds for representations of cyclic groups.\n  This paper provides a concrete example in which the minimal separating degree for unitary invariants is dramatically lower than the minimal degree for polynomial invariants."}
{"id": "2602.14319", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.14319", "abs": "https://arxiv.org/abs/2602.14319", "authors": ["Harun Kir"], "title": "Constructing genus 2 curves with given refined Humbert invariants", "comment": null, "summary": "In 1994, Kani introduced an algebraic version of the Humbert invariant, known as the refined Humbert invariant. This invariant q_C is a positive definite quadratic form attached to a smooth curve C of genus 2. It serves as a vital tool, as many geometric properties of C are reflected in the arithmetic properties of q_C. When the Jacobian J_C of a genus 2 curve C is isogenous to a product of an elliptic curve with complex multiplication, the forms q_C have been completely classified recently. In this paper, building upon this classification, we present a constructive algorithm that produces J_C and a divisorial representative of a curve C of genus 2 such that its refined Humbert invariant q_C is equivalent to a given integral ternary quadratic form."}
{"id": "2602.13779", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.13779", "abs": "https://arxiv.org/abs/2602.13779", "authors": ["Suman Rani", "Punita Batra"], "title": "Integrable Representations for Toroidal Lie Algebras Co-ordinated by Rational Quantum Torus", "comment": null, "summary": "We classify irreducible integrable modules with finite-dimensional weight spaces for toroidal Lie algebras coordinated by rational quantum torus with trivial central action. Let $\\mathbb{C}_q$ denote the rational quantum torus associated with a rational quantum matrix $q$, and let $\\hatτ(d,q)$ be the toroidal Lie algebra coordinated by rational quantum torus obtained by adjoining the derivation space $D$ to the universal central extension $\\tildeτ(d,q)=\\mathfrak{sl}_d(\\mathbb{C}_q)\\oplus HC_1(\\mathbb{C}_q)$ of $\\mathfrak{sl}_d(\\mathbb{C}_q)$. The case of nontrivial central action was previously classified by S. Eswara Rao and K. Zhao. The present work completes the classification by describing all irreducible integrable $\\hatτ(d,q)$-modules with finite-dimensional weight spaces in the case where the $n$-dimensional center $C$ acts trivially on the modules."}
{"id": "2602.14340", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.14340", "abs": "https://arxiv.org/abs/2602.14340", "authors": ["Ethan Simpson Lee"], "title": "Minimal zero-free regions for results on primes between consecutive perfect $k$th powers", "comment": "Five tables, comments (and criticisms) warmly welcomed!", "summary": "We compute minimal zero-free regions for the Riemann zeta-function of the Littlewood form which ensure there is always a prime between consecutive perfect $k$th powers. Our computations cover powers $k\\geq 70$ and quantify how far we are away from proving certain milestones toward an infamous open problem (Legendre's conjecture)."}
{"id": "2602.13794", "categories": ["math.RT", "math.AC"], "pdf": "https://arxiv.org/pdf/2602.13794", "abs": "https://arxiv.org/abs/2602.13794", "authors": ["Michal Hrbek", "Jiangsheng Hu", "Rongmin Zhu"], "title": "On silting complexes associated to n-silting modules", "comment": "20 pages", "summary": "We show that any (n+1)-term silting complex whose intermediate cohomology vanishes gives rise to an n-silting module, as recently introduced by Mao. Specializing to commutative noetherian rings, we show that this assignment induces a bijection on the respective equivalence classes. Furthermore, we prove in the same setting that the n-silting modules always correspond to a tilting complex, that is, the associated t-structure is of derived type. We use this to exhibit new examples of tilting complexes in the setting of Commutative Algebra and also to show that the finite type property for n-silting modules, as formulated by Mao, can in general fail."}
{"id": "2602.14368", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.14368", "abs": "https://arxiv.org/abs/2602.14368", "authors": ["Yuchen Ding", "Johann Verwee"], "title": "Short intervals for the Romanoff-type sumset", "comment": "14 pages", "summary": "Let $X$ be large and let $\\mathcal P$ denote the set of primes. Fix positive real parameters $r_1,\\dots,r_s$ and a parameter $λ>0$ determined by a balancing relation, and let $\\mathcal A_λ(X)\\subset[1,2X]$ be the associated lacunary set generated by sums of powers of $2$ with polynomially growing exponents. Set $\\mathcal S_λ:=\\mathcal P+\\mathcal A_λ(X)$. Fix $\\varepsilon>0$, choose $θ$ with $2/15+\\varepsilon<θ<1-δ_0$, where $δ_0>0$ is an absolute constant, and set $h=X^θ$. We prove that for all but $O_\\varepsilon\\left(X\\exp\\left(-c_\\varepsilon(\\log X)^{1/4}\\right)\\right)$ values of $x\\in[X,2X]$, the short interval $(x,x+h]$ contains between $c_\\varepsilon h$ and $C_\\varepsilon h$ integers of the form $p+a$ with $p\\in\\mathcal P$ and $a\\in\\mathcal A_λ(X)$."}
{"id": "2602.13919", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.13919", "abs": "https://arxiv.org/abs/2602.13919", "authors": ["Giulia Iezzi"], "title": "Linear degenerations of Schubert varieties", "comment": null, "summary": "We define linear degenerations of Schubert varieties via a special class of quiver Grassmannians. To do so, we restrict our study to an appropriate subvariety in the variety of representations of the considered quiver and describe a base change action on this subvariety. We provide two explicit parametrisations for the orbits of this action, one of which encodes the partial order relations on such orbits."}
{"id": "2602.14447", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.14447", "abs": "https://arxiv.org/abs/2602.14447", "authors": ["Ama Ahenfoa Quansah"], "title": "Tribonacci Numbers That Are Products of Two Lucas Numbers", "comment": null, "summary": "Let $T_{k}$ be the $k^{\\textrm{th}}$ Tribonacci number and $L_{n}$ be the $n^{\\textrm{th}}$ Lucas number defined by their respective recurrence relation $T_{k}=T_{k-1}+T_{k-2}+T_{k-3}$ and $L_{n}=L_{n-1}+L_{n-2}$. In this study, we solve the Diophantine equation $T_{k} = L_{m}L_{n}$ for positive integer unknowns $m$, $n$, and $k$ and prove our results."}
{"id": "2602.13966", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.13966", "abs": "https://arxiv.org/abs/2602.13966", "authors": ["Marc Besson", "Sam Jeralds", "Joshua Kiers"], "title": "Reduction rules for Demazure modules", "comment": "18 pages, 3 figure", "summary": "For $G$ a complex reductive group and $B \\subseteq G$ a Borel subgroup, we provide a reduction rule for certain weight multiplicities in Demazure modules $V_λ^w$: given a weight $μ$ on a face of the associated weight polytope $P_λ^w$, we reduce the computation of the dimension of the weight space $V_λ^w(μ)$ to a similar problem of computing the weight space dimension for a Demazure module of a Levi subgroup of $G$."}
{"id": "2602.14586", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.14586", "abs": "https://arxiv.org/abs/2602.14586", "authors": ["Antonio Cauchi", "Armando Gutierrez Terradillos"], "title": "$L$-functions and linear periods for $\\mathbf{GL}_4 \\times \\mathbf{GL}_2$ and $\\mathbf{GU}_{2,2}\\times \\mathbf{GL}_2$", "comment": "56 pages, comments welcome", "summary": "We give a new integral representation of the $\\wedge^2 \\otimes \\mathrm{std}_2$ $L$-function of generic cusp forms on $\\mathbf{GU}_{2,2}\\times \\mathbf{GL}_2$ and $\\mathbf{GL}_4 \\times \\mathbf{GL}_2$ and we use it to prove a relation between its central $L$-value and the non-spherical period over $\\mathbf{GL}_2 \\times_{\\mathrm{det}} \\mathbf{GL}_2$. Exploiting the theta correspondence for $(\\mathbf{GL}_4,\\mathbf{GL}_4)$, we obtain a relation between the central value of the $L$-function attached to the strongly tempered spherical pair $(\\mathbf{GL}_4 \\times \\mathbf{GL}_2,\\mathbf{GL}_2 \\times \\mathbf{GL}_2)$ and its associated period. In the case of cusp forms on $\\mathbf{GL}_4 \\times \\mathbf{GL}_2$ that are unramified everywhere, our formula gives new evidence towards a conjecture of Wan-Zhang."}
{"id": "2602.14121", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2602.14121", "abs": "https://arxiv.org/abs/2602.14121", "authors": ["Yiannis Fam"], "title": "Exceptional supercuspidal representations in small residue characteristic", "comment": null, "summary": "In this paper, in residue characteristic 2 and 3, we extend the construction of epipelagic representations of Reeder--Yu to produce new supercuspidals of higher depth, building on work of Gastineau. In particular, we produce examples of epipelagic representations that do not arise from the construction of Reeder--Yu."}
{"id": "2602.14718", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.14718", "abs": "https://arxiv.org/abs/2602.14718", "authors": ["Nikola Adžaga", "Tomislav Gužvić"], "title": "Completing the classification of torsion subgroups for rational elliptic curves over sextic fields", "comment": null, "summary": "We complete the classification of torsion subgroups $E(K)_{\\text{tors}}$ that can occur for an elliptic curve $E/\\mathbb{Q}$ over a sextic number field $K$. Previous work determined the complete set of these groups, leaving the existence of only one group in question: $C_3 \\oplus C_{18}$. We prove that this group does not occur.\n  Our proof relies on the theory of Galois representations attached to elliptic curves. The assumed existence of a $C_3 \\oplus C_{18}$ torsion subgroup would impose strong, simultaneous constraints on the mod-$2$ and $3$-adic Galois representations of the curve. By applying the recent classification of $\\ell$-adic Galois images for elliptic curves over $\\mathbb{Q}$, we translate these arithmetic constraints into a problem of Diophantine geometry: the $j$-invariant of such a curve must correspond to a rational point on one of the finitely many modular curves. We then analyze these curves using classical methods and show that none have the necessary rational points corresponding to elliptic curves without complex multiplication, thereby proving our main result."}
{"id": "2602.14171", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.14171", "abs": "https://arxiv.org/abs/2602.14171", "authors": ["Yuriy A. Drozd"], "title": "On representations of algebras with radical square zero", "comment": "13 pages", "summary": "We consider a new correspondence between representations of algebras with radical square zero and\n  representations of species. We show that the stable category of representations of such algebra embeds\n  into the representation category of the corresponding species and show how one reconstruct the Auslander-Reiten\n  quiver of the algebra from the Auslander-Reiten quiver of the species."}
{"id": "2602.14746", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.14746", "abs": "https://arxiv.org/abs/2602.14746", "authors": ["Manuel K. -H. Müller"], "title": "Linear independence of theta series of positive-definite, unimodular even lattices", "comment": "10 pages", "summary": "We show that the minimal $g$ for which the degree $g$ theta series of positive-definite, unimodular even lattices of rank $m\\geq24$ are linearly independent is bounded between $\\frac{m}{2}$ and $\\frac{3m}{4}$."}
{"id": "2602.14383", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2602.14383", "abs": "https://arxiv.org/abs/2602.14383", "authors": ["Xiaohu Chen", "Yongliang Sun", "Yaohua Zhang"], "title": "Triangulated categories with a compact silting object, Brown-Comenetz duality and Brown representability theorems", "comment": "37 pages. Comments are welcome", "summary": "In this paper, we establish a dual framework for Neeman's results concerning triangulated categories with compact silting objects by employing Brown--Comenetz duality. This framework introduces an intrinsic non-compact subcategory, provides its characterization, and demonstrates representability theorems for both the low-bounded and bounded subcategories. Additionally, it elucidates how recollements are restricted to short exact sequences on the dual (non-compact) side. Several localization results and specific applications are also derived."}
{"id": "2602.14908", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.14908", "abs": "https://arxiv.org/abs/2602.14908", "authors": ["Akshay Venkatesh", "X. Griffin Wang"], "title": "The Tetrahedral (or $6j$) Symbol", "comment": "95 pages. Comments welcome", "summary": "We will attach a scalar invariant to a tetrahedron whose edges are labelled by irreducible representations of a ternary orthogonal group $\\mathrm{SO}_3$ over a local field. This generalizes the $6j$ symbol whose theory was developed by Racah, Wigner, and Regge.\n  We give several formulas for this invariant, including in terms of hypergeometric-type integrals and functions, and show that it admits a symmetry by the the $23040$-element Weyl group of $\\mathrm{Spin}_{12}$. We then interpret these results in terms of relative Langlands duality, where the dual story comes from the action of $\\mathrm{Spin}_{12}$ on a $16$-dimensional cone of spinors."}
{"id": "2602.14597", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2602.14597", "abs": "https://arxiv.org/abs/2602.14597", "authors": ["Alexandr N. Zubkov"], "title": "Quasi-reductive supergroups with small even parts", "comment": null, "summary": "We describe all supergroups with the largest even supersubgroups being isomorphic to $\\mathrm{GL}_2, \\mathrm{SL}_2$ or $\\mathrm{PSL}_2$. These results are applied to\n  the description of centralizers of certain tori in the quasi-reductive supergroups."}
{"id": "2602.14121", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2602.14121", "abs": "https://arxiv.org/abs/2602.14121", "authors": ["Yiannis Fam"], "title": "Exceptional supercuspidal representations in small residue characteristic", "comment": null, "summary": "In this paper, in residue characteristic 2 and 3, we extend the construction of epipelagic representations of Reeder--Yu to produce new supercuspidals of higher depth, building on work of Gastineau. In particular, we produce examples of epipelagic representations that do not arise from the construction of Reeder--Yu."}
{"id": "2602.14845", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2602.14845", "abs": "https://arxiv.org/abs/2602.14845", "authors": ["Trajan Hammonds"], "title": "Relative Character Asymptotics Beyond Stability for $\\mathrm{PGL}_2 \\times \\mathrm{GL}_1$", "comment": "29 pages", "summary": "The asymptotics of relative characters for real Lie groups were studied for representations $(π, σ)$ arising from Gan-Gross-Prasad pairs $(G,H)$ by Nelson and Venkatesh. They successfully compute the asymptotics of relative characters whenever the conductor of the associated Rankin-Selberg $L$-function $L(π\\boxtimes σ^\\vee)$ lies in a stable locus, i.e. away from conductor dropping. In this paper, we express asymptotics for relative characters in the non-archimedean setting for $(\\mathrm{PGL}_2, \\mathrm{GL}_1)$. The key new innovation is that our method overcomes the stability hypothesis and allows for significant conductor dropping."}
{"id": "2602.14845", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2602.14845", "abs": "https://arxiv.org/abs/2602.14845", "authors": ["Trajan Hammonds"], "title": "Relative Character Asymptotics Beyond Stability for $\\mathrm{PGL}_2 \\times \\mathrm{GL}_1$", "comment": "29 pages", "summary": "The asymptotics of relative characters for real Lie groups were studied for representations $(π, σ)$ arising from Gan-Gross-Prasad pairs $(G,H)$ by Nelson and Venkatesh. They successfully compute the asymptotics of relative characters whenever the conductor of the associated Rankin-Selberg $L$-function $L(π\\boxtimes σ^\\vee)$ lies in a stable locus, i.e. away from conductor dropping. In this paper, we express asymptotics for relative characters in the non-archimedean setting for $(\\mathrm{PGL}_2, \\mathrm{GL}_1)$. The key new innovation is that our method overcomes the stability hypothesis and allows for significant conductor dropping."}
{"id": "2602.14864", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.14864", "abs": "https://arxiv.org/abs/2602.14864", "authors": ["Robin van Haastrecht", "Genkai Zhang", "Yufeng Zhao"], "title": "Commutativity of invariant differential operators on vector bundles on Hermitian symmetric spaces", "comment": "23 pages", "summary": "Let $G/K$ be a Hermitian symmetric space and $V_τ$ an irreducible representation of $K$. We study the ring $\\mathcal D^G(G/K, V_τ)$ of $G$-invariant differential operators on sections of vector bundles $G\\times_{(K, τ)} V_τ$ over $G/K$ defined by a finite-dimensional representation $(V_τ, τ)$ of $K$. We classify irreducible representations $(V_τ, τ)$ such that $\\mathcal D^G(G/K, V_τ)$ is commutative. We construct eigenfunctions for the differential operators and study the invariance property of the eigenvalues under the Weyl group for the restricted real root system of $G$."}
{"id": "2602.14902", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2602.14902", "abs": "https://arxiv.org/abs/2602.14902", "authors": ["L. Ruhstorfer", "A. A. Schaeffer Fry"], "title": "Galois automorphisms and blocks covering unipotent blocks", "comment": null, "summary": "In this paper we prove that a recent condition of Lyons--Martínez--Navarro--Tiep, regarding the field of values of extensions of characters in principal blocks, is satisfied for all finite simple groups, which when combined with their results gives a new characterization of finite groups with a normal $\\ell$-complement for a prime $\\ell$. This leads us to study the distribution of characters in unipotent blocks of disconnected reductive groups and show that this is well-behaved under a generalization of $d$-Harish-Chandra theory. We go on to study the blockwise Galois--McKay (also known as the Alperin--McKay--Navarro) conjecture for the blocks of almost (quasi-)simple groups above unipotent blocks."}
{"id": "2602.14933", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2602.14933", "abs": "https://arxiv.org/abs/2602.14933", "authors": ["Mikhail Venchakov"], "title": "Rook placements and coadjoint orbits for maximal unipotent subgroups of finite symplectic groups", "comment": "21 pages", "summary": "Let $U$ be a maximal unipotent subgroup in a symplectic group over a finite field of sufficiently large characteristic $p$. According to the Kirillov's orbit method, the coadjoint orbits of the group $U$ play the key role in the description of irreducible complex characters of $U$. Almost all important classes of orbits and characters studied to the moment can be uniformly described as the orbits and characters associated with so-called orthogonal rook placements. In the paper, we construct a semi-direct decomposition for the corresponding irreducible characters in the spirit of the Mackey little group method. As a corollary, we present an explicit formula for the character corresponding to an orbit of maximal possible dimension."}
{"id": "2602.14953", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.14953", "abs": "https://arxiv.org/abs/2602.14953", "authors": ["Stefan Dawydiak"], "title": "Standard modules of affine Hecke algebras", "comment": "12 pages, comments welcome!", "summary": "Let $G$ be a connected reductive group defined and split over a non-archimedean local field $F$. We give a new geometric proof of a special case of a recent theorem of Solleveld. Namely, we show that the class of standard Iwahori-spherical $G(F)$-representations, a notion a priori dependent on the coefficient field being the complex numbers, is actually defined over $\\bar{\\mathbb{Q}}_\\ell$.\n  An unpublished theorem of Clozel, proven with global techniques, says that the class of essentially square-integrable representations is also defined over $\\bar{\\mathbb{Q}}_\\ell$. As an application of our main result, we give a local proof of this theorem for $G=\\mathrm{GL}_n$."}
{"id": "2602.14586", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.14586", "abs": "https://arxiv.org/abs/2602.14586", "authors": ["Antonio Cauchi", "Armando Gutierrez Terradillos"], "title": "$L$-functions and linear periods for $\\mathbf{GL}_4 \\times \\mathbf{GL}_2$ and $\\mathbf{GU}_{2,2}\\times \\mathbf{GL}_2$", "comment": "56 pages, comments welcome", "summary": "We give a new integral representation of the $\\wedge^2 \\otimes \\mathrm{std}_2$ $L$-function of generic cusp forms on $\\mathbf{GU}_{2,2}\\times \\mathbf{GL}_2$ and $\\mathbf{GL}_4 \\times \\mathbf{GL}_2$ and we use it to prove a relation between its central $L$-value and the non-spherical period over $\\mathbf{GL}_2 \\times_{\\mathrm{det}} \\mathbf{GL}_2$. Exploiting the theta correspondence for $(\\mathbf{GL}_4,\\mathbf{GL}_4)$, we obtain a relation between the central value of the $L$-function attached to the strongly tempered spherical pair $(\\mathbf{GL}_4 \\times \\mathbf{GL}_2,\\mathbf{GL}_2 \\times \\mathbf{GL}_2)$ and its associated period. In the case of cusp forms on $\\mathbf{GL}_4 \\times \\mathbf{GL}_2$ that are unramified everywhere, our formula gives new evidence towards a conjecture of Wan-Zhang."}
{"id": "2602.14908", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.14908", "abs": "https://arxiv.org/abs/2602.14908", "authors": ["Akshay Venkatesh", "X. Griffin Wang"], "title": "The Tetrahedral (or $6j$) Symbol", "comment": "95 pages. Comments welcome", "summary": "We will attach a scalar invariant to a tetrahedron whose edges are labelled by irreducible representations of a ternary orthogonal group $\\mathrm{SO}_3$ over a local field. This generalizes the $6j$ symbol whose theory was developed by Racah, Wigner, and Regge.\n  We give several formulas for this invariant, including in terms of hypergeometric-type integrals and functions, and show that it admits a symmetry by the the $23040$-element Weyl group of $\\mathrm{Spin}_{12}$. We then interpret these results in terms of relative Langlands duality, where the dual story comes from the action of $\\mathrm{Spin}_{12}$ on a $16$-dimensional cone of spinors."}
