{"id": "2601.00971", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2601.00971", "abs": "https://arxiv.org/abs/2601.00971", "authors": ["Abid Ali", "Lisa Carbone", "Elizabeth Jurisich", "Scott H. Murray"], "title": "Prosummability in Kac--Moody groups", "comment": null, "summary": "Let $\\mathfrak{g}$ be a symmetrizable Kac--Moody algebra. We describe {standard graded} $\\mathfrak{g}$-modules $V$, which we use to construct a completion $\\widehat{V}$ and pro-unipotent group $\\widehat{U}$ in $\\GL(\\widehat{V})$. These standard graded modules include the adjoint module, all integrable modules, Category~$\\mathcal{O}$ modules, and opposite Category~$\\mathcal{O}$ modules. We prove that the elements of $\\widehat{U}$ are pro-summable series, that is, they are projective limits of summable series on quotients $\\widehat{V}/\\prod_{j=k}^\\infty{V}_j$, for each $k>0$. We give an explicit construction of root subalgebras and their completions, corresponding to every root including the imaginary roots. We also construct complete root groups for imaginary roots, whose elements are also pro-summable series acting on $\\widehat{V}$. We show that these groups are isomorphic to groups of power series in variables corresponding to basis elements for the imaginary root space."}
{"id": "2601.01187", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.01187", "abs": "https://arxiv.org/abs/2601.01187", "authors": ["Zhenxing Di", "Liping Li", "Li Liang"], "title": "Representations of generalized linear Reedy categories and abelian model structures", "comment": null, "summary": "In this paper we consider representations of generalized $k$-linear Reedy categories $\\underline{\\mathscr{C}}$, a common generalization of $k$-linear Reedy categories introduced by Georgiois-Št'ovíček and $k$-linearizations of generalized Reedy categories introduced by Berger-Moerdijk, and construct abelian model structures on $\\underline{\\mathscr{C}} \\text{-}\\mathrm{Mod}$. In the first part, we show that $\\underline{\\mathscr{C}}$ can be viewed as an infinite categorical analogue of standardly stratified algebras. Explicitly, we give a parameterization of irreducible representations of $\\underline{\\mathscr{C}} \\text{-}\\mathrm{Mod}$, provide several sufficient criteria such that $\\underline{\\mathscr{C}} \\text{-}\\mathrm{Mod}$ is equivalent to the Cartesian product of module categories over the ``local\" endomorphism algebras of $\\underline{\\mathscr{C}}$, and describe applications of these results to representation theory of some interesting combinatorial categories including categories of spans and the category of finite dimensional vector spaces over a finite field and linear maps. In the second part, using the technique of Grothendieck bifibrations, we glue a family of complete cotorsion pairs in the module categories of these ``local\" endomorphism algebras to a complete cotorsion pair in $\\underline{\\mathscr{C}} \\text{-}\\mathrm{Mod}$, and deduce that under certain mild conditions a family of abelian model structures on these ``local\" module categories can be glued to an abelian model structure on $\\underline{\\mathscr{C}} \\text{-}\\mathrm{Mod}$. As applications, we obtain a few abelian model structures on generalized $k$-linear direct or inverse categories."}
{"id": "2601.01379", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.01379", "abs": "https://arxiv.org/abs/2601.01379", "authors": ["Lee Tae Young"], "title": "Relations between values and zeros of irreducible characters of symmetric groups", "comment": null, "summary": "We prove certain polynomial relations between the values of complex irreducible characters of general finite symmetric groups. We use it to find some sets of conjugacy classes such that no finite symmetric group has a complex irreducible character that vanishes at every class in the set. In particular, we show that if $n$ satisfies certain conditions, then $S_n\\setminus \\{1\\}$ cannot be covered by the set of zeros of three irreducible characters. We also prove that the values of character of $2$-defect zero can be expressed as rational functions in $n$, and build a recursive algorithm to find these rational functions. As another application, we improve a result by A. Miller on identification of irreducible characters by checking small number of values."}
{"id": "2601.01518", "categories": ["math.RT", "hep-th", "math-ph", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.01518", "abs": "https://arxiv.org/abs/2601.01518", "authors": ["Yalong Cao", "Andrei Okounkov", "Yehao Zhou", "Zijun Zhou"], "title": "Shifted quantum groups via critical stable envelopes", "comment": "102 pages", "summary": "Given a symmetric quiver with potential, we develop a geometric construction of shifted Yangians acting on the critical cohomologies of antidominantly framed quiver varieties with extended potentials, using the $R$-matrices constructed from critical stable envelopes. We relate such Reshetikhin type Yangians to Drinfeld type Yangians arising from critical cohomological Hall algebras. Several detailed examples, including the trivial, Jordan, and tripled Jordan quivers are explicitly computed.\n  For symmetric quiver varieties with potentials, by using the smallness property of their affinization maps, we derive explicit formulas for quantum multiplication by divisors in terms of Casimir elements of the associated Lie (super)algebras, extending results from Nakajima quiver varieties to the critical setting. A similar formula in the antidominantly framed case is also obtained, which includes Hilbert schemes of points on $\\mathbb C^3$ as examples."}
{"id": "2601.00910", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.00910", "abs": "https://arxiv.org/abs/2601.00910", "authors": ["Runbo Li"], "title": "On the largest prime factor of integers in short intervals III", "comment": "32 pages", "summary": "Using Watt's mean value theorem and a delicate sieve decomposition, the author shows that the interval $[x, x+x^{\\frac{1}{2}+\\varepsilon}]$ contains an integer with a prime factor larger than $x^{\\frac{35}{36}-\\varepsilon}$ for sufficiently large $x$. This gives a solution with $γ= \\frac{1}{36}$ to the Exercise 5.1 in Harman's monograph and improves the previous record of the author proved in 2024, where $γ= \\frac{1}{26.5}$ is obtained."}
{"id": "2601.01544", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.01544", "abs": "https://arxiv.org/abs/2601.01544", "authors": ["Eugenio Giannelli", "Nguyen N. Hung"], "title": "Hall $π$-subgroups and characters of $π'$-degree", "comment": null, "summary": "We study the relationship between the existence of Hall $π$-subgroups and that of irreducible characters of $π'$-degree with prescribed fields of values in finite groups. This work extends a result of Navarro and Tiep from a single odd prime to multiple odd primes."}
{"id": "2601.00958", "categories": ["math.NT", "math.CO", "math.QA", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.00958", "abs": "https://arxiv.org/abs/2601.00958", "authors": ["Lisa Carbone", "Pranav Shankar"], "title": "Kac--Moody Fibonacci sequences", "comment": null, "summary": "We summarize known results on how to generate an infinite family of integer sequences from the root lattices of rank 2 Kac--Moody algebras. We compute and tabulate the first twenty entries of a number of these sequences. This provides an overarching framework for a large class of Fibonacci-type integer sequences, evaluations of Chebyshev S and U-polynomials and others."}
{"id": "2601.01582", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.01582", "abs": "https://arxiv.org/abs/2601.01582", "authors": ["Gerhard Hiss", "Caroline Lassueur"], "title": "On the source algebra equivalence class of blocks with cyclic defect groups, III", "comment": "31 pages", "summary": "This series of papers is a contribution to the program of classifying $p$-blocks of finite groups up to source algebra equivalence, starting with the case of cyclic blocks. To any $p$-block $\\mathbf{B}$ of a finite group with cyclic defect group $D$, Linckelmann associated an invariant $W( \\mathbf{B} )$, which is an indecomposable endo-permutation module over $D$, and which, together with the Brauer tree of~$\\mathbf{B} $, essentially determines its source algebra equivalence class.\n  In Part II of our series, assuming that $p$ is an odd prime, we reduced the classification of the invariants $W( \\mathbf{B} )$ arising from cyclic $p$-blocks $\\mathbf{B}$ of quasisimple classical groups to the classification for cyclic $p$-blocks of quasisimple quotients of special linear or unitary groups. This objective is achieved in the present Part III."}
{"id": "2601.00983", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.00983", "abs": "https://arxiv.org/abs/2601.00983", "authors": ["Ali K. Uncu"], "title": "Combinatorial Proofs of Ismail's Identities on Al-Salam--Chirara Polynomials", "comment": "Happy Birthday Mourad! 13 pages. Accepted at the Arabian Journal of Mathematics for Mourad Ismail's 80th birthday special collection", "summary": "We present new proofs of two identities arising in the work of Mourad Ismail using partition theoretic generating function interpretations."}
{"id": "2601.01707", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.01707", "abs": "https://arxiv.org/abs/2601.01707", "authors": ["Carmen Caprau", "Mohamad N. Nasser"], "title": "The virtual singular twin monoid and group: presentations and representations", "comment": null, "summary": "In this article, we introduce the algebraic definitions and presentations of the virtual singular twin monoid and virtual singular twin group, denoted by $VSTM_n$ and $VST_n$, respectively, for a positive integer $n$. These structures extend the twin group $T_n$ in close analogy to how the virtual singular braid monoid and virtual singular braid group extend the classical braid group. We then construct and study representations of the group $VST_n$, for $n \\geq 3$, focusing in particular on extending the representations $η_1$ and $η_2$ of $T_n$, introduced by M. Nasser, to $VST_n$ via the $2$-local extension method. To analyze the resulting representations, $η_1'$ and $η_2'$, and their properties, we establish necessary and sufficient conditions for irreducibility and show that both $η_1'$ and $η_2'$ are unfaithful. Additionally, we classify all complex homogeneous $2$-local representations of $VST_n$ for every integer $n\\geq 3$, providing a foundation for further investigation into representations of $VST_n$."}
{"id": "2601.01019", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.01019", "abs": "https://arxiv.org/abs/2601.01019", "authors": ["Martin Klazar"], "title": "Two algebraic proofs of the transcendence of $\\mathrm{e}$ based on formal power series", "comment": "17 pages", "summary": "We first remind the classical analytical proof of the transcendence of $\\mathrm{e}$ due to Hilbert. Then, using formal power series, we give two algebraic semiformal proofs of the same result. The first proof is a specialization of a proof of the Lindemann-Weierstrass theorem given by Beukers, Bézivin and Roba [2]. The second proof uses improper integrals of formal power series and is due to this author. At the beginning, we explain what ``semiformal'' means and indicate yet another analytical proof of the transcendence of $\\mathrm{e}$. Like the two algebraic proofs, it avoids uncountable sets. It is due to this author in [4]."}
{"id": "2601.01727", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.01727", "abs": "https://arxiv.org/abs/2601.01727", "authors": ["Paul Boisseau", "Weixiao Lu", "Hang Xue"], "title": "The global Gan--Gross--Prasad conjecture for Fourier--Jacobi periods on unitary groups II: Comparison of the relative trace formulae", "comment": "This is the second part of a split version of the article at arXiv:2404.07342", "summary": "This is the second of a series of three papers where we prove the Gan--Gross--Prasad conjecture for Fourier--Jacobi periods on unitary groups and an Ichino--Ikeda type refinement. Our strategy is based on the comparison of relative trace formulae formulated by Liu. The goal of this second paper is to compare the two relative trace formulae."}
{"id": "2601.01242", "categories": ["math.NT", "math.AG", "math.AT", "math.QA"], "pdf": "https://arxiv.org/pdf/2601.01242", "abs": "https://arxiv.org/abs/2601.01242", "authors": ["Jordan Ellenberg", "Mark Shusterman"], "title": "Averages of Arithmetic Functions over Conductors of Function Fields", "comment": null, "summary": "For a finite group $G$ and a sufficiently large (but fixed) prime power $q$ coprime to $G$ we obtain asymptotics for the number of regular Galois extensions $L/ \\mathbb{F}_q(t)$, with $\\mathrm{Gal}(L/\\mathbb{F}_q(t)) \\cong G$, ramified at a single place of $\\mathbb{F}_q(t)$, thus making progress on a positive characteristic analog of the Boston--Markin conjecture. We also obtain similar results for other arithmetic functions of the product of places of $\\mathbb{F}_q(t)$ ramified in $L$, and for more general one-variable function fields over $\\mathbb{F}_q$ in place of $\\mathbb{F}_q(t)$.\n  Some of our proofs make crucial use of a series of recent breakthroughs by Landesman--Levy, as well as a new `vanishing of stable homology in a given direction' result for representations of braid groups arising from braided vector spaces. Other inputs include a study of (rings of coinvariants of) braided vector spaces associated to racks with $2$-cocycles, a connection between convolution of arithmetic functions and direct sums of braided vector spaces, and a Goursat lemma for racks."}
{"id": "2601.01738", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.01738", "abs": "https://arxiv.org/abs/2601.01738", "authors": ["Paul Boisseau", "Weixiao Lu", "Hang Xue"], "title": "The global Gan--Gross--Prasad conjecture for Fourier--Jacobi periods on unitary groups III: Proof of the main theorems", "comment": "This is the third part of a split version of the article at arXiv:2404.07342", "summary": "This is the third and the last of a series of three papers where we prove the Gan--Gross--Prasad conjecture for Fourier--Jacobi periods on unitary groups and an Ichino--Ikeda type refinement. Our strategy is based on the comparison of relative trace formulae formulated by Liu. In this paper, we compute the spectral expansions of these formulae and end the proof of the conjectures via a reduction to the corank zero case."}
{"id": "2601.01251", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.01251", "abs": "https://arxiv.org/abs/2601.01251", "authors": ["Ido Karshon", "Mark Shusterman"], "title": "Pro-$\\ell$-by-cyclotomic and tamely ramified variants of the Neukirch-Uchida Theorem", "comment": null, "summary": "We prove a generalization of the Neukirch-Uchida Theorem. In particular, we show that the isomorphism type of a number field $K$ can be recovered from the maximal pro-$\\ell$-by-cyclotomic quotient of its absolute Galois group $G_{\\overline{K}/K}$. This should be contrasted with the previous result that the isomorphism type cannot, in general, be recovered from the maximal pronilpotent quotient. We also show that the isomorphism type can be recovered from the maximal tamely ramified quotient."}
{"id": "2601.01744", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.01744", "abs": "https://arxiv.org/abs/2601.01744", "authors": ["Monica Garcia", "Léa Lavoué"], "title": "Brick-finite skew-gentle algebras are representation-finite", "comment": null, "summary": "We show that a skew-gentle algebra is brick-finite if and only if it is representation-finite, generalizing Plamondon's original result for gentle algebras."}
{"id": "2601.01324", "categories": ["math.NT", "math.GR", "math.GT"], "pdf": "https://arxiv.org/pdf/2601.01324", "abs": "https://arxiv.org/abs/2601.01324", "authors": ["Nhat Minh Doan", "Sang-hyun Kim", "Mong Lung Lang", "Ser Peow Tan"], "title": "Optimal Farey sequence for the Congruence subgroup $Γ_0(2^{n})$", "comment": "15 pages, 0 figures", "summary": "We prove that $Γ_0(2^n)$ ($n\\ge2$) has a Farey sequence $\\{e_i\\}$ such that $e_i \\le 2^{n-1}$ for all $e_i$. The above upper bound is optimal, and there exists a unique $j$ such that $e_j= 2^{n-1} $. For each $e_i$, there exists a unique $a_i$ such that $\\{ a_i/e_i\\}\\cup \\{\\infty\\}$ is the set of ideal vertices of a fundamental domain of $Γ_0(2^n)$ whose side-pairings give a set of independent generators of $Γ_0(2^n)$."}
{"id": "2601.01883", "categories": ["math.RT", "math.RA"], "pdf": "https://arxiv.org/pdf/2601.01883", "abs": "https://arxiv.org/abs/2601.01883", "authors": ["Takuma Aihara"], "title": "A note on a homological epimorphism whose source is a piecewise hereditary algebra", "comment": "3 pages", "summary": "We study a homological epimorphism of proper dg algebras and show that if the source is a finite dimensional piecewise hereditary algebra, then the target is derived equivalent to some piecewise hereditary algebra."}
{"id": "2601.01603", "categories": ["math.NT", "cs.CR"], "pdf": "https://arxiv.org/pdf/2601.01603", "abs": "https://arxiv.org/abs/2601.01603", "authors": ["Tianshuo Yang"], "title": "Matrix Kloosterman Sums, Random Matrix Statistics, and Cryptography", "comment": "14 pages, 14 figures", "summary": "This paper presents a comprehensive study of matrix Kloosterman sums, including their computational aspects, distributional behavior, and applications in cryptographic analysis. Building on the work of [Zelingher, 2023], we develop algorithms for evaluating these sums via Green's polynomials and establish a general framework for analyzing their statistical distributions. We further investigate the associated $L$-functions and clarify their relationships with symmetric functions and random matrix theory. We show that, analogous to the eigenvalue statistics of random matrices in compact Lie groups such as $SU(n)$ and $Sp(2n)$, the normalized values of matrix Kloosterman sums exhibit Sato-Tate equidistribution. Finally, we apply this framework to distinguish truly random sequences from those exhibiting subtle algebraic biases, and we propose a novel spectral test for cryptographic security based on the distributional signatures of matrix Kloosterman sums."}
{"id": "2601.02188", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.02188", "abs": "https://arxiv.org/abs/2601.02188", "authors": ["Kazushi Maeda", "Yoshiki Oshima"], "title": "Square integrability of regular representations on reductive homogeneous spaces", "comment": "7 pages", "summary": "Let $G$ be a real reductive Lie group and $H$ a reductive subgroup of $G$. Benoist-Kobayashi studied when $L^2(G/H)$ is a tempered representation of $G$ and in particular they gave a necessary and sufficient condition for the temperedness in terms of certain functions on Lie algebras. In this paper, we consider when $L^2(G/H)$ is equivalent to a unitary subrepresentation of $L^2(G)$ and we will give a sufficient condition for this in terms of functions introduced by Benoist-Kobayashi. As a corollary, we prove the non-existence of discrete series for homogeneous spaces $G/H$ satisfying certain conditions."}
{"id": "2601.01610", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.01610", "abs": "https://arxiv.org/abs/2601.01610", "authors": ["Xuecai Ma"], "title": "Hecke algebra of $\\mathrm{GL}_n$ over a 2-dimensional local field", "comment": null, "summary": "Using the $\\mathbb{R}((X))$-measure, we define and study certain $\\mathbb{C}((X))$-valued functions on $\\mathrm{GL}_n(F)$ for $F$ a two-dimensional local field. In particular, we define a convolution product on such suitable functions, which leads us to define the Hecke algebra of $\\mathrm{GL}_n(F)$. We then define the measurable $\\mathbb{C}((X))$-representations of $\\mathrm{GL}_n(F)$, and prove that function space is a candidate for such representations."}
{"id": "2601.02221", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2601.02221", "abs": "https://arxiv.org/abs/2601.02221", "authors": ["Lior Silberberg"], "title": "Folding of cluster algebras and quantum toroidal algebras", "comment": null, "summary": "In this paper, we study the relationship between the representation theory of the quantum affine algebra $\\mathcal{U}_q(\\widehat{\\mathfrak{sl}_\\infty})$ of infinite rank, and that of the quantum toroidal algebra $\\mathcal{U}_q(\\mathfrak{sl}_{2n,\\mathrm{tor}})$. Using monoidal categorifications due to Hernandez-Leclerc and Nakajima, we establish a cluster-theoretic interpretation of the folding map $φ_{2n}$ of $q$-characters, introduced by Hernandez. To this end, we introduce a notion of foldability for cluster algebras arising from infinite quivers and study a specific case of cluster algebras of type $A_\\infty$. Using this interpretation of $φ_{2n}$, we prove a conjecture of Hernandez in new cases. Finally, we study a particular simple $\\mathcal{U}_q(\\mathfrak{sl}_{2n,\\mathrm{tor}})$-module whose $q$-character is not a cluster variable, and conjecture that it is imaginary."}
{"id": "2601.01848", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.01848", "abs": "https://arxiv.org/abs/2601.01848", "authors": ["Xingyuan Cai", "Eric H. Liu", "Olivia X. M. Yao"], "title": "Some identities on the second order mock theta functions", "comment": null, "summary": "Recently, Nath and Das investigated congruence properties for the second order mock theta function $B(q)$. In their paper, they asked for analytic proofs of three identities on the second order mock theta functions $A(q)$, $B(q)$ and $μ_2(q)$. In this paper, we settle Nath and Das' open problem by using the $(p, k)$-parametrization of theta functions and several identities due to Hickerson and Mortenson."}
{"id": "2601.02258", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.02258", "abs": "https://arxiv.org/abs/2601.02258", "authors": ["Yuta Takaya", "Milton Lin"], "title": "Categorification of local relative Langlands duality", "comment": "73 pages", "summary": "We formulate the normalized period conjecture proposed by Ben-Zvi, Sakellaridis and Venkatesh in the framework of the categorical local Langlands correspondence and study its relation to distinction problems. Motivated by the work of Feng and Wang in the geometric setting, we verify the conjecture for the Iwasawa-Tate and Hecke periods, assuming the existence of the categorical local Langlands correspondence for $\\mathrm{GL}_2$ with the Eisenstein compatibility."}
{"id": "2601.01905", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.01905", "abs": "https://arxiv.org/abs/2601.01905", "authors": ["Olivier Bordellès", "Florian Daval"], "title": "On a Smoothed Dirichlet Divisor Problem", "comment": "10 pages; Comments are welcome", "summary": "Hardy showed that $\\sum_{n \\ioe x}τ(n)-x(\\log x +2γ-1)$ is not $o(x^{1/4})$. In this article, we prove that $\\sum_{n \\ioe x}τ(n)(1-\\frac{x}{n})-xP(\\log x)=\\frac{1}{4}+O \\left( \\frac{\\log x}{x^{1/4}} \\right)$, where $P$ is a polynomial of degree 2. As a corollary, this estimate enables us to settle a conjecture surmised by Berkane, Bordellès, and Ramaré dealing with the positivity of an integral of the error term in the Dirichlet divisor problem. All results are entirely explicit and allow us to study the proximity between the remainder of the Dirichlet divisor problem and its logarithmic version."}
{"id": "2601.02290", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.02290", "abs": "https://arxiv.org/abs/2601.02290", "authors": ["John C. Baez"], "title": "Coxeter and Dynkin Diagrams", "comment": "26 pages LaTeX with 14 image files", "summary": "Coxeter and Dynkin diagrams classify a wide variety of structures, most notably finite reflection groups, lattices having such groups as symmetries, compact simple Lie groups and complex simple Lie algebras. The simply laced or \"ADE\" Dynkin diagrams also classify finite subgroups of SU(2) and quivers with finitely many indecomposable representations. This introductory tour of Coxeter and Dynkin diagrams, based on the column This Week's Finds in Mathematical Physics, is made to accompany a series of lecture videos."}
{"id": "2601.02034", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.02034", "abs": "https://arxiv.org/abs/2601.02034", "authors": ["Ernst-Ulrich Gekeler"], "title": "Modular Forms for \\(\\mathrm{GL}(r, \\mathbb{F}_{q}[T])\\): \\(t\\)-expansions of the basic forms", "comment": null, "summary": "We give closed formulas for the first few expansion coefficients of the basic modular forms for \\(\\mathrm{GL}(r, \\mathbb{F}_{q}[T])\\). Here the rank \\(r\\) is larger or equal to \\(3\\), and the forms in question include the coefficient forms \\(g_{1}, \\dots, g_{r}\\) and the Eisenstein series \\(E_{q^{i}-1}\\) (\\(i \\in \\mathbb{N}\\))."}
{"id": "2601.00958", "categories": ["math.NT", "math.CO", "math.QA", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.00958", "abs": "https://arxiv.org/abs/2601.00958", "authors": ["Lisa Carbone", "Pranav Shankar"], "title": "Kac--Moody Fibonacci sequences", "comment": null, "summary": "We summarize known results on how to generate an infinite family of integer sequences from the root lattices of rank 2 Kac--Moody algebras. We compute and tabulate the first twenty entries of a number of these sequences. This provides an overarching framework for a large class of Fibonacci-type integer sequences, evaluations of Chebyshev S and U-polynomials and others."}
{"id": "2601.02162", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.02162", "abs": "https://arxiv.org/abs/2601.02162", "authors": ["Cécile Armana", "Elena Berardini", "Xavier Caruso", "Antoine Leudière", "Jade Nardi", "Fabien Pazuki"], "title": "A computational approach to Drinfeld modules", "comment": null, "summary": "This survey provides a practical and algorithmic perspective on Drinfeld modules over $\\mathbb F_q[T]$. Starting with the construction of the Carlitz module, we present Drinfeld modules in any rank and some of their arithmetic properties. We emphasise the analogies with elliptic curves, and in the meantime, we also highlight key differences such as their rank structure and their associated Anderson motives. This document is designed for researchers in number theory, arithmetic geometry, algorithmic number theory, cryptography, or computer algebra, offering tools and insights to navigate the computational aspects of Drinfeld modules effectively. We include detailed SageMath implementations to illustrate explicit computations and facilitate experimentation. Applications to polynomial factorisation, isogeny computations, cryptographic constructions, and coding theory are also presented."}
{"id": "2601.01738", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.01738", "abs": "https://arxiv.org/abs/2601.01738", "authors": ["Paul Boisseau", "Weixiao Lu", "Hang Xue"], "title": "The global Gan--Gross--Prasad conjecture for Fourier--Jacobi periods on unitary groups III: Proof of the main theorems", "comment": "This is the third part of a split version of the article at arXiv:2404.07342", "summary": "This is the third and the last of a series of three papers where we prove the Gan--Gross--Prasad conjecture for Fourier--Jacobi periods on unitary groups and an Ichino--Ikeda type refinement. Our strategy is based on the comparison of relative trace formulae formulated by Liu. In this paper, we compute the spectral expansions of these formulae and end the proof of the conjectures via a reduction to the corank zero case."}
{"id": "2601.02258", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.02258", "abs": "https://arxiv.org/abs/2601.02258", "authors": ["Yuta Takaya", "Milton Lin"], "title": "Categorification of local relative Langlands duality", "comment": "73 pages", "summary": "We formulate the normalized period conjecture proposed by Ben-Zvi, Sakellaridis and Venkatesh in the framework of the categorical local Langlands correspondence and study its relation to distinction problems. Motivated by the work of Feng and Wang in the geometric setting, we verify the conjecture for the Iwasawa-Tate and Hecke periods, assuming the existence of the categorical local Langlands correspondence for $\\mathrm{GL}_2$ with the Eisenstein compatibility."}
