{"id": "2602.22909", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.22909", "abs": "https://arxiv.org/abs/2602.22909", "authors": ["Lennart Gehrmann"], "title": "On rational quadratic cocycles", "comment": "13 pages", "summary": "Let $(V,q)$ be a non-degenerate $n$-dimensional quadratic space over the rationals of real signature $(r,s)$. For every integer $1\\leq k \\leq \\min\\{r,n-2\\}$ we construct classes in the cohomology of arithmetic subgroups of $\\mathrm{O}(V)$ with values in the group of codimension $k$ cycles on the quadric of isotropic lines in $V$. Generating series of images of these classes in an equivariant version of the $k$-th Chow group are shown to be Siegel modular forms of genus $k$ in the extremal cases $k=1$ and $k=r$.\n  Soit $(V,q)$ un espace quadratique non dégénéré de dimension $n$ sur les rationnels, de signature réelle $(r,s)$. Pour tout entier $1 \\leq k \\leq \\min\\{r,n-2\\}$, nous construisons des classes dans la cohomologie des sous-groupes arithmétiques de $\\mathrm{O}(V)$ à valeurs dans le groupe des cycles de codimension $k$ sur la quadrique des droites isotropes dans $V$. Les séries génératrices des images de ces classes dans une version équivariante du $k$-ième groupe de Chow sont des formes modulaires de Siegel de genre $k$ dans les cas extrémaux $k=1$ et $k=r$."}
{"id": "2602.22986", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2602.22986", "abs": "https://arxiv.org/abs/2602.22986", "authors": ["Anastasios Slaftsos", "Jorge Vitória"], "title": "Relative $Q$-shaped homological algebra", "comment": null, "summary": "Exact categories are a natural generalisation of abelian categories and provide a fertile ground to develop relative homological algebra. In this paper, starting from a class of relative Gorenstein projective objects in an exact category $(\\mathcal{A},\\mathscr{E})$, we define exact model structures on $\\mathcal{A}$ and cohomology functors that detect trivial objects and weak equivalences. Moreover, we show that varying the exact structure on $\\mathcal{A}$ induces Bousfield (co)localisation sequences between the corresponding homotopy categories. We use these techniques to study the category ${}_{Q,A}\\operatorname{Mod}$ of ${}_{A}\\operatorname{Mod}$-valued representations, for a ring $A$, of a suitable $\\Bbbk$-linear small category $Q$, where we apply our results to a range of objectwise exact structures, ranging from the split exact structure to the abelian one. In particular, we recover the $Q$-shaped derived category of Holm and Jorgensen and construct an intermediate $Q$-shaped homotopy category, analogous to the homotopy category of complexes. Finally, we show that the $Q$-shaped derived category is a Verdier quotient of the $Q$-shaped homotopy category, and that this quotient functor is part of recollement - generalising results of Verdier, Krause, and Iyama-Kato-Miyachi for complexes and $N$-complexes, respectively."}
{"id": "2602.23100", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.23100", "abs": "https://arxiv.org/abs/2602.23100", "authors": ["Caio Bueno"], "title": "Distribution of sums involving Dirichlet characters over the $k$-free integers", "comment": "28 pages", "summary": "Assuming the generalized Riemann hypothesis and a bound for the negative discrete moments of the Riemann zeta function (resp. Dirichlet $L$-functions), we prove the existence of a logarithmic limiting distribution for the normalized partial sums $x^{-\\frac{1}{2k}}\\sum_{n\\leq x}f(n)$, where $f$ is either a quadratic Dirichlet character or a modified Dirichlet character, restricted to the $k$-free integers. Moreover, we strengthen a conjecture made by Aymone, Medeiros and the author (cf. Ramanujan J. 59(3):713-728, 2022) concerning the precise order of magnitude for these partial sums."}
{"id": "2602.23173", "categories": ["math.NT", "hep-th", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.23173", "abs": "https://arxiv.org/abs/2602.23173", "authors": ["Marco Aldi", "Andrija Peruničić"], "title": "Invertible Calabi-Yau Orbifolds over Finite Fields II", "comment": null, "summary": "We state a conjecture about the zeta function of crepant resolutions of Berglund--Hübsch orbifold hypersurfaces over a finite field. In addition to numerical evidence, we show that our conjectural zeta function satisfies the Weil conjectures and we elucidate its connection with Monsky--Washnitzer cohomology."}
