{"id": "2601.22413", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.22413", "abs": "https://arxiv.org/abs/2601.22413", "authors": ["Carlos Segovia"], "title": "The Riemann Hypothesis in Oaxaca", "comment": null, "summary": "An equivalence of the Riemann Hypothesis (RH) enables a direct bridge to the Young lattice. In specific, the classical threshold $\\lim_{n\\to\\infty} σ(n)/(n \\log\\log n) = e^γ \\approx 1.78107$, derived from the asymptotic behavior of the sum-of-divisors function, can be realized combinatorially via limiting proportions associated to specific families of integer partitions."}
{"id": "2601.22453", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.22453", "abs": "https://arxiv.org/abs/2601.22453", "authors": ["Rupam Barman", "Anuj Narode", "Vinay Wagh"], "title": "On Monogeneity of reciprocal polynomials", "comment": "To apper in The Ramanujan Journal", "summary": "Let $\\mathbb{Z}_K$ denote the ring of integers of the number field $K = \\mathbb{Q}(θ)$, where $θ$ is a root of the monic irreducible polynomial $f(x) \\in \\mathbb{Z}[x]$. We say that $f(x)$ is monogenic if $\\mathbb{Z}_K = \\mathbb{Z}[θ]$. A polynomial $f(x) \\in \\mathbb{Z}[x]$ is called reciprocal if $f(x) = x^{\\operatorname{deg}(f)} f(1/x)$. In this article, we derive sufficient conditions for the monogeneity of even degree reciprocal polynomials. By employing properties of the discriminant of reciprocal polynomials, we partially prove a conjecture proposed by Jones in $2021$. Furthermore, we establish a lower bound on the number of certain sextic monogenic reciprocal polynomials."}
{"id": "2601.22822", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.22822", "abs": "https://arxiv.org/abs/2601.22822", "authors": ["Alessandra Migliaccio", "Alessandro Zaccagnini"], "title": "On the average number of representations of an integer as a sum of polynomials computed at prime values", "comment": null, "summary": "We study the average number of representations of an integer $n$ as $n = φ(n_{1}) + \\dots + φ(n_{j})$, for polynomials $φ\\in \\mathbb{Z}[n]$ with $\\partialφ= k\\ge 1$, $\\operatorname{lead}(φ) = 1$, $j \\ge k$, where $n_{i}$ is a prime power for each $i \\in \\{1, \\dots, j\\}$. We extend the results of Languasco and Zaccagnini (2019), for $k=3$ and $j=4$, and of Cantarini, Gambini and Zaccagnini (2020), where they focused on monomials $φ(n) = n^k$, $k\\ge 2$ and $j=k, k + 1$."}
{"id": "2601.23016", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.23016", "abs": "https://arxiv.org/abs/2601.23016", "authors": ["Yusuke Fujiyoshi"], "title": "On the finiteness of prime trees and their relation to modular forms", "comment": "18 pages, 3 figures", "summary": "In this paper, we introduce the prime trees associated with a finite subset $P$ of the set of all prime numbers, and provide conditions under which the tree is of finite type. Moreover, we compute the density of finite-type subsets $P$. As an application, we show that for weight $k \\ge 2$ and levels $N = N'\\prod_{p \\in P} p^{a_p}$, where $N'$ is squarefree and $a_{p} \\geq 2$, every cusp form $f \\in \\mathcal{S}_k(Γ_0(N))$ can be expressed as a linear combination of products of two specific Eisenstein series whenever $P$ is of finite type."}
{"id": "2601.22210", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.22210", "abs": "https://arxiv.org/abs/2601.22210", "authors": ["Hajar Kiamehr", "Senapathi Eswara Rao", "Malihe Yousofzadeh"], "title": "Zero-level integrable modules over twisted affine Lie superalgebras", "comment": null, "summary": "The main result of this paper is the characterization of zero-level integrable finite weight modules, over twisted affine Lie superalgebras. We prove that such a module is parabolically induced from a module which is obtained, in a prescribed way, from a module over a Lie algebra $\\mathscr{L}$ which is either a $\\bbbz$-graded abelian Lie algebra or a direct sum of a $\\bbbz$-graded abelian Lie algebra and the so-called quadratic Lie superalgebra $\\mathcal{Q}$. We give also a complete characterization of both finite dimensional simple $\\mathcal{Q}$-modules as well as bounded finite weight $\\bbbz$-graded simple $\\mathcal{Q}$-modules."}
{"id": "2601.23158", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.23158", "abs": "https://arxiv.org/abs/2601.23158", "authors": ["Jean-François Burnol"], "title": "Some series representing the zeta function for $\\Re s>1$", "comment": "13 pages", "summary": "We present series converging to the Riemann zeta function in its half-plane of convergence, and possessing remainders whose sizes decrease geometrically. They are easy to implement numerically, using only polynomial and power functions, and are efficient for obtaining dozens or hundreds of digits (when the imaginary part is not too large). They may prove less suited to very high precision (tens of thousands of digits), due to a linear cost for each new term. One can express the coefficients as linear combinations of Bernoulli numbers, but this is not advantageous numerically. The method is a development of tools introduced by the author for the evaluation of harmonic series with restricted digits in a given radix."}
{"id": "2601.22649", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.22649", "abs": "https://arxiv.org/abs/2601.22649", "authors": ["Henning Krause", "Balduin Stoye"], "title": "Multisets of finite intervals and a universal category of poset representations", "comment": "11 pages", "summary": "For any finite totally ordered set, the multisets of intervals form an abelian category. Various classes of subcategories admit natural combinatorial descriptions, and counting them yields familiar integer sequences. Surprisingly, in some cases new integer sequences arise. The formulation of this counting problem leads to a universal construction which assigns to any poset a finitely cocomplete additive category; it is abelian when the poset is finite and does not depend on the choice of any ring of coefficients. For a general poset the universal category of representations is abelian if and only if for the lattice of ideals the meet of two compact elements is again compact."}
{"id": "2601.23245", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.23245", "abs": "https://arxiv.org/abs/2601.23245", "authors": ["Tony Feng"], "title": "Eigenweights for arithmetic Hirzebruch Proportionality", "comment": null, "summary": "Prior work of Feng--Yun--Zhang established a (Higher) Arithmetic Hirzebruch Proportionality Principle, expressing the arithmetic volumes of moduli stacks of shtukas in terms of differential operators applied to $L$-functions. This formula involves certain \"eigenweights\" which were calculated in simple cases by Feng--Yun--Zhang, but not in general. We document work of a (custom) AI Agent built upon Gemini Deep Think, which employs tools from algebraic combinatorics to connect these eigenweights to the representation theory of symmetric groups, and then determines them for all classical groups."}
{"id": "2601.22846", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.22846", "abs": "https://arxiv.org/abs/2601.22846", "authors": ["Guy Shtotland"], "title": "Relative Kazhdan Lusztig isomorphism for $GL_{2n}/Sp_{2n}$", "comment": null, "summary": "The Kazhdan Lusztig isomorphism, relating the affine Hecke algebra of a $p$-adic group to the equivariant $K$ theory of the Steinberg variety of its Langlands dual, played a key role in the proof of the Deligne Langlands conjectures concerning the classification of smooth irreducible representations with an Iwahori fixed vector. In this work we state and prove a relative version of the Kazhdan Lusztig isomorphism for the symmetric pair $(GL_{2n},Sp_{2n})$. The relative isomorphism is an isomorphism between the module of compactly supported Iwahori invariant functions on $X=GL_{2n}/Sp_{2n}$ and another module over the affine Hecke algebra constructed using equivariant $K$ theory and the relative Langlands duality. We use this isomorphism to give a new proof of a condition on $X$ distinguished representations."}
{"id": "2601.22926", "categories": ["math.RT", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.22926", "abs": "https://arxiv.org/abs/2601.22926", "authors": ["Young-Hun Kim", "Dominic Searles"], "title": "Poset modules of the $0$-Hecke algebras of type $B$", "comment": "46 pages", "summary": "In 2001, Chow developed the theory of the $B_n$ posets $P$ and the type $B$ $P$-partition enumerators $K^B_P$. To provide a representation-theoretic interpretation of $K^B_P$, we define the poset modules $M^B_P$ of the 0-Hecke algebra $H_n^B(0)$ of type $B$ by endowing the set of type-$B$ linear extensions of $P$ with an $H_n^B(0)$-action. We then show that the Grothendieck group of the category associated to type-$B$ poset modules is isomorphic to the space of type $B$ quasisymmetric functions as both a $\\mathrm{QSym}$-module and comodule, where $\\mathrm{QSym}$ denotes the Hopf algebra of quasisymmetric functions. Considering an equivalence relation on $B_n$ posets, where two posets are equivalent if they share the same set of type-$B$ linear extensions, we identify a natural representative of each equivalence class, which we call a distinguished poset. We further characterize the distinguished posets whose sets of type-$B$ linear extensions form intervals in the right weak Bruhat order on the the hyperoctahedral groups. Finally, we discuss the relationship among the categories associated to type-$B$ weak Bruhat interval modules, $B_n$ poset modules, and finite-dimensional $H_n^B(0)$-modules."}
{"id": "2601.23113", "categories": ["math.RT", "hep-th", "math-ph"], "pdf": "https://arxiv.org/pdf/2601.23113", "abs": "https://arxiv.org/abs/2601.23113", "authors": ["Sylvain Lavau", "Jakob Palmkvist"], "title": "Graded Lie superalgebras from embedding tensors", "comment": "21 pages", "summary": "We show how various constructions of $\\mathbb{Z}$-graded Lie superalgebras are related to each other. These Lie superalgebras have a Lie algebra $\\mathfrak{g}$ as the subalgebra at degree 0, an odd $\\mathfrak{g}$-module V as the subspace at degree 1, and an embedding tensor as an element at degree -1. This is a linear map from V to $\\mathfrak{g}$ satisfying a quadratic constraint, which equips V with the structure of a Leibniz algebra."}
{"id": "2601.23186", "categories": ["math.RT", "math.AC", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.23186", "abs": "https://arxiv.org/abs/2601.23186", "authors": ["Alessandro Danelon"], "title": "Noetherianity for powers of algebraic representations", "comment": "Comments welcome", "summary": "Powers of a polynomial $\\operatorname{GL}$-representation are topologically Noetherian under the action of $\\operatorname{Sym} \\times \\operatorname{GL}$. We show that this result extends to powers of algebraic representations of the orthogonal and the symplectic groups. This work is a natural follow-up to arXiv:2212.05790 and to arXiv:1708.06420."}
{"id": "2601.23199", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.23199", "abs": "https://arxiv.org/abs/2601.23199", "authors": ["Fulin Chen", "Binyong Sun", "Yixiang Weng"], "title": "Vector-valued Gelfand-Kazhdan criterion", "comment": null, "summary": "The Gelfand-Kazhdan criterion is a fundamental tool for studying multiplicity-one properties of local periods of representations. However, it does not apply to many cases arising in the relative Langlands program. Generalizing the usual Gelfand-Kazhdan criterion, we formulate and prove a vector-valued Gelfand-Kazhdan criterion that fits into the general framework of the relative Langlands program. As an illustration of its effectiveness, we establish the multiplicity-one property for the local Asai Rankin-Selberg periods."}
{"id": "2601.23245", "categories": ["math.RT", "math.NT"], "pdf": "https://arxiv.org/pdf/2601.23245", "abs": "https://arxiv.org/abs/2601.23245", "authors": ["Tony Feng"], "title": "Eigenweights for arithmetic Hirzebruch Proportionality", "comment": null, "summary": "Prior work of Feng--Yun--Zhang established a (Higher) Arithmetic Hirzebruch Proportionality Principle, expressing the arithmetic volumes of moduli stacks of shtukas in terms of differential operators applied to $L$-functions. This formula involves certain \"eigenweights\" which were calculated in simple cases by Feng--Yun--Zhang, but not in general. We document work of a (custom) AI Agent built upon Gemini Deep Think, which employs tools from algebraic combinatorics to connect these eigenweights to the representation theory of symmetric groups, and then determines them for all classical groups."}
