{"id": "2602.17197", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.17197", "abs": "https://arxiv.org/abs/2602.17197", "authors": ["Wei Dai", "Changjian Fu", "Liangang Peng"], "title": "On endomorphism algebras of silting complexes over hereditary abelian categories", "comment": null, "summary": "Let $\\mathcal{E}$ be the class of finite-dimensional algebras isomorphic to endomorphism algebras of silting complexes over hereditary abelian categories. It is proved that the class $\\mathcal{E}$ is closed under taking idempotent quotients, idempotent subalgebras and $τ$-reduction. We also show that the proper class consisting of shod algebras is also closed under these operations. In addition, several classic classes of algebras -- including laura, glued, weakly shod algebras -- are proved to be closed under idempotent quotients, thereby generalizing a known result originally established for specific idempotents."}
{"id": "2602.17323", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.17323", "abs": "https://arxiv.org/abs/2602.17323", "authors": ["Adam Skowyrski"], "title": "Iterated mutations of symmetric periodic algebras", "comment": null, "summary": "Following methods used by A. Dugas for investigating derived equivalent pairs of (weakly) symmetric algebras, we apply them in a specific situation, obtaining new deep results concerning iterated mutations of symmetric periodic algebras. More specifically, for any symmetric algebra $Λ$, and an arbitrary vertex $i$ of its Gabriel quiver, one can define mutation $μ_i(Λ)$ of $Λ$ at vertex $i$ via silting mutation of the stalk complex $\\La$. Then $μ_i(Λ)$ is again symmetric, and we can iterate this process. We want to understand the order of $μ_i$, in case the vertex $i$ is $d$-periodic, i.e. the simple module $S_i$ associated to $i$ is periodic of period $d$ (with respect to the syzygy). The main result of this paper shows that then $μ_i$ has order $d-2$, that is $μ_i^{d-2}(Λ)\\congΛ$ (modulo socle), under some additional assumption on the (periodic) projective-injective resolution of $S_i$. Besides, we present briefly some consequences concerning arbitrary periodic vertex and give few sugestive examples showing that this property should hold in general, i.e. without restrictions on the periodic projective resolution."}
{"id": "2602.17370", "categories": ["math.RT", "math.RA", "math.SG"], "pdf": "https://arxiv.org/pdf/2602.17370", "abs": "https://arxiv.org/abs/2602.17370", "authors": ["Severin Barmeier", "Zhengfang Wang"], "title": "Fukaya categories of orbifold surfaces in representation theory", "comment": "36 pages, 11 figures, comments are very welcome", "summary": "We give an introduction to partially wrapped Fukaya categories of surfaces with orbifold singularities. Dissecting an orbifold surface $\\mathbf S$ into polygons, certain dissections give rise to formal generators, inducing a triangulated equivalence between the derived Fukaya category of $\\mathbf S$ and the perfect derived category of a graded associative algebra. This provides a geometric means for obtaining associative algebras -- conjecturally all -- which are derived equivalent to skew-gentle algebras.\n  We include a new perspective on the partially wrapped Fukaya category of an orbifold disk which serves as a local model for the Fukaya categories of general orbifold surfaces. This perspective yields an equivalence between the perfect derived category of a quiver of type $\\mathrm D_{n+1}$ and the perfect derived category of a graded quiver of type $\\widetilde{\\mathrm A}_{n-1}$, the latter being equipped with quadratic zero relations and a nontrivial A$_\\infty$ structure. This equivalence elucidates the relationship between skew-gentle algebras and orbifold surfaces, and the role of deformation theory in this relationship."}
{"id": "2602.16761", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.16761", "abs": "https://arxiv.org/abs/2602.16761", "authors": ["Luc Ramsès Talla Waffo"], "title": "Algebraic representatives of the ratios $ζ(2n+1)/π^{2n}$ and $β(2n)/π^{2n-1}$", "comment": null, "summary": "In \\cite{TallaWaffo2025arxiv2511.02843} we introduced even polynomials $Ξ_n,Λ_n\\in\\mathbb{Q}[x]$ arising from integral representations of $β(2n)/π^{2n-1}$ and $ζ(2n+1)/π^{2n}$. In this paper we give explicit closed formulae for these polynomials in terms of Eulerian numbers and study their structural properties. These properties may prove useful in studies on the arithmetic nature of the ratios $β(2n)/π^{2n}$ and $ζ(2n+1)/π^{2n+1}.$"}
{"id": "2602.17007", "categories": ["math.NT", "math.CA", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.17007", "abs": "https://arxiv.org/abs/2602.17007", "authors": ["Peter Reinhard Hansen", "Chen Tong"], "title": "Complex Moments, Gamma and Riemann Zeta Functions unified by the Parabolic Mellin Transform", "comment": null, "summary": "We present a unified integral framework based on the Fourier-Laplace transform evaluated along a vertical line in the complex plane. By identifying the moment-generating function (MGF) of a random variable with the weights of these integrals, we first establish a general expression for complex fractional moments valid for any random variable with a MGF. Applying this formula to the Gaussian distribution, we recover a global integral representation for the reciprocal Gamma function that unifies it with its reflection. We formalize the underlying operator as the Parabolic Mellin Transform, a holomorphic alternative to the classical Mellin transform that avoids strips of convergence by mapping the vertical line to a parabolic contour. This general framework leads to new meromorphic representations for the Hurwitz and Riemann zeta functions that are valid throughout the critical strip, as well as reformulations of the Riemann hypothesis and the Lindelof hypothesis."}
{"id": "2602.17167", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.17167", "abs": "https://arxiv.org/abs/2602.17167", "authors": ["Enrique González-Jiménez", "Roger Oyono"], "title": "Non-hyperelliptic modular curves of genus 3", "comment": "Typos in the labels of the curves in lines 31, 35, 36, 38, 39, 41, 42, and 43 of Table 1 have been fixed. The equation in line 41 has also been corrected, with respect to the published version", "summary": "A curve $C$ defined over $\\mathbb Q$ is modular of level $N$ if there exists a non-constant morphism from $X_1(N)$ onto $C$ defined over $\\mathbb Q$ for some positive integer $N$. We provide a sufficient and necessary condition for the existence of a modular non-hyperelliptic curve $C$ of genus $3$ and level $N$ such that $\\mathrm{Jac}{(C)}$ is $\\mathbb Q$-isogenous to a given three dimensional $\\mathbb Q$-quotient of $J_1 (N)$. Using this criterion, we present an algorithm to compute explicitly equations for modular non-hyperelliptic curves of genus $3$. Let $C$ be a modular curve of level $N$, we say that $C$ is new if the corresponding morphism between $J_1(N)$ and $\\mathrm{Jac}{(C)}$ factors through the new part of $J_1(N)$."}
{"id": "2602.17299", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.17299", "abs": "https://arxiv.org/abs/2602.17299", "authors": ["Nirvana Coppola", "Lorenzo La Porta", "Matteo Longo"], "title": "On the local-global principle for twists of abelian varieties", "comment": "10 pages, comments are welcome!", "summary": "This paper investigates the existence of a local-global principle for certain twists of abelian varieties defined over number fields. Our main focus is to determine when, for $m$ a positive integer, locally $m$-atic twists of an abelian variety $A$ over a number field $K$ are globally $m$-atic. We define and study a \"Tate-Shafarevich cohomology set\" that governs the obstruction to the local-global principle for $m$-atic twists. We prove that, under some mild assumptions, this set is finite, and give criteria for it to be trivial, i.e. for the local-global principle to be satisfied."}
{"id": "2602.17417", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.17417", "abs": "https://arxiv.org/abs/2602.17417", "authors": ["Maarten Derickx", "Kenji Terao"], "title": "Computing class groups and gonalities of algebraic curves over finite fields", "comment": "21 pages. Comments welcome!", "summary": "We give practical algorithms for computing the divisor class group and the gonality of a curve over a finite field, achieving several orders of magnitude speedup over existing methods for sufficiently large genus or residue field. The approach relies on introducing a precomputation step involving power series-expansions, which allows for an efficient amortized computation of large numbers of Riemann-Roch spaces."}
