{"id": "2601.04228", "categories": ["math.NT", "math.FA"], "pdf": "https://arxiv.org/pdf/2601.04228", "abs": "https://arxiv.org/abs/2601.04228", "authors": ["K. Mahesh Krishna"], "title": "Non-Archimedean Brauer Oval (of Cassini) Theorem and Applications", "comment": "14 Pages, 0 Figures", "summary": "Nica and Sprague [\\textit{Am. Math. Mon., 2023}] derived a non-Archimedean version of the Gershgorin disk theorem. We derive a non-Archimedean version of the oval (of Cassini) theorem by Brauer [\\textit{Duke Math. J., 1947}] which generalizes the Nica-Sprague disk theorem. We provide applications for bounding the zeros of polynomials over non-Archimedean fields. We also show that our result is equivalent to the non-Archimedean version of the Ostrowski nonsingularity theorem derived by Li and Li [\\textit{J. Comput. Appl. Math., 2025}]."}
{"id": "2601.04242", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.04242", "abs": "https://arxiv.org/abs/2601.04242", "authors": ["Benoit Cloitre"], "title": "The holonomic triangle: from a symmetry between $e$ and $π$ to additive Gamma functions", "comment": "22 pages, 2 figures", "summary": "Two linear recurrences exhibit mirror symmetry connecting the constants $e$ and $π$. When parametrized, their asymptotic connection constants extend to meromorphic functions satisfying additive functional equations with rational coefficients. We call such functions additive Gamma functions (AGFs), recognizing Euler's $Γ(z)$ as the order-1 prototype. Our theory reveals a structural dichotomy: one AGF is expressible as Gamma ratios (regular case), another involves incomplete Gamma (irregular case). AGFs complete a holonomic triangle between P-recursive sequences, additive functional equations, and differential equations, unifying discrete and continuous perspectives under the condition that Gamma factors in asymptotics have integer slopes."}
{"id": "2601.04284", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.04284", "abs": "https://arxiv.org/abs/2601.04284", "authors": ["Hector Pasten"], "title": "Sobre los teoremas de Shafarevich y Siegel", "comment": "In Spanish language", "summary": "Presentaremos una nueva demostración del teorema de Shafarevich sobre finitud de curvas elípticas con buena reducción fuera de un conjunto finito de primos dado. Esto da un nuevo punto de entrada a teoremas fundamentales de finitud diofantina tales como el teorema de Siegel sobre la ecuación $S$-unidad. Nuestro argumento está libre de aproximación diofantina o teoría de trascendencia, y se acerca más a las ideas de Faltings en su demostración de la conjetura de Mordell.\n  --\n  We present a new proof of Shafarevich's theorem on finiteness of elliptic curves with good reduction outside a given finite set of primes. This gives a new entry point to fundamental diophantine finiteness theorems such as Siegel's theorem on the $S$-unit equation. Our proof is free from diophantine approximation or transcendence theory, and it is closer to the ideas of Faltings in his proof of Mordell's conjecture ."}
{"id": "2601.05089", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.05089", "abs": "https://arxiv.org/abs/2601.05089", "authors": ["Antoine Médoc"], "title": "Horn inequalities on a quiver with an involution", "comment": "25 pages, 8 figures", "summary": "Derksen and Weyman described the cone of semi-invariants associated with a quiver. We give an inductive description of this cone, followed by an example of refinement of the inequalities characterising anti-invariant weights in the case of a quiver equipped with an involution."}
{"id": "2601.04437", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.04437", "abs": "https://arxiv.org/abs/2601.04437", "authors": ["Lenny Fukshansky", "Sehun Jeong"], "title": "Normal bases of small height in Galois number fields", "comment": "8 pages", "summary": "Let $K$ be a number field of degree $d$ so that $K/\\mathbb Q$ is a Galois extension. The {\\it normal basis theorem} states that $K$ has a $\\mathbb Q$-basis consisting of algebraic conjugates, in fact $K$ contains infinitely many such bases. We prove an effective version of this theorem, obtaining a normal basis for $K/\\mathbb Q$ of bounded Weil height with an explicit bound in terms of the degree and discriminant of $K$. In the case when $d$ is prime, we obtain a particularly good bound using a different method."}
{"id": "2601.04503", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.04503", "abs": "https://arxiv.org/abs/2601.04503", "authors": ["Anwesh Ray"], "title": "On the average $2$-torsion in class groups and narrow class groups of cubic orders with prescribed shape", "comment": "Version 1: 11 pages", "summary": "We study the distribution of $2$-torsion in class groups and narrow class groups of cubic fields and cubic orders subject to prescribed shape conditions. The \\emph{shape} of a cubic order in a number field is a natural geometric invariant taking values in the modular surface $\\mathbb{H}/\\operatorname{GL}_2(\\mathbb{Z})$. Fix a subset $W$ of the modular surface with positive hyperbolic measure and boundary of measure zero. Refining the methods of Bhargava and Varma, we prove that among cubic fields with shape in $W$, the average size of the $2$-torsion subgroup of the class group is $5/4$ for totally real fields and $3/2$ for complex fields, while the average size of the $2$-torsion subgroup of the narrow class group for totally real cubic fields is $2$. We also obtain analogous results for cubic orders satisfying prescribed local conditions at all primes."}
{"id": "2601.04704", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.04704", "abs": "https://arxiv.org/abs/2601.04704", "authors": ["Michael Andrew Henry"], "title": "Automorphic vector-forms using the Cohn-Elkies magic functions", "comment": "Submitted and under review", "summary": "In this study, we introduce the theory of what we call Hecke vector-forms. A Hecke vector-form can be viewed as a vector function representation of some quasiautomorphic form that transforms like an automorphic form on an arbitrarily chosen Hecke triangle group. In other words, because quasiautomorphic forms have complicated transformation behavior when compared with automorphic forms, the construction of a Hecke vector-form is to retrieve a transformation behavior analogous to the simpler, automorphic case. In this way, a Hecke vector-form can be viewed as the vector function analogue of an automorphic form. Since our work is for any quasi-automorphic form over an arbitrary Hecke triangle group, we briefly review the construction of such groups. Furthermore, we review the derivation of the hauptmodul, the automorphic forms, and the normalized quasiautomorphic form of weight 2 for any Hecke triangle group. We then proceed to the theory of Hecke vector-forms and establish the desired transformation behavior with respect to the generators of the associated group. A proof of this fact is strictly elementary, relying on fine properties of binomial coefficients. Lastly, we relate the vector-forms to Hecke automorphic linear differential equations, which are analogues of the frequently researched modular linear differential equations. Our results include Hecke vector-forms of the classical quasimodular forms as the simplest case."}
{"id": "2601.04743", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.04743", "abs": "https://arxiv.org/abs/2601.04743", "authors": ["Russelle Guadalupe"], "title": "Linear identities for partition pairs with $5$-cores", "comment": null, "summary": "We prove an infinite family of linear identities for the number $A_5(n)$ of partition pairs of $n$ with $5$-cores by using certain theta function identities involving the Ramanujan's parameter $k(q)$ due to Cooper, and Lee and Park. Consequently, we deduce an infinite family of congruences for $A_5(n)$ using these linear identities."}
{"id": "2601.04972", "categories": ["math.NT", "math.AG", "math.LO"], "pdf": "https://arxiv.org/pdf/2601.04972", "abs": "https://arxiv.org/abs/2601.04972", "authors": ["Nuno Hultberg"], "title": "New gap principle for semiabelian varieties using globally valued fields", "comment": "43 pages, comments welcome!", "summary": "Hrushovski observed that the new gap principle of Gao-Ge-Kühne is essentially equivalent to the Bogomolov conjecture over arbitrary globally valued fields of characteristic $0$. Building on this observation, we prove a new gap principle for semiabelian varieties by reducing the Bogomolov conjecture for semiabelian varieties to the Bogomolov conjecture for abelian varieties over arbitrary GVFs. This reduction remains valid in positive characteristic; however, the corresponding Bogomolov conjecture for abelian varieties is not yet known in that setting. We prove an unconditional new gap principle in positive characteristic for semiabelian varieties whose abelian quotient is an elliptic curve."}
{"id": "2601.05024", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.05024", "abs": "https://arxiv.org/abs/2601.05024", "authors": ["Jia Li", "Ce Xu"], "title": "Residue Theorem, Regularization and Parity Theorem", "comment": "29 pages, Comments welcome!", "summary": "In this paper, we employ contour integration and residue calculus to derive explicit parity formulas for (cyclotomic) multiple zeta values (MZVs). A key innovation lies in applying double shuffle regularization to the contour integrals, which leads to two distinct regularized parity formulas-one via shuffle and one via stuffle regularization. Notably, this demonstrates for the first time that the contour integral method can be extended to the regularized setting (including the case $k_r=1$), thereby overcoming a limitation of previous approaches. Our results not only provide explicit parity relations at arbitrary depths but also lay the groundwork for extending this technique to other variants of multiple zeta values."}
{"id": "2601.05121", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.05121", "abs": "https://arxiv.org/abs/2601.05121", "authors": ["Trevor D. Wooley"], "title": "Strong paucity in the Brüdern-Robert Diophantine system", "comment": "16 pages", "summary": "Let $k$ be a natural number with $k\\ge 2$, and let $\\varepsilon>0$. We consider the number $V_k^*(P)$ of integral solutions of the system of simultaneous Diophantine equations \\[ x_1^{2j-1}+\\ldots +x_{k+1}^{2j-1}=y_1^{2j-1}+\\ldots +y_{k+1}^{2j-1}\\quad (1\\le j\\le k), \\] with $1\\le x_i,y_i\\le P$ $(1\\le i\\le k+1)$. Writing $L_k^*(P)$ for the number of diagonal solutions with $\\{x_1,\\ldots ,x_{k+1}\\}=\\{y_1,\\ldots ,y_{k+1}\\}$, so that $L_k^*(P)\\sim (k+1)!P^{k+1}$, we prove that \\[ V_k^*(P)-L_k^*(P)\\ll P^{\\sqrt{8k+9}-1+\\varepsilon}. \\] This establishes a strong paucity result improving on earlier work of Brüdern and Robert."}
{"id": "2601.05133", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.05133", "abs": "https://arxiv.org/abs/2601.05133", "authors": ["Nikolaj Glazunov"], "title": "On non-Archimedean quantum mathematics and non-Archimedean (quantum) computation", "comment": "9 pages", "summary": "We consider selected aspects of (non-Archimedean) quantum mathematics and non-Archimedean (quantum) computation."}
{"id": "2601.05189", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.05189", "abs": "https://arxiv.org/abs/2601.05189", "authors": ["Samprit Ghosh"], "title": "Distibution of values of higher derivatives of $L'(s,χ)/L(s,χ)$", "comment": null, "summary": "In this article we study the value distribution theory for the first derivative of the logarithmic derivative of Dirichlet $L$-functions, generalizing certain results of Ihara, Matsumoto et. al. related to ``$M$-functions\" for $σ= $ Re$(s) > 1$. We then discuss how things evolve for higher derivatives."}
