{"id": "2602.15211", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.15211", "abs": "https://arxiv.org/abs/2602.15211", "authors": ["Andrea Conti", "Peter Mathias Gräf"], "title": "$\\mathcal L$-invariants and deep congruences between newforms", "comment": "14 pages", "summary": "We study congruences modulo powers of a prime $p$ between pairs of $p$-new modular Hecke eigenforms of level $Γ_0(p)$ and same weight $k$. Based on explicit computations, we conjecture that every such eigenform $f$ admits a twin to which it is congruent modulo a surprisingly high power of $p$, whose exponent is close to the opposite of the valuation of the $\\mathcal L$-invariant of $f$, and whose Atkin--Lehner sign is opposite to that of $f$. This is a new phenomenon that is not explained by the known results on the $p$-adic variation of eigenforms. Inspired by the global picture, we formulate a local conjecture describing congruences between semistable representations of fixed weight, varying $\\mathcal L$-invariant, and opposite Atkin--Lehner signs. We give some theoretical evidence towards our conjectures."}
{"id": "2602.15299", "categories": ["math.NT", "math.CA", "math.DS"], "pdf": "https://arxiv.org/pdf/2602.15299", "abs": "https://arxiv.org/abs/2602.15299", "authors": ["Alex Burgin", "Anastasios Fragkos", "Michael T. Lacey", "Dario Mena", "Maria Carmen Reguera"], "title": "Szemerédi's Theorem Along Cantor Sets of Integers", "comment": "16 pages", "summary": "Let $\\mathcal C= \\{k_1<k_2 < \\cdots\\}$ be Cantor set of integers, that is a set of integers with restricted digits modulo a base $b$, and suppose $0$ is one of the restricted digits. We show that $$ \\liminf_N \\Expectation_{n\\in [N]} m(A\\cap T^{-k_n} A \\cap \\cdots\n  \\cap T^{-\\ell k_n} A )>0. $$ This is an extension of the IP Ergodic Theorem of Furstenberg and Katznelson, and a partial extension of recent work of Kra and Shalom. In particular, this implies that for any subset of integers $A$ of positive upper Banach density, there is a set $B$ of integers $n$ of positive lower Banach density such that $A$ contains an $\\ell+1$ term progression, with step size $k_n$, where $n\\in B$. This is a complement to recent results of Kra and Shalom, for IP Sets of integers, and Burgin, concerning Sarkozy's Theorem for Primes with restricted digits."}
{"id": "2602.15454", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.15454", "abs": "https://arxiv.org/abs/2602.15454", "authors": ["Gaurab Bardhan", "Nipen Saikia"], "title": "Relations for partitions with distinct even parts except the largest part which is even", "comment": null, "summary": "In this paper, we prove some new \\(q\\)-series identities connecting \\(4\\)-regular partitions and partitions with distinct even parts with largest part being odd. We also define three new partition functions with distinct even parts except the largest part which is even, and prove identities connecting the three partitions with \\(4\\)-regular partitions. Moreover, we also offer some congruence for the three newly defined partitions."}
{"id": "2602.15641", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.15641", "abs": "https://arxiv.org/abs/2602.15641", "authors": ["Rupam Barman", "Anuj Narode", "Vinay Wagh"], "title": "On the discriminant and index of a certain class of polynomials", "comment": "To appear in Bulletin Australian Math. Soc", "summary": "Let $f(x) = (x^{2}+1)^{n} - a x^{n} \\in \\mathbb{Z}[x]$ and assume $f(x)$ is irreducible. Let $θ$ be a root of $f(x)$, set $K= \\mathbb{Q}(θ)$, and denote by $\\mathbb{Z}_{K}$ the ring of integers of $K$. The index of $f$, denoted $\\operatorname{ind}(f)$, is the index of $\\mathbb{Z}[θ]$ in $\\mathbb{Z}_{K}$. A polynomial $f(x)$ is said to be monogenic if $\\operatorname{ind}(f) = 1$. In this article, we explicitly compute the discriminant of the polynomial $f(x)$, and then derive necessary and sufficient conditions on the parameters $a$ and $n$ for $f(x)$ to be monogenic. Furthermore, we provide a complete description of the primes that divide $\\operatorname{ind}(f)$."}
{"id": "2602.15726", "categories": ["math.RT", "math.AT", "math.CT"], "pdf": "https://arxiv.org/pdf/2602.15726", "abs": "https://arxiv.org/abs/2602.15726", "authors": ["Hideto Asashiba", "Amit K. Patel"], "title": "Minimal Projective Resolutions, Möbius Inversion, and Bottleneck Stability", "comment": null, "summary": "We develop a stability theory for minimal projective resolutions of $\\mathbf{P}$-modules, where $\\mathbf{P}$ is a finite metric poset. On the module side, we introduce the \\emph{Galois transport distance}, defined by factoring two modules through a common ``apex'' poset via pairs of Galois insertions and measuring the maximal displacement in the index poset. This construction generalizes the interleaving distance in both the classical one-parameter and multiparameter settings, and yields an extended metric on isomorphism classes of $\\mathbf{P}$-modules.\n  On the homological side, we define a bottleneck distance between minimal projective resolutions by matching indecomposable projectives degreewise, with contractible cones playing the role of diagonal terms. Our main theorem shows that this resolution-level bottleneck distance is always bounded above by the Galois transport distance, providing a metric stability result formulated entirely at the level of modules and their minimal projective resolutions.\n  We then treat persistence as an application. Passing to the interval poset and a kernel construction, we interpret persistence diagrams as minimal projective resolutions of kernel modules and obtain a corresponding stability inequality. In the one-parameter case this recovers classical bottleneck stability, while in the multiparameter setting it extends naturally to signed diagrams arising from minimal projective resolutions. Via a general relationship between minimal projective resolutions and Möbius inversion, these results can be interpreted as a stability theorem for Möbius homology, while remaining entirely phrased in the language of projective resolutions."}
{"id": "2602.15798", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.15798", "abs": "https://arxiv.org/abs/2602.15798", "authors": ["Lidia Angeleri Hügel", "Rosanna Laking", "Francesco Sentieri"], "title": "Mutation of torsion pairs for finite-dimensional algebras", "comment": "40 pages, 8 figures", "summary": "We study the lattice $\\mathbf{tors}(A)$ of torsion pairs in the category $\\mathrm{mod}(A)$ of finitely generated modules over an artinian ring $A$. It was shown by the authors in previous work that $\\mathbf{tors}(A)$ is isomorphic to a lattice formed by certain closed sets, called maximal rigid, in the Ziegler spectrum of the unbounded derived category $\\mathrm{D}(A)$ of $A$. Moreover, the structure of this lattice is described by an operation on maximal rigid sets which encompasses (the dual of) silting mutation. In this paper we provide an explicit description of this operation and we discuss how it is reflected in the lattice $\\mathbf{tors}(A)$. We establish a bijection between the wide intervals in $\\mathbf{tors}(A)$ and the closed rigid sets in the Ziegler spectrum of $\\mathrm{D}(A)$. Moreover, we show that the arrows in the Hasse quiver of $\\mathbf{tors}(A)$ correspond to the closed rigid sets that are almost complete, or equivalently, that can be completed to a maximal rigid set in exactly two ways. Our results are most interesting in the case when $A$ is a finite dimensional algebra. In fact, we generalise results by Adachi, Iyama and Reiten, with an important difference: not every point in a maximal rigid set is mutable. We use the topology on the Ziegler spectrum to determine the mutable points. In the last section of the paper we illustrate our results by the example of a finite dimensional algebra arising from a triangulation of an annulus."}
