{"id": "2601.06283", "categories": ["math.NT", "math.CO", "math.PR", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.06283", "abs": "https://arxiv.org/abs/2601.06283", "authors": ["Jiahe Shen", "Roger Van Peski"], "title": "Eigenvalues of $p$-adic random matrices", "comment": "83 pages. Comments welcome!", "summary": "We develop the basic theory of eigenvalues of $p$-adic random matrices, analogous to the classical theory for random matrices over $\\mathbb{R}$ and $\\mathbb{C}$. Such eigenvalue statistics were proposed as a model for the zeroes of $p$-adic $L$-functions by Ellenberg-Jain-Venkatesh, who computed the limiting distribution of the number of eigenvalues in a unit disc. We compute the full joint distribution of the $n$ eigenvalues of an $n \\times n$ matrix with Haar distribution, obtaining Coulomb gas type formulas as in the archimedean case, with Vandermonde terms leading to eigenvalue repulsion.\n  From these Coulomb gas density functions we derive asymptotics of eigenvalue statistics as $n \\to \\infty$. These include exact computations, such as a closed form\n  $$ρ(x,y) = 1 - θ_3(-\\sqrt{p};||x-y||^2/p)$$\n  for the limiting pair correlation of eigenvalues in $\\mathbb{Z}_p$, and similar results in quadratic extensions. Such formulas yield concrete numerical predictions on zeroes of $p$-adic $L$-functions.\n  For eigenvalues in arbitrary extensions of $\\mathbb{Q}_p$ we also give precise estimates on their pair-repulsion and expected number of eigenvalues in each extension. Finally, we compute the asymptotic probability that all eigenvalues lie in $\\mathbb{Z}_p$.\n  Our proofs combine results from several distinct areas: $p$-adic orbital integrals, roots of random $p$-adic polynomials, the Sawin-Wood moment method for random modules, and Markov chains associated with measures on integer partitions."}
{"id": "2601.06292", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.06292", "abs": "https://arxiv.org/abs/2601.06292", "authors": ["Benjamin Durkan", "Christopher Hughes", "Andrew Pearce-Crump"], "title": "The discrete second moment of mixed derivatives of the Riemann zeta function", "comment": null, "summary": "We establish the full asymptotic for the discrete second moment of the Riemann zeta function of mixed derivatives evaluated at the zeta zeros, providing both unconditional and conditional error terms. This was first studied by Gonek, where only the leading order asymptotic was given, later extended by Conrey--Snaith and Milinovich to include the lower order terms for the first derivative. We extend the case of the first derivative to all derivatives."}
{"id": "2601.06532", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.06532", "abs": "https://arxiv.org/abs/2601.06532", "authors": ["Pierre Dèbes"], "title": "Hurwitz spaces and Inverse Galois Theory", "comment": "26 pages", "summary": "Hurwitz spaces which parametrize branched covers of the line play a prominent role in inverse Galois theory. This paper surveys fifty years of works in this direction with emphasis on recent advances. Based on the Riemann-Hurwitz theory of covers, the geometric and arithmetic setup is first reviewed, followed by the semi-modern developments of the 1990--2010 period: large fields, compactification, descent theory, modular towers. The second half of the paper highlights more recent achievements that have reshaped the arithmetic of Hurwitz spaces, notably via the systematic study of the ring of components. These include the construction of components defined over ${\\mathbb Q}$, and the Ellenberg-Venkatesh-Westerland approach to rational points over finite fields, applied to the Cohen-Lenstra heuristics and the Malle conjecture over function fields ${\\mathbb F}_q(T)$."}
{"id": "2601.07029", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07029", "abs": "https://arxiv.org/abs/2601.07029", "authors": ["Danil Krotkov"], "title": "On families of monic polynomials", "comment": null, "summary": "In this paper we derive generalizations of different properties of monic polynomial families of binomial type, i.e. families of monic polynomials, for which the binomial theorem holds $$ p_n(α+β)=\\sum_{k=0}^n \\left(\\vphantom{\\bigg|}\\genfrac{}{}{0pt}{0}{n}{k}\\right) p_k(α)p_{n-k}(β) $$ Some trivial representations of general ''multiplication'' and ''derivative'' operators are derived. In addition we derive a formula for the logarithmic derivative of general monic polynomial $p_n(x)$ which reduces to the formula $$ \\frac{1}{n}\\frac{p_n'(x)}{p_n(x)} =\\left(x+\\frac{1}{\\varphi'(y)}\\left(\\frac{d}{dy}-n\\mathrm{L}\\right)\\right)^{-1}\\cdot\\left.\\frac{\\varphi(y)}{y\\varphi'(y)}~\\right|_{y=0} $$ derived by the author in binomial case, when the generating function of $p_n(x)$ equals to $e^{x\\varphi(y)}$."}
{"id": "2601.06587", "categories": ["math.RT", "math.GR", "math.RA"], "pdf": "https://arxiv.org/pdf/2601.06587", "abs": "https://arxiv.org/abs/2601.06587", "authors": ["Benjamin Steinberg"], "title": "Quiver presentations for band algebras are defined over the integers", "comment": null, "summary": "A band is a semigroup in which each element is idempotent. In recent years, there has been a lot of activity on the representation theory of the subclass of left regular bands due to connections to Markov chains associated to hyperplane arrangements, oriented matroids, matroids and CAT(0) cube complexes. We prove here that the integral semigroup algebra of a band is isomorphic to the integral path algebra of a quiver modulo an admissible ideal. This leads to a uniform bound quiver presentation for band algebras over all fields. Also, we answer a question of Margolis, Saliola and Steinberg by proving that the integral semigroup algebra of a CW left regular band is isomorphic to the quotient of the integral path algebra of the Hasse diagram of its support semilattice modulo the ideal generated by the sum of all paths of length two. This includes, for example, hyperplane face semigroup algebras."}
{"id": "2601.07030", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07030", "abs": "https://arxiv.org/abs/2601.07030", "authors": ["Paresh Arora", "Koustav Mondal", "Akio Nakagawa", "Fang-Ting Tu"], "title": "Special $L$-values of certain CM weight three Hecke eigenforms", "comment": null, "summary": "Ramanujan's theories of elliptic functions to alternative bases for modular forms connect hypergeometric series with modular forms and have led to applications such as the modularity of certain hypergeometric Galois representations. In this paper, we relate special values of $L$-function of certain CM cusp forms to Ramanujan's alternative bases via the modularity of hypergeometric Galois representations arising from CM elliptic curves over real quadratic fields. We also give a complete classification of these representations."}
{"id": "2601.06696", "categories": ["math.RT", "math.QA"], "pdf": "https://arxiv.org/pdf/2601.06696", "abs": "https://arxiv.org/abs/2601.06696", "authors": ["Ivan Losev", "Alexander Tsymbaliuk", "Trung Vu"], "title": "On De Concini-Kac forms of quantum groups", "comment": "113 pages", "summary": "Quantum groups of semisimple Lie algebras at roots of unity admit several different forms. Among them is the De Concini-Kac form, which is the easiest to define but, perhaps, hardest to study. In this paper, we propose a suitable modification to the De Concini-Kac form, namely the even part algebra, which has some appealing features. Notably, it behaves uniformly with respect to the order of the roots of unity and admits an adjoint action of the Lusztig form. We revisit several results due to De Concini-Kac-Procesi and Tanisaki for the even part algebra. Namely, we give conceptual definitions of the Frobenius and Harish-Chandra centers and describe the entire center in terms of these two subalgebras getting a complete quantum analog of the Veldkamp theorem on the center of the universal enveloping algebras in positive characteristic. We investigate the Azumaya locus of the even part algebra over its center. We also show that the locally finite part of the even part algebra under the adjoint action of the Lusztig form is isomorphic to the reflection equation algebra, which is the quantized coordinate algebra with the product twisted by $R$-matrix. Some results on Lusztig forms at roots of unity are revisited and proved in greater generality including Kempf vanishing theorem and good filtrations on the quantized coordinate algebra."}
{"id": "2601.07042", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07042", "abs": "https://arxiv.org/abs/2601.07042", "authors": ["Alexander Bertoloni Meli", "Peter Dillery"], "title": "A Tannakian description of the local Kaletha gerbe", "comment": "26 pages; comments welcome!", "summary": "We construct, for a $p$-adic field $F$, an explicit semisimple Tannakian category $\\text{RigIsoc}_{F}$ whose category of fiber functors recovers Kaletha's Galois gerbe $\\mathcal{E}_{\\text{Kal}}$. We then classify and write down the simple objects in $\\text{RigIsoc}_{F}$, all of which come from elliptic twisted Levi subgroups of $\\mathrm{GL}_{n}$."}
{"id": "2601.06929", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.06929", "abs": "https://arxiv.org/abs/2601.06929", "authors": ["Alexander B. Ivanov", "Sian Nie"], "title": "Deep level Deligne--Lusztig induction for tamely ramified tori", "comment": null, "summary": "Deep level Deligne--Lusztig representations, which are natural analogues of classical Deligne--Lusztig representations, recently play an important role in geometrization of irreducible supercuspidals of $p$-adic groups. In this paper, we propose a construction of deep level Deligne--Lusztig varieties/representations in the tamely ramified case, extending previous constructions in the unramified case. As an application, under a mild assumption on the residue field, we show that each regular irreducible supercuspidal is the compact induction of a deep level Deligne--Lusztig representation, and generally, each irreducible supercuspidal is a direct summand of the compact induction of the cohomology of a deep level Deligne--Lusztig variety."}
{"id": "2601.07067", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07067", "abs": "https://arxiv.org/abs/2601.07067", "authors": ["Mohamed Mahmoud Chems-Eddin", "Hamza El Mamry"], "title": "Greenberg's conjecture and Iwasawa module of Real biquadratic fields II", "comment": "27 pages", "summary": "In this paper we are interested in the stability of the $2$-rank of the class group in the cyclotomic $\\mathbb{Z}_2$-extension of real biquadratic fields. In fact, we give several families of real biquadratic fields $K$ such that $ rank(A(K)) =rank(A_\\infty(K))$ and $rank(A(K))\\leq 3$, where $A(K)$ and $A_\\infty(K)$ are the $2$-class group and the $2$-Iwasawa module of $K$ respectively. Moreover, Greenberg's conjecture is verified for some new families of number fields; in particular, we determine the complete list of all real biquadratic fields with trivial $2$-Iwasawa module. This work is a continuation of M. M. Chems-Eddin, Greenberg's conjecture and Iwasawa module of real biquadratic fields I, J. Number Theory, 281 (2026), 224-266."}
{"id": "2601.07168", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.07168", "abs": "https://arxiv.org/abs/2601.07168", "authors": ["Loren Spice", "Cheng-Chiang Tsai"], "title": "Jordan decompositions in Lie algebras and their duals", "comment": "19 pp", "summary": "We provide a discussion of Jordan decompositions in the Lie algebra, and the dual Lie algebra, of a reductive group in as uniform a way as possible. We give a counterexample to the claim that Jordan decompositions on the dual Lie algebra are unique, and state an upper bound on how non-unique they can be. We also prove some Chevalley-restriction-type claims about GIT quotients for the adjoint and co-adjoint actions of $G$."}
{"id": "2601.07097", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07097", "abs": "https://arxiv.org/abs/2601.07097", "authors": ["Daniel R. Johnston", "Bryce Kerr"], "title": "The infinitude of square-free palindromes", "comment": "24 pages, 1 figure", "summary": "We settle an open problem regarding palindromes; that is, positive integers which are the same when written forwards and backwards. In particular, we prove that for any fixed base $b\\geq 2$, there exist infinitely many square-free palindromes in base $b$. We also provide an asymptotic expression for the number of such integers $\\leq x$. The core of our proof utilises a hybrid $p$-adic/Archimedean van der Corput process, used in conjunction with an equidistribution estimate of Tuxanidy and Panario, as well as an elementary argument of Cilleruelo, Luca and Shparlinski."}
{"id": "2601.07352", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.07352", "abs": "https://arxiv.org/abs/2601.07352", "authors": ["Shun-Jie Li", "Yang Gao", "Pu Zhang"], "title": "Homotopy categories of admissible model structures on extriangulated categories", "comment": null, "summary": "The extriangulated category is a simultaneous generalization of exact categories and triangulated categories. H. Nakaoka and Y. Palu have proved that the homotopy category of an admissible model structure on a weakly idempotent complete extriangulated category is a triangulated category. Using the classic construction of distinguished triangles given by A. Heller and D. Happel, this paper provides an alternative proof of Nakaoka - Palu Theorem. In fact, the class $Δ$ of distinguished triangles in the present paper and the class $\\widetildeΔ$ of distinguished triangles in \\cite{NP} have the relation $Δ= - \\widetildeΔ$, and hence the two triangulated structures on the homotopy category are isomorphic."}
{"id": "2601.07171", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07171", "abs": "https://arxiv.org/abs/2601.07171", "authors": ["Yucui Lin", "Jiangwei Xue"], "title": "The spinor type number formula for totally definite quaternion orders", "comment": "The result of arXiv:2210.05290 by the same authors has been covered and further generalized by the current preprint", "summary": "Let $D$ be a totally definite quaternion algebra over a totally real number field $F$, and $\\mathcal{O}$ be an $O_F$-order (of full rank) in $D$. The type number $t(\\mathcal{O})$ is an important arithmetic invariant of $\\mathcal{O}$ that counts the number of isomorphism classes of orders belonging to the same genus as $\\mathcal{O}$ (i.e. locally isomorphic to $\\mathcal{O}$ at every finite place $\\mathfrak{p}$ of $F$). The type number formula has been studied by Eichler, Peters, Pizer, Vigneras, Körner and many others. As the genus of $\\mathcal{O}$ further divides into spinor genera, one naturally seeks a finer type number formula for the number of isomorphism classes of orders belonging to the same spinor genus of $\\mathcal{O}$. The main goal of this paper is to provide such a refinement for a large class of quaternion $O_F$-orders $\\mathcal{O}$ that includes all Eichler orders. This enables us to prove that $t(\\mathcal{O})$ is divisible by the order of a quotient group $\\mathrm{WSG}(\\mathcal{O})$ of the Gauss genus group $\\mathrm{Cl}^+(O_F)/\\mathrm{Cl}^+(O_F)^2$ naturally attached to $\\mathcal{O}$. Similarly, we show that the trace of the $\\mathfrak{n}$-Brandt matrix $\\mathfrak{B}(\\mathcal{O}, \\mathfrak{n})$ is divisible by the class number $h(F)$ for any nonzero integral $O_F$-ideal $\\mathfrak{n}$. In particular, the class number $h(\\mathcal{O})=\\mathrm{Tr}(\\mathfrak{B}(\\mathcal{O}, O_F))$ is always divisible by $h(F)$ for such quaternion orders. This generalizes the divisibility result of $h(\\mathcal{O})$ proved in a different way by Chia-Fu Yu and the second named author [Indiana Univ. Math. J., Vol. 70, No. 2 (2021)] in the case when $\\mathcal{O}$ is a maximal $O_F$-order in a totally definite quaternion algebra unramified at all the finite places."}
{"id": "2601.07390", "categories": ["math.RT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.07390", "abs": "https://arxiv.org/abs/2601.07390", "authors": ["Shiyixin Liang"], "title": "A Coherent Version of Geometric Satake Equivalence for Type A", "comment": "63 pages. Any comments are welcome!", "summary": "In this paper we prove a coherent version of geometric Satake equivalence proposed in Cautis-Williams' work arXiv:2306.03023 for type A. In their work, they studied an abelian version of the classical limit Satake category, namely, the Koszul perverse heart of the categorified Coulomb branch for adjoint representations. In this paper we study a subcategory generated by a collection of simple objects. We endow this subcategory with a neutral Tannakian structure and identify it with the finite dimensional representation category $\\mathrm{Rep}({\\check{G}})$ for the Langlands dual group ${\\check{G}}$. Our method uses tools in Cautis-Williams theory and a Hodge module description of the coherent IC extensions of differential sheaves in Xin's work arXiv:2503.14890."}
{"id": "2601.07383", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.07383", "abs": "https://arxiv.org/abs/2601.07383", "authors": ["Fabian Schnelle"], "title": "Igusa stacks for certain abelian-type Shimura varieties", "comment": null, "summary": "We construct Igusa stacks for the good reduction locus of a class of abelian-type Shimura varieties that can be defined in terms of a PEL datum, under the assumption that it is of type (A even) or (C) and unramified at a prime p."}
{"id": "2601.06283", "categories": ["math.NT", "math.CO", "math.PR", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.06283", "abs": "https://arxiv.org/abs/2601.06283", "authors": ["Jiahe Shen", "Roger Van Peski"], "title": "Eigenvalues of $p$-adic random matrices", "comment": "83 pages. Comments welcome!", "summary": "We develop the basic theory of eigenvalues of $p$-adic random matrices, analogous to the classical theory for random matrices over $\\mathbb{R}$ and $\\mathbb{C}$. Such eigenvalue statistics were proposed as a model for the zeroes of $p$-adic $L$-functions by Ellenberg-Jain-Venkatesh, who computed the limiting distribution of the number of eigenvalues in a unit disc. We compute the full joint distribution of the $n$ eigenvalues of an $n \\times n$ matrix with Haar distribution, obtaining Coulomb gas type formulas as in the archimedean case, with Vandermonde terms leading to eigenvalue repulsion.\n  From these Coulomb gas density functions we derive asymptotics of eigenvalue statistics as $n \\to \\infty$. These include exact computations, such as a closed form\n  $$ρ(x,y) = 1 - θ_3(-\\sqrt{p};||x-y||^2/p)$$\n  for the limiting pair correlation of eigenvalues in $\\mathbb{Z}_p$, and similar results in quadratic extensions. Such formulas yield concrete numerical predictions on zeroes of $p$-adic $L$-functions.\n  For eigenvalues in arbitrary extensions of $\\mathbb{Q}_p$ we also give precise estimates on their pair-repulsion and expected number of eigenvalues in each extension. Finally, we compute the asymptotic probability that all eigenvalues lie in $\\mathbb{Z}_p$.\n  Our proofs combine results from several distinct areas: $p$-adic orbital integrals, roots of random $p$-adic polynomials, the Sawin-Wood moment method for random modules, and Markov chains associated with measures on integer partitions."}
{"id": "2601.07421", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07421", "abs": "https://arxiv.org/abs/2601.07421", "authors": ["Nat Sothanaphan"], "title": "Resolution of Erdős Problem #728: a writeup of Aristotle's Lean proof", "comment": "12 pages, no figure", "summary": "We provide a writeup of a resolution of Erdős Problem #728; this is the first Erdos problem (a problem proposed by Paul Erdős which has been collected in the Erdos Problems website) regarded as fully resolved autonomously by an AI system. The system in question is a combination of GPT-5.2 Pro by OpenAI and Aristotle by Harmonic, operated by Kevin Barreto. The final result of the system is a formal proof written in Lean, which we translate to informal mathematics in the present writeup for wider accessibility.\n  The proved result is as follows. We show a logarithmic-gap phenomenon regarding factorial divisibility: For any constants $0<C_1<C_2$ there exist infinitely many triples $(a,b,n)\\in\\mathbb N^3$ such that \\[ a!\\,b!\\mid n!\\,(a+b-n)!\\qquad\\text{and}\\qquad C_1\\log n < a+b-n < C_2\\log n. \\] The argument reduces this to a binomial divisibility $\\binom{m+k}{k}\\mid\\binom{2m}{m}$ and studies it prime-by-prime. By Kummer's theorem, $ν_p\\binom{2m}{m}$ translates into a carry count for doubling $m$ in base $p$. We then employ a counting argument to find, in each scale $[M,2M]$, an integer $m$ whose base-$p$ expansions simultaneously force many carries when doubling $m$, for every prime $p\\le 2k$, while avoiding the rare event that one of $m+1,\\dots,m+k$ is divisible by an unusually high power of $p$. These \"carry-rich but spike-free\" choices of $m$ force the needed $p$-adic inequalities and the divisibility. The overall strategy is similar to results regarding divisors of $\\binom{2n}{n}$ studied earlier by Erdős and by Pomerance."}
{"id": "2601.07707", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07707", "abs": "https://arxiv.org/abs/2601.07707", "authors": ["Debargha Banerjee", "Srijan Das"], "title": "A note on extensions of $p$-adic representations of $\\mathrm{GL}_2(\\mathbb{Q}_p)$", "comment": "Comments welcome", "summary": "We compute extension groups in the category of duals of $p$-adic Banach space representations of $\\mathrm{GL}_2(\\mathbb{Q}_p)$. Focusing on representations arising from the $p$-adic local Langlands correspondence for generic Galois representations, we classify these extensions completely. These results are then applied to prove the vanishing of extensions between the duals of reducible representations and supercuspidal isotypic components of the ètale cohomology of the finite level Drinfeld spaces."}
{"id": "2601.07720", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.07720", "abs": "https://arxiv.org/abs/2601.07720", "authors": ["Peihang Wu"], "title": "Principal bundles on toroidal compactifications of integral canonical models of abelian-type Shimura varieties", "comment": "34 pages, comments welcome!", "summary": "In this paper, we construct canonical extensions of principal $\\mathcal{G}^c$- (and $M^c$-)bundles on toroidal compactifications of integral canonical models of abelian-type Shimura varieties with hyperspecial levels."}
{"id": "2601.07817", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.07817", "abs": "https://arxiv.org/abs/2601.07817", "authors": ["D. R. Heath-Brown"], "title": "Counting Square-full Solutions to $x+y=z$", "comment": null, "summary": "We show that there are $O(B^{3/5-3/1555+\\ep})$ triples $(x,y,z)$ of square-full integesr up to $B$ satisfying the equation $x+y=z$ for any fixed $\\ep>0$. This is the first improvement over the `easy' exponent $3/5$, given by Browning and Van Valckenborgh. One new tool is a strong uniform bound for the counting function for equations $aX^3+bY^3=cZ^3$."}
