{"id": "2602.04111", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.04111", "abs": "https://arxiv.org/abs/2602.04111", "authors": ["Albert Cochrane"], "title": "Multiplicative Subgroups of $\\mathbb{Z}_p^*$ that are Generalized Arithmetic Progressions", "comment": null, "summary": "We prove that a multiplicative subgroup $A_k$ of $\\mathbb{Z}_p^*$ is a generalized arithmetic progression if and only if $|A_k| = 2,\\ 4,$ or $p-1$. Much of the argument is built upon recent work studying additive decompositions of subgroups of $\\mathbb{Z}_p^*$, and we generalize a result of Hanson and Petridis to show that any additive $n$-decomposition of a subgroup must be a direct sum."}
{"id": "2602.04211", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.04211", "abs": "https://arxiv.org/abs/2602.04211", "authors": ["Jing Ye"], "title": "Artin twists of Drinfeld modules and Goss L-series", "comment": "66 pages. Comments welcome!", "summary": "Twisted $L$-functions by Dirichlet characters offer deep insights into arithmetic geometry, especially in the study of elliptic curves and abelian varieties over number fields. In the function field setting, Drinfeld modules and Anderson modules serve as analogues of elliptic curves and abelian varieties, and Goss $L$-series play the role of Hasse-Weil $L$-functions. This paper introduces a motivic framework for studying twisted Goss $L$-series via Anderson motives associated to Drinfeld modules and Artin representations.\n  For a Drinfeld module and an Artin representation on the absolute Galois group, we present a construction of Anderson motives associated to them and we show that it comes from a uniformizable abelian Anderson module. We also study their associated $L$-series, which recover the norm of the twisted Goss $L$-values. These results provide an interpretation of twisted Goss $L$-values in terms of regulators of Anderson modules with the help of Taelman's class number formula."}
{"id": "2602.04468", "categories": ["math.NT", "math.LO"], "pdf": "https://arxiv.org/pdf/2602.04468", "abs": "https://arxiv.org/abs/2602.04468", "authors": ["Peter Koymans", "Carlo Pagano"], "title": "Hilbert's tenth problem for finitely generated rings", "comment": "Submitted to Notices of the AMS", "summary": "This expository article covers the recent developments surrounding Hilbert's tenth problem for finitely generated rings. We start by recounting the history of Hilbert's tenth problem over the integers, which was resolved negatively by Matiyasevich--Robinson--Davis--Putnam in 1970. In order to pass from $\\mathbb{Z}$ to the finitely generated setting, we explain a criterion of Poonen that connects this to a problem in the theory of elliptic curves. Finally, we outline the main ideas behind the recent resolution of this elliptic curve problem by the authors."}
{"id": "2602.04558", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.04558", "abs": "https://arxiv.org/abs/2602.04558", "authors": ["Yangcheng Li", "Pingzhi Yuan", "Shuang Li", "Yuanpeng Zeng"], "title": "On cyclically covering subspaces of $\\mathbb{F}^n_q$", "comment": "20 pages", "summary": "For a prime power \\( q \\) and a positive integer \\( n \\), a subspace \\( U \\subseteq \\mathbb{F}_q^n \\) is called cyclically covering if the union of all its cyclic shifts covers the whole space \\( \\mathbb{F}_q^n \\). Let \\( h_q(n) \\) denote the maximum possible codimension of such a subspace. This paper focuses on the case \\( h_q(n) = 0 \\). We provide necessary and sufficient conditions under which \\( h_q(n) = 0 \\) holds. As an application, we show that \\( h_q(\\ell^t) = 0 \\) whenever \\( q \\) is a primitive root modulo \\( \\ell^t \\). Moreover, we prove that if \\( n \\) is odd and \\( h_q(n) = 0 \\), then also \\( h_q(2n) = 0 \\). As an example, we show that \\( h_3(11) =h_3(16) = 1 \\). Furthermore, we investigate the relationship between the coverings of \\(\\mathbb{F}_{q^m}^n\\) and \\(\\mathbb{F}_q^{mn}\\), and obtain several sufficient conditions for \\(h_{q^m}(n) = 0\\). Specifically, we derive that if \\(n = 3\\) or \\(n = 2^d\\) (where \\(d\\) is a nonnegative integer), then \\(h_4(n) = 0\\)."}
{"id": "2602.04654", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.04654", "abs": "https://arxiv.org/abs/2602.04654", "authors": ["Kiseok Yeon"], "title": "On the density of rational lines on diagonal cubic hypersurfaces", "comment": "14 pages, all comments welcome!", "summary": "In this paper, we establish the asymptotic estimates for the rational lines on diagonal cubic hypersurfaces defined by $\\sum_{i=1}^sc_ix^3_i=0$ with $c_i\\in\\mathbb{Z}\\setminus \\{0\\},$ provided that $s\\geq 19.$ This improves the previously known bound $s\\geq 21$ required to obtain such asymptotic estimates. Our approach develops a multidimensional shifting variables argument together with a pruning argument, and exploits the recent progress on the Parsell-Vinogradov system."}
{"id": "2602.04778", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.04778", "abs": "https://arxiv.org/abs/2602.04778", "authors": ["Hao Peng", "Dmitri Whitmore"], "title": "An R=T theorem for certain orthogonal Shimura varieties", "comment": "38 pages, comments welcome!", "summary": "We prove an almost minimal R=T theorem for self-dual Galois representations with coefficients in a finite field satisfying a property called rigid. We also prove the rigidity property for a large family of residual Galois representations attached to regular algebraic self-dual representations. Our theorem is based on a Taylor--Wiles patching argument for G-valued Galois representation, where G equals GO(2m) or GSp(2m)."}
{"id": "2602.04875", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.04875", "abs": "https://arxiv.org/abs/2602.04875", "authors": ["Fredy Yip"], "title": "Multivariate and quantitative Erdős-Kac laws for Beatty sequences", "comment": "36 pages", "summary": "The classical Erdős-Kac theorem states that for $n$ chosen uniformly at random from $1, \\dots, N$, the random variable $(ω(n) - \\log\\log N)/\\sqrt{\\log\\log N}$ converges in distribution to the standard Gaussian as $N$ tends to infinity. Banks and Shparlinski showed that this Gaussian convergence holds for any Beatty sequence $\\lfloorαn + β\\rfloor$ in place of $n$. Continuing in this spirit, Crnčević, Hernández, Rizk, Sereesuchart and Tao considered the joint distribution of $ω(n)$ and $ω(\\lfloorαn\\rfloor)$, which they showed to be asymptotically independent for irrational values of $α$.\n  Generalising both results, we show that for any positive integer $k$, real numbers $α_1, \\dots, α_k > 0$ and $β_1, \\dots, β_k$, where $α_i/α_j$ is irrational for $i\\neq j$, the joint distribution of $(ω(\\lfloorα_in + β_i\\rfloor) - \\log\\log N)/\\sqrt{\\log\\log N}$ converges to the $k$-dimensional standard Gaussian.\n  We next discuss quantitative bounds on the rate of convergence which do not depend on the values taken by the relevant parameters. Banks and Shparlinski remarked that such quantitative bounds may be given for a single Beatty sequence $\\lfloorαn + β\\rfloor$ under Diophantine type assumptions on $α$. We show that such assumptions are in fact unnecessary. Specifically, for any real numbers $α> 0, β$, we show that the Kolmogorov distance between the random variable $(ω(\\lfloorαn + β\\rfloor) - \\log\\log N)/\\sqrt{\\log\\log N}$ and the standard Gaussian is bounded above by $O(\\log\\log\\log N/\\sqrt{\\log\\log N})$ as $N$ tends to infinity.\n  On the other hand, we show that universal quantitative bounds of this kind do not exist for higher-degree generalised polynomials or for the joint convergence for multiple Beatty sequences."}
