{"id": "2601.14504", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.14504", "abs": "https://arxiv.org/abs/2601.14504", "authors": ["Francesc Castella", "Takamichi Sano"], "title": "On refined nonvanishing conjectures by Kurihara and Kolyvagin", "comment": "18 pages, comments very welcome!", "summary": "In this paper, we extend the results of \\cite{BCGS} on refined conjectures by Kurihara and Kolyvagin, allowing primes of any reduction type in the case of Kurihara's conjectures, and inert primes in the underlying imaginary quadratic field in the case of Kolyvagin's. The key innovation is a new approach to the computation of the $p$-divisibility index of certain special elements in Galois cohomology (the bottom class of a $Λ$-adic Euler system twisted by a character sufficiently close to the trivial character) based on a reformulation of the Iwasawa Main Conjectures in terms of determinants of Selmer complexes."}
{"id": "2601.14521", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.14521", "abs": "https://arxiv.org/abs/2601.14521", "authors": ["Jean-Christophe Pain"], "title": "Generalized relations between arithmetic functions", "comment": null, "summary": "The aim of this article is to present in a self-contained way identities arising in elementary number theory, among which the following one: $$ \\sum_{d\\mid n}\\frac{μ^2(d)}{\\varphi(d)\\,d^s}=\\prod_{p\\mid n}\\left(1+\\frac{1}{(p-1)p^s}\\right). $$ This formula expresses a non-trivial divisor sum involving the Möbius function $μ$ and Euler's totient function $\\varphi$ as a simple and explicit multiplicative expression. This is a generalization of the remarkable Dineva formula, which corresponds to $s=0$ and gives $n/\\varphi(n)$ on the right-hand side. We explain why only squarefree divisors are involved, show how multiplicativity naturally comes into play, and interpret the identity as a finite Euler product. Beyond this one-parameter family of generalizations, we describe a general method for constructing similar formulas and present several examples. Finally, we reformulate these identities in terms of partial zeta functions, thus emphasizing their close relationship with the classical theory of Euler products and the Riemann zeta function. The connection with the Selberg sieve is briefly outlined."}
{"id": "2601.14668", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.14668", "abs": "https://arxiv.org/abs/2601.14668", "authors": ["Mahiro Atsuta"], "title": "On zeta elements and functional equations for Tate motives over totally real fields", "comment": "36 pages", "summary": "In this paper, we study Iwasawa theory for Tate motives over totally real fields. More precisely, we construct a zeta element that interpolates the values of $L$-functions at positive integers over totally real fields under a certain unramified condition at $p$. As an application of this, we construct a canonical element in the exterior power bidual of the Galois cohomology group that is also related to the values of $L$-functions at positive integers."}
{"id": "2601.14856", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.14856", "abs": "https://arxiv.org/abs/2601.14856", "authors": ["Pascal Autissier"], "title": "Effective normal basis theorem", "comment": "in French language", "summary": "Let K be a finite Galois extension of Q. The normal basis theorem provides an element of K whose conjugates form a Q-basis of K. Here we obtain such an element with controlled size. This improves a recent result by Fukshansky and Jeong. By the way, we estimate Minkowski's minima of ideals of integers of number fields."}
{"id": "2601.14396", "categories": ["math.RT", "math.RA", "math.SG"], "pdf": "https://arxiv.org/pdf/2601.14396", "abs": "https://arxiv.org/abs/2601.14396", "authors": ["Sibylle Schroll"], "title": "On geometric models in representation theory", "comment": "Proceedings of the ICM 2026, more references in the arXiv version", "summary": "Geometric models have emerged as an important tool in the representation theory of algebras. Surface models associated to gentle algebras have been particularly fruitful in advancing our understanding of their module and derived categories. We give an overview of some of the theoretical advances that geometric surface models for the derived categories of graded gentle algebras and their connections to Fukaya categories of surfaces have made possible."}
{"id": "2601.15089", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.15089", "abs": "https://arxiv.org/abs/2601.15089", "authors": ["Zhuchao Ji", "Jiarui Song", "Junyi Xie"], "title": "A geometric approach to the uniform boundedness of $\\ell$-primary torsion points", "comment": "45 pages", "summary": "We prove that for a non-isotrivial abelian scheme over a smooth curve, the genus of a generic sequence of multi-sections with small heights tends to infinity.\n  As an application, we give a new proof of the uniform boundedness of $\\ell$-primary torsion points on fibers of an abelian scheme over a smooth curve, a result originally proved by Cadoret and Tamagawa. Furthermore, our approach allows us to resolve a conjecture of Cadoret and Tamagawa without additional assumptions.\n  Our approach is based on the theory of Betti foliations and the arithmetic equidistribution theorem."}
{"id": "2601.14419", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2601.14419", "abs": "https://arxiv.org/abs/2601.14419", "authors": ["Egor Voronetsky"], "title": "Weyl elements in isotropic reductive groups", "comment": "Preliminary version", "summary": "We study Weyl elements in isotropic reductive groups over commutative rings. Our main result in an explicit formula for squares of such elements."}
{"id": "2601.15229", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.15229", "abs": "https://arxiv.org/abs/2601.15229", "authors": ["Franz Lemmermeyer"], "title": "Vieta jumping and small norms in quadratic number fields", "comment": null, "summary": "In this article we explain the connection between the famous problemfrom the IMO 1988 and elements of small norms in quadratic number fields with parametrized units."}
{"id": "2601.14832", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.14832", "abs": "https://arxiv.org/abs/2601.14832", "authors": ["Zhibin Geng", "Hang Xue"], "title": "Casselman-Wallach property for homological theta lifting", "comment": null, "summary": "In this paper, we establish the Casselman-Wallach property for homological theta lifting over archimedean local fields. As a consequence, the Euler-Poincaré characteristic is a well-defined element in the Grothendieck group of Casselman-Wallach representations. Our main tool is a corank-one parabolic stable filtration on the Weil representation."}
{"id": "2601.15268", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.15268", "abs": "https://arxiv.org/abs/2601.15268", "authors": ["Jesse Jääsaari"], "title": "On the Real Zeroes of Half-integral Weight Hecke Cusp Forms, II", "comment": "39 pages", "summary": "We show that for $\\gg K^2$ of the half-integral weight Hecke cusp forms in the Kohnen plus subspace with weight bounded by a large parameter $K$, the number of \"real\" zeroes grows at the expected rate. A key technical step in the proof is to obtain sharp bounds for the mollified first and second moments of quadratic twists of modular $L$-functions."}
{"id": "2601.14843", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.14843", "abs": "https://arxiv.org/abs/2601.14843", "authors": ["Endre Sørmo Rundsveen"], "title": "A note on the $m$-extended module categories of Nakayama algebras", "comment": null, "summary": "We study the extended module category $m\\operatorname{-mod}Λ$ of an algebra $Λ$, recently introduced by Gupta and Zhou. The existence of a postprojective component of $m\\operatorname{-mod}Λ$ is shown for certain algebras $Λ$, and a knitting algorithm through cohomological dimension vectors is provided.\n  In particular, the extended module category of Nakayama algebras with homogeneous relations are investigated, and it is classified when they are of finite type. The paper give fully calculated AR-quivers for several Nakayama algebras."}
{"id": "2601.15271", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.15271", "abs": "https://arxiv.org/abs/2601.15271", "authors": ["Robert Wilms"], "title": "On the Faltings height of the curve $y^2=x^n-1$", "comment": "20 pages, 1 figure. Comments are welcome!", "summary": "We compute the stable Faltings height of the hyperelliptic curve $X_n\\colon y^2=x^{n}-1$ for every odd integer $n\\ge 3$ in terms of special values of Euler's gamma function. In particular, we prove the bounds $$-0.975n< h_{\\mathrm{Fal}}(X_n)-\\tfrac{n}{8}\\log n<\\tfrac{9}{64}n\\log\\log n-0.263n.$$ As an application, we bound the Faltings height of any abelian variety with complex multiplication by the canonical CM-type of the $n$-th cyclotomic field by $\\frac{n}{8}\\log n+\\frac{9}{64}n\\log\\log n-0.136n$."}
{"id": "2601.14879", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.14879", "abs": "https://arxiv.org/abs/2601.14879", "authors": ["Ivan Penkov", "Pablo Zadunaisky"], "title": "The Pieri Rule at Infinity", "comment": null, "summary": "We study the structure of tensor products of $\\mathfrak{gl}(\\infty) = \\varinjlim \\mathfrak{gl}(n)$-modules $\\mathbf L(\\mathbf λ) \\otimes \\mathbf F$ where $\\mathbf L(\\mathbf λ)$ is a simple integrable highest weight module and $\\mathbf F$ is a simple integrable weight multiplicity-free module. Both $\\mathbf L(\\mathbf λ)$ and $\\mathbf F$ are infinite dimensional, in particular $\\mathbf F$ can be a Fock module. Similar tensor products of $\\mathfrak{gl}(n)$-modules are semisimple and their simple constituents are described by the classical Pieri rule. We prove that a $\\mathfrak{gl}(\\infty)$-module $\\mathbf M:= \\mathbf L(\\mathbf λ) \\otimes \\mathbf F$ is semisimple only in relatively trivial cases, and is indecomposable otherwise. Our main results are a description of the simple constituents of $\\mathbf M$, and the construction of a linkage filtration on $\\mathbf M$ that provides information on when two simple constituents of $\\mathbf M$ are linked. Using the linkage filtration, we compute the socle and radical filtrations of $\\mathbf M$, and determine when $\\mathbf M$ is rigid."}
