{"id": "2601.12021", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.12021", "abs": "https://arxiv.org/abs/2601.12021", "authors": ["Yikun Fan"], "title": "On Multilinear Forms for Mod $p$ Representations of $\\mathrm{GL}_2(\\mathbb{Q}_p)$", "comment": null, "summary": "Motivated by the study of trilinear forms for complex representations, we investigate the space of $G$-invariant linear forms on tensor products of irreducible admissible representations of $G = \\mathrm{GL}_2(\\mathbb{Q}_p)$ over $\\overline{\\mathbb{F}}_p$. Our main result is a complete vanishing theorem: for any $n \\ge 1$ and $n$ infinite-dimensional irreducible admissible representations $π_1,\\dots,π_n$ of $G$, \\[ \\operatorname{Hom}_G(π_1 \\otimes \\cdots \\otimes π_n, \\mathbb{1}) = 0. \\] A refined version holds for $B^+ := \\begin{pmatrix} p^{\\mathbb{Z}} & \\mathbb{Q}_p \\\\ 0 & 1 \\end{pmatrix}$-invariant forms when at least one $π_i$ is supersingular. The proof proceeds by a detailed analysis of certain subgroups, reducing the problem from $G$ to $B^+$ and ultimately to the representation theory of $\\mathbb{Z}_p$. We also deduce partial extensions of the result to $\\mathrm{GL}_2(F)$ for finite extensions $F/\\mathbb{Q}_p$."}
{"id": "2601.12497", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.12497", "abs": "https://arxiv.org/abs/2601.12497", "authors": ["Johannes Droschl"], "title": "The $\\ell$-modular local theta correspondence in type II and partial permutations", "comment": null, "summary": "In this paper we compute the multiplicities appearing in the ${\\overline{\\mathbb{F}}_\\ell}$-modular theta correspondence in type II over a non-archimedean field $\\mathrm{F}$, where $\\ell$ is a prime not dividing the residue cardinality of $\\mathrm{F}$. Unlike for representations with complex coefficients, highly non-trivial multiplicities can emerge. We show that these multiplicities are precisely governed by the action of symmetric groups on the set of partial permutations, and the ${\\overline{\\mathbb{F}}_\\ell}$-representation of symmetric groups these give rise to. The problem is thus reduced to certain branching problems in the modular representation theory of symmetric groups. In particular, if $d$ is the order of the residue cardinality of $\\mathrm{F}$ in ${\\overline{\\mathbb{F}}_\\ell}$, and the rank of the involved general linear groups is bounded above by $ d\\ell$, the behavior of the theta correspondence can be predicted via explicit algorithms coming from Pieri's Formula."}
{"id": "2601.12702", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2601.12702", "abs": "https://arxiv.org/abs/2601.12702", "authors": ["Peiru Yang", "Yajun Ma", "Yu-Zhe Liu"], "title": "Igusa-Todorov properties of recollements of abelian categories", "comment": "All comments are welcome!", "summary": "In this paper, we investigate the behavior of Igusa-Todorov properties under recollements of abelian categories. In particular, we study how the Igusa-Todorov distances of the categories involved in a recollement are related. Applications are given to Artin algebras, especially to Morita context rings."}
{"id": "2601.13152", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.13152", "abs": "https://arxiv.org/abs/2601.13152", "authors": ["Bim Gustavsson"], "title": "Character degrees in $2$-blocks of $\\mathfrak{S}_n$ and $\\mathfrak{A}_n$", "comment": "11 pages, 3 figures", "summary": "Let $p$ be an odd prime. We show that for sufficiently large $n$, every $2$-block of $\\mathfrak{S}_n$ and $\\mathfrak{A}_n$ contains an ordinary irreducible character of degree divisible by $p$. For almost all $2$-blocks of $\\mathfrak{A}_n$, we classify whether it contains a rational valued ordinary irreducible character of degree divisible by $p$."}
{"id": "2601.11773", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.11773", "abs": "https://arxiv.org/abs/2601.11773", "authors": ["Elliot Benjamin", "Mohamed Mahmoud Chems-Eddin"], "title": "On the Narrow 2-Class Field Tower of Some Real Quadratic Number Fields: Lengths Heuristics Follow-Up", "comment": "28 pages", "summary": "In this article we continue the investigation of the length of the narrow $2$-class field tower of real quadratic number fields $\\mathrm{k}$ whose discriminants are not a sum of two squares and for which their $2$-class groups are elementary of order $4$. Letting $\\mathrm{G}$ equal the Galois group of the second Hilbert narrow $2$-class field over $\\mathrm{k}$, and $[\\mathrm{G}_i]$ denote the lower central series of $\\mathrm{G}$, we give heuristic evidence that the length of the narrow $2$-class field tower of $\\mathrm{k}$ is equal to $2$ when $\\mathrm{G}/\\mathrm{G}_3$ is of type $64.150$ (in the tables of Hall and Senior). We also give the formulation of the relevant unit groups of the narrow Hilbert $2$-class field for these fields."}
{"id": "2601.13625", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.13625", "abs": "https://arxiv.org/abs/2601.13625", "authors": ["Zhenghui Li", "Benchao Su", "Zhixiang Wu"], "title": "Locally analytic vectors in the completed cohomology of quaternionic Shimura curves", "comment": "53 pages, comments are welcome!", "summary": "We use the methods introduced by Lue Pan to study the locally analytic vectors of the completed cohomology of Shimura curves associated to an indefinite quaternion algebra $D$ which is ramified at a prime number $p$. Let $D_p^{\\times}$ be the group of units of $D$ at $p$. Using $p$-adic uniformization of the quaternionic Shimura curves, we compute the Hecke eigenspace of the completed cohomology with the Hecke eigenvalues associated to a classical automorphic form on another quaternion algebra $\\bar D$ (switching invariants of $D$ at $p,\\infty$). We present this locally analytic $D_p^\\times$-representation using the de Rham complex of the Lubin-Tate tower of dimension $1$. This is analogous to the Breuil-Strauch conjecture for the group $\\mathrm{GL}_2(\\mathbb{Q}_p)$. We show that the locally analytic $D_p^{\\times}$-representation does not detect the Hodge filtration of the local de Rham Galois representation at $p$ in the crystalline case, and also give applications for the locally analytic Jacquet--Langlands correspondence for $\\mathrm{GL}_2(\\mathbb{Q}_p)$ and $D_p^\\times$."}
{"id": "2601.11799", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.11799", "abs": "https://arxiv.org/abs/2601.11799", "authors": ["Frank Gilson"], "title": "Distance of Quadratic Algebraic Numbers from the Middle-Third Cantor Set", "comment": "15 pages", "summary": "We study the distance from quadratic irrational numbers to the middle-third Cantor set $C$. Mahler asked whether $C$ contains any irrational algebraic numbers; this remains open even for quadratic irrationals. Rather than assuming an answer to this problem, we obtain uniform lower bounds for the distance from a quadratic irrational $α$ to $C$ in terms of the height $H$ of the minimal polynomial of $α$.\n  We encode $α$ by its orbit under the map $x \\mapsto 3x \\bmod 1$ and define the exit time $\\operatorname{exit}(α)$ as the first iterate that enters the middle interval $[1/3,2/3]$. Our main unconditional result is a quadratic exit bound $\\operatorname{exit}(α) \\le A (\\log_3 H)^2 + B$ for absolute constants $A,B > 0$, valid for all quadratic irrationals whose orbit stays a fixed small distance away from the coarse Cantor boundaries. As a consequence we obtain a distance lower bound $\\operatorname{dist}(α,C) \\ge H^{-κ\\log H}$ for some constant $κ> 0$.\n  On the dynamical side we classify orbits by an $L/M/R$ coding and prove that the total number of visits to the right interval $[2/3,1)$ is $O(\\log H)$. A finite case analysis on a bounded portion of the orbit is reduced to checking a finite list of explicit affine inequalities on subintervals of $[0,1]$, which we verify with short computer scripts; all Diophantine and dynamical estimates are proved by hand."}
{"id": "2601.11961", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.11961", "abs": "https://arxiv.org/abs/2601.11961", "authors": ["Pierre L. L. Morain"], "title": "Computations of higher elliptic units", "comment": "20 pages. Submitted. This paper presents a simplified version of a conjecture presented in the series of papers \"Geometric families of multiple elliptic Gamma functions and applications\" which supersedes the working paper arXiv:2406.06094 (see arXiv:2510.16515 for the first paper in this series). In this paper, we focus on optimal examples in the conjecture and how we find them algorithmically", "summary": "In this paper we present a conjecture on the construction of generalised elliptic units above number fields with exactly one complex place. These elliptic units obtained as values of multiple elliptic Gamma functions. These form a collection of multivariate meromorphic functions which were studied in the late 1990s and early 2000s in mathematical physics. Our construction extends the scheme of a recent article by Bergeron, Charollois and García where they constructed conjectural elliptic units above complex cubic fields using the elliptic Gamma function. The elliptic units we construct are expected to generate specific abelian extensions of the base field where they are evaluated, thus giving a conjectural solution to Hilbert's 12th problem for the number fields with exactly one complex place. We provide several examples to support our conjecture in optimal cases for cubic, quartic and quintic fields."}
{"id": "2601.12121", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.12121", "abs": "https://arxiv.org/abs/2601.12121", "authors": ["Prasuna Bandi", "Reynold Fregoli"], "title": "On the Hausdorff Dimension of weighted exactly Approximable Vectors", "comment": null, "summary": "We show that the Hausdorff dimension of $\\boldsymbol w$-weighted $τ$-exactly approximable vectors in $\\mathbb R^d$ coincides with the Hausdorff dimension of $\\boldsymbol w$-weighted $τ$-approximable vectors, generalizing a result of the first named author and De Saxcé."}
{"id": "2601.12157", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.12157", "abs": "https://arxiv.org/abs/2601.12157", "authors": ["Paolo Bordignon"], "title": "A $p$-adic cohomological approach to congruences of meromorphic modular forms", "comment": null, "summary": "We study congruences relating Fourier coefficients of meromorphic modular forms and Frobenius eigenvalues of elliptic curves corresponding to their poles. We develop a $p$-adic cohomological framework that interprets these congruences via the interaction between the rigid cohomology of modular curves and the crystalline structure of the associated elliptic curves. Using comparison theorems and the Gysin sequence, we relate the Frobenius actions in cohomology to the $U_p$-operator acting on spaces of overconvergent modular forms. Our approach applies uniformly to both modular curves and Shimura curves admitting smooth integral models over $\\mathbb{Z}_p$."}
{"id": "2601.12495", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.12495", "abs": "https://arxiv.org/abs/2601.12495", "authors": ["Jorge Zuniga"], "title": "Fast Computing Formulas for some Dirichlet L-Series", "comment": "16 pages, 2 Tables, 1 Appendix and 16 y$-$cruncher's custom configuration files contained as a large comment toward the end of main TeX file that shall be downloaded", "summary": "For $χ_k$ a self$-$dual primitive Dirichlet character mod $k$ several reduced identities of Dirichlet $L-$functions $L_k(s):=L(s,χ_k)$, expressed as linear combinations of Hurwitz $ζ$ functions, are found for $s=2,3$ and some selected values of $k$. By using a merged approach between the Wilf$-$Zeilberger method and a Dougall$'$s $_5H_5$ technique, new proven accelerated series of hypergeometric$-$type are derived for specific Hurwitz $ζ$ function values. These fast series that are computed by means of the binary splitting algorithm, enter into the reduced identities found producing very efficient formulas to compute these selected $L-$functions. The new algorithms include $ζ(3):=L_1(3)$, (Apery$'$s constant), $G:=L_\\text{-4}(2)$ (Catalan$'$s constant) as well as $\\text{}L_\\text{k}(2)\\text{}$ for $k=-7, -8, -15, -20, -24$ together with $L_k(3)$ for $k=5, 8, 12$. Formulas were tested and verified up to 100 million decimal places for each $L-$value."}
{"id": "2601.12565", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.12565", "abs": "https://arxiv.org/abs/2601.12565", "authors": ["Manuel Hoff", "Eike Lau"], "title": "Sheared displays and $p$-divisible groups", "comment": "42 pages", "summary": "We develop a Dieudonné theory for $p$-divisible groups using sheared Witt vectors."}
{"id": "2601.12601", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.12601", "abs": "https://arxiv.org/abs/2601.12601", "authors": ["Metin Can Aydemir", "Muhammet Boran"], "title": "Improved Averaged Distribution of $d_3(n)$ in Prime Arithmetic Progressions", "comment": "16 pages", "summary": "We say that $d_3(n)$ has exponent of distribution $θ$ if, for all $\\varepsilon>0$, the expected asymptotic holds uniformly for all moduli $q \\le x^{θ-\\varepsilon}$. Nguyen proved that, after averaging over reduced residue classes $a \\bmod q$, the function $d_3(n)$ has exponent of distribution $2/3$, following earlier work of Banks et al. Using the Petrow--Young subconvexity bound for Dirichlet $L$-functions, we improve this to an exponent of distribution $8/11$ when averaging over residue classes modulo a prime $q$."}
{"id": "2601.12643", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.12643", "abs": "https://arxiv.org/abs/2601.12643", "authors": ["Boris M. Bekker", "Yuri G. Zarhin"], "title": "Torsion points of small order on cyclic covers of $\\mathbb{P}^1$. III", "comment": "24 pages", "summary": "Let $d>1$ be an integer and $K_0$ a perfect field such that $char(K_0)$ does not divide $d$. Let $n>d$ be an integer that is prime to $d$. Let $f(x)\\in K_0[x]$ be a degree $n$ monic polynomial without repeated roots, and $\\mathcal{C}_{f,d}$ a smooth projective model of the affine curve $y^d=f(x)$. Let $J(\\mathcal{C}_{f,d})$ be the Jacobian of the $K_0$-curve $\\mathcal{C}_{f,d} $. As usual, we identify $\\mathcal{C}_{f,d}$ with its canonical image in $J(\\mathcal{C}_{f,d})$ (such that the only ``infinite point'' of $\\mathcal{C}_{f,d}$ goes to the zero of the group law on $J(\\mathcal{C}_{f,d})$).\n  We say that an integer $m>1$ is $(n,d)$-reachable over $K_0$ if there exists a polynomial $f(x)$ as above such that $\\mathcal{C}_{f,d}(K_0)$ contains a torsion point of order $m$.\n  Let us put $\\ell_0:=[(n+d)/d], \\ m_0:=\\ell_0 d$. Earlier we proved that if $m$ is $(n,d)$-reachable, then either $m=d$ or $m = n$ or $m \\ge m_0$ (in addition, both $d$ and $n$ are $(n,d)$-reachable over every $K_0$). We also proved that if $m_0$ is $(n,d)$-reachable over some $K_0$ then $n-m_0+\\ell_0\\ge 0$.\n  In the present paper we discuss the $(n,d)$-reachability of $m_0$ when $n-m_0+\\ell_0=0$ or $1$."}
{"id": "2601.12737", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.12737", "abs": "https://arxiv.org/abs/2601.12737", "authors": ["Yuto Nakajima", "Hiroki Takahasi", "Baowei Wang"], "title": "Hausdorff dimension of sets of numbers whose continued fractions contain arbitrarily long arithmetic progressions", "comment": "20 pages", "summary": "Continued fractions with prescribed structures on sequences of their partial quotients have been intensively studied in the literature. As far as an integer sequence, especially a randomly generated one is concerned, an attractive question is whether it contains arbitrarily long arithmetic progressions. In this paper we study the fractal structure of irrational numbers whose sequences of partial quotients are strictly increasing and contain arbitrarily long, quantified arithmetic progressions."}
{"id": "2601.12753", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.12753", "abs": "https://arxiv.org/abs/2601.12753", "authors": ["Ruofan Li", "Jiuzhou Zhao"], "title": "Non-Wieferich property of prime ideals and a conjecture of Erdös", "comment": null, "summary": "Let $K$ be a number field with ring of integers $\\mathcal{O}$ and $α\\in\\mathcal{O}$. For any prime ideal $\\mathfrak{p}$ of $\\mathcal{O}$, we obtain its higher $α$-Wieferich property, which implies a nonexistence theorem for higher Wieferich unramified prime ideals. If $β\\in\\mathcal{O}$ is relatively prime to $α$ and all prime ideal factors of $(β)$ are unramified and have residue degree $1$, we apply our higher $α$-Wieferich property to establish the asymptotic equidistribution of digits in $β$-adic expansions of $α^n$, which is a generalization of the Dupuy-Weirich theorem. When $(β)$ have ramified prime ideal factors, we also obtain a result on the block complexity of $β$-adic expansions of $α^n$."}
{"id": "2601.12772", "categories": ["math.NT", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.12772", "abs": "https://arxiv.org/abs/2601.12772", "authors": ["Madhav Dhiman", "Rohan Pandey"], "title": "2-Adic Obstructions to Presburger-Definable Characterizations of Collatz Cycles", "comment": "14 pages", "summary": "I investigate structural limitations of Presburger-arithmetic-based approaches to the Collatz problem. I show that the Collatz cycle equation admits a unique solution in the $2$-adic integers, which I term a \\emph{ghost cycle}. These ghost cycles are shown to be genuine periodic orbits of the $2$-adic Collatz map, satisfying all local parity constraints.\n  I prove unconditionally that the divisibility predicate $\\mathcal{D}_y = \\{(x, C) \\in \\mathbb{N}^2: (2^x - 3^y) \\mid C\\}$, which acts as the algebraic necessary condition for integrality, is not semilinear for any fixed number of odd steps $y \\ge 1$. This result is established by demonstrating that the fibers of $\\mathcal{D}_y$ exhibit unbounded periods, an obstruction to Presburger definability. Consequently, strategies relying solely on Presburger arithmetic or finite automata to define the integrality constraint cannot capture the distinction between ghost cycles and genuine integer cycles. I conclude with a heuristic argument suggesting that because ghost cycles satisfy the algebraic cycle equation, the non-existence of integer cycles cannot be proven solely through algebraic manipulation of the cycle equation itself."}
{"id": "2601.12794", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.12794", "abs": "https://arxiv.org/abs/2601.12794", "authors": ["Dae San Kim", "Taekyun Kim"], "title": "Probabilistic degenerate logarithm and heterogeneous stirling numbers", "comment": "20 pages", "summary": "Let Y be a random variable whose moment-generating function exists in some neighborhood of the origin. While probabilistic Stirling numbers of the first and second kind have been introduced, early definitions often failed to satisfy fundamental orthogonality and inverse relations or lacked consistency with classical forms in the case when Y = 1. This paper addresses these limitations by utilizing redefined probabilistic Stirling numbers of the first kind and the second kind alongside their degenerate counterparts. Our primary objective is twofold: first,to introduce the probabilistic (degenerate) logarithm associated with Y, providing explicit\n  expressions for various random variables and defining new probabilistic degenerate Daehee and Cauchy numbers; and second, to investigate probabilistic heterogeneous Stirling numbers and establish a probabilistic degenerate version of the Schlomilch formula, demonstrating that these new frameworks maintain the essential algebraic properties of their classical counterparts."}
{"id": "2601.12860", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.12860", "abs": "https://arxiv.org/abs/2601.12860", "authors": ["Youngmin Lee", "Subong Lim", "Wissam Raji"], "title": "Rankin-Cohen Bracket for Vector-Valued Modular Forms", "comment": "18 pages", "summary": "In this paper, we explore the relationship between Rankin-Cohen brackets for vector-valued modular forms and Petersson's inner products, deriving an explicit description of the adjoint map for the bracket operator. The study extends to the cases of Jacobi forms and skew-holomorphic Jacobi forms, establishing connections between their respective Rankin-Cohen brackets and those defined for vector-valued modular forms through an isomorphism. Adjoint maps for these extended bracket operators are also examined."}
{"id": "2601.12968", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.12968", "abs": "https://arxiv.org/abs/2601.12968", "authors": ["Alina Ostafe", "Igor E. Shparlinski"], "title": "Counting Irreducible polynomials with coefficients from thin subgroups", "comment": null, "summary": "L. Bary-Soroker and R. Shmueli (2026) have given an asymptotic formula for the number of irreducible polynomials over the finite fields $\\mathbb F_q$ of $q$ elements, such that their coefficients are perfect squares in $\\mathbb F_q$ and also extended this to classes of polynomials with coefficients described by finitely many unions of intersections of polynomial images. Here we use a different approach, which allows us to obtain another generalisation of this result to polynomials with coefficients from small subgroups of $\\mathbb F_q^*$. As a demonstration of the power of our approach, we also use it to count such irreducible polynomials with an additional condition, namely, with a prescribed value of their discriminant. This generalisation seems to be unachievable via the approach of L. Bary-Soroker and R. Shmueli (2026)."}
{"id": "2601.13034", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.13034", "abs": "https://arxiv.org/abs/2601.13034", "authors": ["Pierre-Yves Bienvenu", "Arne Winterhof"], "title": "On the additive index of the Diffie-Hellman mapping and the discrete logarithm", "comment": null, "summary": "Several complexity measures such as degree, sparsity and multiplicative index for cryptographic functions including the Diffie-Hellman mapping and the discrete logarithm in a finite field have been studied in the literature. In 2022, Reis and Wang introduced another complexity measure, the additive index, of a self-mapping of a finite field. In this paper, under certain conditions, we determine lower bounds on the additive index of the univariate Diffie-Hellman mapping and a self-mapping of $\\mathbb{F}_q$ which can be identified with the discrete logarithm in a finite field."}
{"id": "2601.13184", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.13184", "abs": "https://arxiv.org/abs/2601.13184", "authors": ["Arix Eggink"], "title": "Calculating The Local Ideal Class Monoid and Gekeler Ratios", "comment": "19 pages, 0 figures", "summary": "Let $A = \\mathbb{F}_q[T]$, $\\mathfrak{p} \\subset A$ prime, $f(x) \\in A[x]$ irreducible and set $R = A[x]/f(x)$. Denote its completion by $R_\\mathfrak{p}$. The ideal class monoid $\\text{ICM}(R_\\mathfrak{p})$ is the set of fractional $R_\\mathfrak{p}$ ideals modulo the principal $R_\\mathfrak{p}$ ideals. We provide an algorithm to compute $\\text{ICM}(R_\\mathfrak{p})$. In the process we also get algorithms to compute the overorders and weak equivalence classes of $R_\\mathfrak{p}$. We then use the algorithms to compute the product of local Gekeler ratios $\\prod_{\\mathfrak{p} \\subset A} v_\\mathfrak{p}(f) = \\prod_{\\mathfrak{p} \\subset A} \\lim_{n \\rightarrow \\infty} \\frac{|\\{M \\in \\text{Mat}_r(A/\\mathfrak{p}^n)\\mid \\text{charpoly}(M)=f\\}}{|\\text{SL}_r(A/\\mathfrak{p}^n)|/|\\mathfrak{p}|^{n(r-1)}}$. This provides part of an algorithm to compute the weighted size of an isogeny class of Drinfeld modules."}
{"id": "2601.13296", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.13296", "abs": "https://arxiv.org/abs/2601.13296", "authors": ["Andreas Rusu", "Gabriela Ileana Sebe", "Dan Lascu"], "title": "Limit Theorems for $θ$-expansions and the Failure of the Strong Law", "comment": "17 pages", "summary": "The paper presents fundamental metrical theorems for a class of continued fraction-like expansions known as $θ$-expansions. We first prove Khinchine's Weak Law of Large Numbers for the sum of digits, followed by the Diamond-Vaaler Strong Law for the sum of digits minus the largest one. Our main result is a general theorem on the failure of the strong law, showing that no regular norming sequence can yield a finite, non-zero almost sure limit. This result extends a classical theorem of Philipp to the $θ$-expansion setting. The proofs leverage the system's explicit invariant measure and a detailed analysis of its mixing properties."}
{"id": "2601.13625", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.13625", "abs": "https://arxiv.org/abs/2601.13625", "authors": ["Zhenghui Li", "Benchao Su", "Zhixiang Wu"], "title": "Locally analytic vectors in the completed cohomology of quaternionic Shimura curves", "comment": "53 pages, comments are welcome!", "summary": "We use the methods introduced by Lue Pan to study the locally analytic vectors of the completed cohomology of Shimura curves associated to an indefinite quaternion algebra $D$ which is ramified at a prime number $p$. Let $D_p^{\\times}$ be the group of units of $D$ at $p$. Using $p$-adic uniformization of the quaternionic Shimura curves, we compute the Hecke eigenspace of the completed cohomology with the Hecke eigenvalues associated to a classical automorphic form on another quaternion algebra $\\bar D$ (switching invariants of $D$ at $p,\\infty$). We present this locally analytic $D_p^\\times$-representation using the de Rham complex of the Lubin-Tate tower of dimension $1$. This is analogous to the Breuil-Strauch conjecture for the group $\\mathrm{GL}_2(\\mathbb{Q}_p)$. We show that the locally analytic $D_p^{\\times}$-representation does not detect the Hodge filtration of the local de Rham Galois representation at $p$ in the crystalline case, and also give applications for the locally analytic Jacquet--Langlands correspondence for $\\mathrm{GL}_2(\\mathbb{Q}_p)$ and $D_p^\\times$."}
{"id": "2601.13626", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.13626", "abs": "https://arxiv.org/abs/2601.13626", "authors": ["Takashi Hara", "Kenji Sakugawa", "Koji Tasaka"], "title": "Symmetric multiple Eisenstein series", "comment": "43 pages", "summary": "In this paper, we introduce the symmetric multiple Eisenstein series, a variant of the multiple Eisenstein series. As a fundamental result, we show that they satisfy the linear shuffle relation. As a case study, we investigate the vector space spanned by symmetric double Eisenstein series of weight $k$. When $k$ is even, it coincides with the space spanned by modular forms of weight $k$ and the derivative of the Eisenstein series of weight $k-2$. For $k$ odd, we prove that its dimension equals $\\lfloor k/3\\rfloor$. We further provide an explicit correspondence between the linear shuffle relation and the Fay-shuffle relation satisfied by elliptic double zeta values, which may be of independent interest. In connection with modular forms, we prove that every modular form can be expressed as a linear combination of symmetric triple Eisenstein series. This will serve as a first step toward understanding modular phenomena for symmeric multiple zeta values observed by Kaneko and Zagier."}
{"id": "2601.13726", "categories": ["math.NT", "math.DS", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.13726", "abs": "https://arxiv.org/abs/2601.13726", "authors": ["Michael Björklund", "Reynold Fregoli", "Alexander Gorodnik"], "title": "Central Limit Theorems in Multiplicative Diophantine Approximation", "comment": "42 pages, comments are welcome!", "summary": "We investigate the number of integer solutions to a multiplicative Diophantine approximation problem and show that the associated counting function converges in distribution to a normal law. Our approach relies on the analysis of correlations of measures on homogeneous spaces, together with estimates for Siegel transforms restricted to subspaces."}
{"id": "2601.13855", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.13855", "abs": "https://arxiv.org/abs/2601.13855", "authors": ["Jan Moser"], "title": "Jacob's ladders, point of contact of the remained in the prime-number law with the Fermat-Wiles theorem and multiplicative puzzles on some sets of integrals", "comment": null, "summary": "In this paper we prove, on the Riemann hypothesis, the existence of such increments of the Ingham integral (1932) that generate new functionals together with corresponding new $Pζ$-equivalents of the Fermat-Wiles theorem. We obtain also new results in this direction."}
{"id": "2601.14006", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2601.14006", "abs": "https://arxiv.org/abs/2601.14006", "authors": ["Jeremy Booher"], "title": "Computing Crystalline Cohomology and p-Divisible Groups for Curves over Finite Fields", "comment": "20 pages, implementation at https://github.com/jeremybooher/crystallinecohomology", "summary": "Let $X$ be a smooth projective curve over a finite field of characteristic $p$. We describe and implement a practical algorithm for computing the $p$-divisible group $Jac(X)[p^\\infty]$ via computing its Dieudonné module, or equivalently computing the Frobenius and Verschiebung operators on the first crystalline cohomology of $X$. We build on Tuitman's $p$-adic point counting algorithm, which computes the rigid cohomology of $X$ and requires a ``nice'' lift of $X$ to be provided."}
{"id": "2601.14057", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.14057", "abs": "https://arxiv.org/abs/2601.14057", "authors": ["Sándor Z. Kiss", "Csaba Sándor", "Maciej Zakarczemny"], "title": "On the Diophantine Equation Involving Elementary Symmetric Polynomials and the Decomposition of Unity", "comment": null, "summary": "We consider the equality of the values of the $n$th and $k$th elementary symmetric polynomials of $n$ not necessarily distinct positive integers. For $k < n$, we prove that this equation always has a solution, but only finitely many solutions. Furthermore, we consider the equality of the values of the $n$th and $(n-2)$th elementary symmetric polynomials of $n$ not necessarily distinct positive integers. In particular, we show that the number of solutions of this equation tends to infinity if $n$ tends to infinity."}
{"id": "2601.14122", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.14122", "abs": "https://arxiv.org/abs/2601.14122", "authors": ["Krishnendu Paul", "Shameek Paul"], "title": "$Q_p$-weighted zero-sum constants", "comment": "14 pages", "summary": "A sequence $S=(x_1,\\ldots, x_k)$ in $\\mathbb Z_p$ is called a $(Q_p,\\mathbf 1)$-weighted zero-sum sequence if there exist $a_1,\\ldots,a_k\\in Q_p$ such that $a_1x_1+\\cdots+a_kx_k=0$ and $a_1+\\cdots+a_k=0$. The constant $E_{Q_p,\\mathbf 1}$ is defined to be the smallest positive integer $k$ such that every sequence of length $k$ in $\\mathbb Z_p$ has a $(Q_p,\\mathbf 1)$-weighted zero-sum subsequence of length $p$. We determine the constant $E_{Q_p,\\mathbf 1}$ and the related constants $C_{Q_p,\\mathbf 1}$ and $D_{Q_p,\\mathbf 1}$. We also study some $(Q_p,B)$-weighted zero-sum constants where $B$ is a subset of $Q_p$."}
