{"id": "2601.03414", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.03414", "abs": "https://arxiv.org/abs/2601.03414", "authors": ["Dan Levy"], "title": "On the sizes of the maximal prime powers divisors of factorials", "comment": null, "summary": "Let p be any prime, and $p^(ν_p(n!))$ the maximal power of $p$ dividing $n!$. It is proved that there exists a positive integer $n_0$, which depends only on $p$, such that $q^(ν_q(n!)) < p^(ν_p(n!))$ for all $n \\ge n_0$ and all primes $q > p$. For twin primes $p$ and $q = p + 2$ it is proved that the minimal $n_0$ satisfying $q^(ν_q(n!)) < p^(ν_p(n!))$ for all $n \\ge n_0$ is given by $n_0 = (p^2+p)/2$."}
{"id": "2601.03548", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.03548", "abs": "https://arxiv.org/abs/2601.03548", "authors": ["Jiyou Li", "Zhiyao Zhang"], "title": "Improving bounds for value sets of polynomials over finite fields", "comment": "16 pages, 1 figure", "summary": "Let $\\mathbb{F}_{q}$ be a finite field of characteristic $p$, and let $f \\in \\mathbb{F}_{q}[x]$ be a polynomial of degree $d > 0$.\n  Denote the image set of this polynomial as $V_{f}=\\{f(α)\\midα\\in\\mathbb{F}_{q}\\}$ and denote the cardinality of this set as $N_{f}$. A much sharper bound for $N_{f}$ is established in this paper. In particular, for any $p\\neq 2, 3$, and for nearly every generic quartic polynomial $f \\in \\mathbb{F}_{q}[x]$, we obtain $$\\lvert N_f - \\frac{5}{8} q \\rvert \\leq \\frac{1}{2}\\sqrt{q} + \\frac{3}{4},$$ which holds as a simple corollary of the main result."}
{"id": "2601.03560", "categories": ["math.NT", "math.RA"], "pdf": "https://arxiv.org/pdf/2601.03560", "abs": "https://arxiv.org/abs/2601.03560", "authors": ["Hua-Lin Huang", "Yilun Tang", "Yu Ye", "Rongmin Zhu"], "title": "The Waring Problem of Harmonic Polynomials", "comment": null, "summary": "This paper investigates the Waring problem of harmonic polynomials. By characterizing the annihilating ideal of a homogeneous harmonic polynomial, i.e., a real binary form that is in the kernel of the Laplacian, we show that its Waring rank equals its degree. Moreover, we show that any linear form can appear in a minimal Waring decomposition of a homogeneous harmonic polynomial, implying that the forbidden locus is empty. We also provide an explicit algorithm for computing the minimal Waring decompositions."}
{"id": "2601.03653", "categories": ["math.NT", "cs.IT", "math.CO"], "pdf": "https://arxiv.org/pdf/2601.03653", "abs": "https://arxiv.org/abs/2601.03653", "authors": ["Giacomo Micheli", "Mihran Papikian"], "title": "Rank metric codes from Drinfeld modules", "comment": "18 pages", "summary": "We establish a connection between Drinfeld modules and rank metric codes, focusing on the case of semifield codes. Our framework constructs rank metric codes from linear subspaces of endomorphisms of a Drinfeld module, using tools such as characteristic polynomials on Tate modules and the Chebotarev density theorem. We show that Sheekey's construction [She20] fits naturally into this setting, yielding a short conceptual proof of one of his main results. We then give a new construction of infinite families of semifield codes arising from Drinfeld modules defined over finite fields."}
{"id": "2601.03910", "categories": ["math.RT", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.03910", "abs": "https://arxiv.org/abs/2601.03910", "authors": ["Francesco Conti", "Patrizio Frosini", "Nicola Quercioli"], "title": "An Algebraic Representation Theorem for Linear GENEOs in Geometric Machine Learning", "comment": null, "summary": "Geometric and Topological Deep Learning are rapidly growing research areas that enhance machine learning through the use of geometric and topological structures. Within this framework, Group Equivariant Non-Expansive Operators (GENEOs) have emerged as a powerful class of operators for encoding symmetries and designing efficient, interpretable neural architectures. Originally introduced in Topological Data Analysis, GENEOs have since found applications in Deep Learning as tools for constructing equivariant models with reduced parameter complexity. GENEOs provide a unifying framework bridging Geometric and Topological Deep Learning and include the operator computing persistence diagrams as a special case. Their theoretical foundations rely on group actions, equivariance, and compactness properties of operator spaces, grounding them in algebra and geometry while enabling both mathematical rigor and practical relevance. While a previous representation theorem characterized linear GENEOs acting on data of the same type, many real-world applications require operators between heterogeneous data spaces. In this work, we address this limitation by introducing a new representation theorem for linear GENEOs acting between different perception pairs, based on generalized T-permutant measures. Under mild assumptions on the data domains and group actions, our result provides a complete characterization of such operators. We also prove the compactness and convexity of the space of linear GENEOs. We further demonstrate the practical impact of this theory by applying the proposed framework to improve the performance of autoencoders, highlighting the relevance of GENEOs in modern machine learning applications."}
{"id": "2601.03797", "categories": ["math.NT", "math.CO", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.03797", "abs": "https://arxiv.org/abs/2601.03797", "authors": ["Sayan Goswami"], "title": "On difference sets of dense subsets of $\\mathbb{Z}^2$", "comment": "Comments are welcome", "summary": "In this article, we study the structure of the difference set $E - E$ for subsets $E \\subseteq \\mathbb{Z}^2$ of positive upper Banach density. In [Proc. Amer. Math. Soc. 146 (2018), 3449-3453, Problem 2] Fish asked whether, for every such set $E$, there exists a nonzero integer $k$ such that \\[ k \\cdot \\mathbb{Z} \\subseteq \\{\\, xy : (x,y) \\in E - E \\,\\}. \\] Although this question remains open, we establish a relatively weaker form of this conjecture. Specifically, we prove that there exist infinitely many integers $k \\in \\mathbb{Z}$ and a sequence $\\langle x_n \\rangle_{n \\in \\mathbb{N}}$ in $\\mathbb{Z}$ such that \\[ k \\cdot FS(\\langle x_n \\rangle_{n \\in \\mathbb{N}}) \\subseteq \\{\\, xy : (x,y) \\in E - E \\,\\}, \\] where $FS(\\langle x_n \\rangle)$ denotes the finite sums set generated by the sequence."}
{"id": "2601.04008", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.04008", "abs": "https://arxiv.org/abs/2601.04008", "authors": ["Rose Berry"], "title": "Affine Hecke and Schur algebras of type A without a square root of q", "comment": null, "summary": "We provide an affine cellular structure on the extended affine Hecke algebra and affine $q$-Schur algebra of type $A_{n-1}$ that is defined over $\\mathbb{Z}\\left[q^{\\pm1}\\right]$, that is, without an adjoined $q^{\\frac{1}{2}}$. This is with an eye to applications in the representation theory of $\\mathrm{GL}_n(F)$ for a $p$-adic field $F$ over coefficient rings in which $p$ is invertible but does not have a square root, which have been a topic of recent interest. This is achieved via a renormalisation of the known affine cellular structure over $\\mathbb{Z}\\left[q^{\\pm\\frac{1}{2}}\\right]$ at each left and right cell, which is chosen to ensure that the diagonal intersections remain subalgebras and that the left and right cells remain isomorphic. We furthermore show that the affine cellular structure on the Schur algebra has idempotence properties which imply finite global dimension, an important ingredient for the applications to representations of $p$-adic groups."}
{"id": "2601.03871", "categories": ["math.NT", "math.AG", "math.QA"], "pdf": "https://arxiv.org/pdf/2601.03871", "abs": "https://arxiv.org/abs/2601.03871", "authors": ["Zhao Yu Ma"], "title": "Weight filtration of Hurwitz spaces and quantum shuffle algebras", "comment": "45 pages, 6 figures", "summary": "We prove an equivalence between filtrations of primitive bialgebras and filtrations of factorizable perverse sheaves, generalizing the results obtained by Kapranov-Schechtman. Under this equivalence, we find that the word length filtration of quantum shuffle algebras as defined in Ellenberg-Tran-Westerland corresponds to the codimension filtration of factorizable perverse sheaves. Furthermore, we find that the geometric weight filtration of factorizable perverse sheaves corresponds to a filtration on quantum shuffle algebras which has not been previously defined in the literature, and we call this the algebraic weight filtration. To apply this to Hurwitz spaces, we prove a comparison theorem between the weight filtrations for Hurwitz spaces over $\\mathbb F_p$ and $\\mathbb C$, generalizing the comparison theorem of Ellenberg-Venkatesh-Westerland. This allows us to determine the cohomological weights for Hurwitz spaces explicitly using the algebraic weight filtration of the corresponding quantum shuffle algebra. As a consequence, we find that most weights of Hurwitz spaces are smaller than expected from cohomological degree, and we prove explicit nontrivial upper bounds for weights in some cases, such as when $G=S_3$ and $c$ is the conjugacy class of transpositions."}
{"id": "2601.04012", "categories": ["math.RT", "math-ph", "math.CO", "math.QA"], "pdf": "https://arxiv.org/pdf/2601.04012", "abs": "https://arxiv.org/abs/2601.04012", "authors": ["Chris Bowman", "Zajj Daugherty", "Maud De Visscher", "Rob Muth", "Loic Poulain D'andecy"], "title": "The orientifold Temperley--Lieb algebra", "comment": null, "summary": "We construct gradings on the simple modules of 2-boundary Temperley--Lieb algebras and symplectic blob algebras by realising the latter algebras as quotients of Varagnolo--Vasserot's orientifold quiver Hecke algebras. We prove that the symplectic blob algebras are graded cellular and provide a conjectural algorithm for calculating their graded decomposition matrices. In doing so, we give the first explicit family of finite-dimensional graded quotients of the orientifold quiver Hecke algebras, providing a new entry point for the structure of these algebras -- in the spirit of Libedinsky--Plaza's ``blob algebra approach'' to modular representation theory."}
{"id": "2601.03949", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.03949", "abs": "https://arxiv.org/abs/2601.03949", "authors": ["Mykola Pratsiovytyi", "Oleh Vynnyshyn"], "title": "Sets of distinct representations of numbers in numeral systems with a natural base and a redundant alphabet", "comment": null, "summary": "In this work, we study a numeral system with a natural base $s \\geq 2$ and a redundant alphabet $A_r=\\{0,1, \\dots, r\\}$, where $s \\leq r \\leq 2s-2$. We investigate the topological, metric, and fractal properties of the set of numbers in the interval $\\left[0,\\frac{r}{s-1}\\right]$ that admit a unique representation $x=\\sum\\limits_{n=1}^{\\infty}\\frac{α_n} {s^n}\\equivΔ^{r_s}_{α_1α_2...α_n...}$, $α_n\\in A_r$. The criterion for the uniqueness of the number representation is established. It is proved that the Hausdorff--Besicovitch dimension of the set of numbers with a unique representation is equal to $\\frac{\\ln(2s-r-1)}{\\ln s}$. An analysis of the quantity of representations of numbers having purely periodic representations with a simple period (a single-digit period) is carried out. It is proved that the set of numbers that admit a continuum of distinct representations has full Lebesgue measure. Conditions for a number to belong to this set are given in terms of one of its representations."}
{"id": "2601.03984", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.03984", "abs": "https://arxiv.org/abs/2601.03984", "authors": ["Vitezslav Kala", "Om Prakash"], "title": "There are consecutive cubic fields with large class numbers, when ordered by discriminant", "comment": "10 pages, comments are welcome!", "summary": "We consider cubic number fields ordered by their discriminants, and show that there exist arbitrarily long sequences that contain only fields with class numbers greater than a given bound."}
{"id": "2601.03998", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.03998", "abs": "https://arxiv.org/abs/2601.03998", "authors": ["Koustav Banerjee", "Kathrin Bringmann", "Atul Dixit"], "title": "Restricted overpartitions and concave compositions: their modularity and asymptotics", "comment": null, "summary": "In this paper we study restricted overpartitions and concave compositions. Using q-series transformations, we show that their generating functions are related to modular forms, mock theta functions, false theta functions, and mock Maass theta functions. Moreover, we obtain their asymptotic main terms. We also study related rank statistics."}
{"id": "2601.04014", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.04014", "abs": "https://arxiv.org/abs/2601.04014", "authors": ["Koustav Banerjee", "Kathrin Bringmann", "William J. Keith"], "title": "On a conjecture of Andrews and Bachraoui", "comment": null, "summary": "Recently, Andrews and Bachraoui considered a generating function $F_{k,m}(q)$ associated with certain two-color partitions, and conjectured that this function has non-negative coefficients for $m=1$. They showed this property for $1 \\leq k \\leq 4$. In this note, we prove that $F_{k,1}(q)$ has non-negative coefficients for $5 \\leq k \\leq 10$. Moreover, we show that, as $k\\to\\infty$, $F_{k,1}(q)$ is related to Ramanujan's third order mock theta function $ω(q)$ and to quotients of certain $q$-binomial coefficients."}
{"id": "2601.04189", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.04189", "abs": "https://arxiv.org/abs/2601.04189", "authors": ["Jesse Thorner", "Shifan Zhao"], "title": "Landau-Siegel zeros of Rankin-Selberg $L$-functions", "comment": "25 pages", "summary": "We establish standard zero-free regions with no exceptional Landau-Siegel zeros for Rankin-Selberg $L$-functions and triple product $L$-functions in several new families for which modularity is not yet known."}
