{"id": "2602.20188", "categories": ["math.NT", "hep-th", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.20188", "abs": "https://arxiv.org/abs/2602.20188", "authors": ["Neil Dummigan"], "title": "Modularity of a certain \"rank-2 attractor\" Calabi-Yau threefold", "comment": "29 pages", "summary": "We prove that the 4-dimensional Galois representations associated with a certain Calabi-Yau threefold are reducible, with 2-dimensional composition factors coming from specific modular forms of weights 2 and 4, both level 14. This was essentially conjectured by Meyer and Verrill. It was revisited in its present form by Candelas, de la Ossa, Elmi and van Straten, whose computations of Euler factors in a whole pencil of Calabi-Yau threefolds highlighted this fibre as one of three overwhelmingly likely to be ``rank-2 attractors''."}
{"id": "2602.20190", "categories": ["math.NT", "math.MG"], "pdf": "https://arxiv.org/pdf/2602.20190", "abs": "https://arxiv.org/abs/2602.20190", "authors": ["Takashi Hirotsu"], "title": "Algebraic Characterization of Angle Multisections over Rings", "comment": "7 pages, 1 figure", "summary": "Let $m,$ $n \\geq 2$ be integers, and let $R$ be a subring of $\\mathbb R$ with field of fractions $F.$ In this article, we generalize the rational angle bisection problem previously proposed by the author as follows: characterize the pairs of linearly independent vectors $\\vec{a},$ $\\vec{b} \\in R^n$ that form angles with sequences of $m$-sector vectors lying in $R^n.$ When $\\vec{a}$ and $\\vec{b}$ are nonorthogonal, we prove that this condition is equivalent to the existence of a root in $F$ of a certain $m$-th degree polynomial over $R.$ In particular, when $R = \\mathbb Z,$ the condition holds if and only if the polynomial has a root among the divisors of its constant term. When $m = 2^e$ with integer $e \\geq 1,$ we also prove that the condition is equivalent to $\\cos (θ/2^{e-1}) \\in F,$ where $θ$ is the angle between $\\vec{a}$ and $\\vec{b}.$"}
{"id": "2602.20387", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.20387", "abs": "https://arxiv.org/abs/2602.20387", "authors": ["Herbert Batte"], "title": "On Wagstaff primes in the $k$-Lucas number sequence", "comment": "9 pages. arXiv admin note: text overlap with arXiv:2602.17903", "summary": "A Wagstaff prime is a prime number of the form $(2^{\\mathfrak{p}}+1)/3$, where $\\mathfrak{p}$ is an odd prime. Let $(L_n^{(k)})_{n\\geq 2-k}$ be the $k$-Lucas number sequence defined by the recurrence relation\n  $ L_n^{(k)} = L_{n-1}^{(k)} + \\cdots + L_{n-k}^{(k)}$, for all $n \\ge 2$, with initial terms \\( L_0^{(k)} = 2 \\) and \\( L_1^{(k)} = 1 \\) for all \\( k \\ge 2 \\), and \\( L_{2-k}^{(k)} = \\cdots = L_{-1}^{(k)} = 0 \\) for \\( k \\ge 3 \\). In this paper, we show that the only solutions to the Diophantine equation $L_n^{(k)} = (2^{\\mathfrak{p}}+1)/3$ are $(n,k,\\mathfrak{p})\\in\\{(5,2,5),(6,4,7)\\}\\cup \\{(2,k,3):k\\ge 2\\}$. We use linear forms in logarithms and the LLL reduction method to prove our result."}
{"id": "2602.20481", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.20481", "abs": "https://arxiv.org/abs/2602.20481", "authors": ["Fei Xu", "Bo Zhang"], "title": "Single conjugacy classes of isometries in orthogonal groups over local fields", "comment": null, "summary": "All isometries $σ$ in a quadratic space over a non-archimedean local field of characteristic not 2 satisfying that any isometry $τ$ which is conjugate to $σ$ in the general linear group is conjugate to $σ$ in the orthogonal group are determined. This extends \\cite[Theorem 2.1]{Mil} to arbitary cases."}
{"id": "2602.20817", "categories": ["math.RT", "math.NT", "math.QA"], "pdf": "https://arxiv.org/pdf/2602.20817", "abs": "https://arxiv.org/abs/2602.20817", "authors": ["Valentin Buciumas", "Chun-Ju Lai"], "title": "Quantum wreath products and $p$-adic general linear group", "comment": "28 pages. Comments welcome", "summary": "We study the pro-$p$ Iwahori-Hecke algebra and its Gelfand-Graev modules for the $p$-adic general linear group and its metaplectic covers. We develop the theory of quantum wreath products of skew polynomial type and use it to provide transparent descriptions of these Hecke algebras and their modules that were previously inaccessible through standard $p$-adic methods. We introduce the notion of (anti)spherical and Kashiwara-Miwa-Stern modules for these quantum wreath products for the first time and interpret the $p$-adic Gelfand-Graev modules in terms of these new modules. As an application, we study the structure theory for the corresponding $p$-adic pro-$p$ Schur algebras and obtain an explicit basis and multiplication rules. Moreover, we give algebraic (re)proofs of several results of $p$-adic interest including the existence of PBW basis for the pro-$p$ metaplectic and Iwahori-Hecke algebras, identification of the Iwahori-Schur algebra with the quantum affine Schur algebra, and failure of the local Shimura correspondence at the pro-$p$ level."}
{"id": "2602.20649", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.20649", "abs": "https://arxiv.org/abs/2602.20649", "authors": ["Arnaud Bodin", "Christian Drouin"], "title": "Solutions of polynomial equations in several variables modulo a prime power", "comment": "31 pages, appendix with an explicit example", "summary": "We explain how to obtain the set of solutions of a multivariate polynomial equation modulo a power of a prime number. These solutions are determined by a tree, called the trunk, which makes it possible to reconstruct all solutions. We apply these methods to determine the number of solutions, without having to enumerate them. We also illustrate these techniques by proving a simple case of Igusa's theorem: the Poincaré series associated with a polynomial in two separated variables is rational."}
{"id": "2602.20861", "categories": ["math.RT", "math-ph", "math.CO", "math.QA"], "pdf": "https://arxiv.org/pdf/2602.20861", "abs": "https://arxiv.org/abs/2602.20861", "authors": ["Jeremie Guilhot", "Loic Poulain d'Andecy"], "title": "Kazhdan-Lusztig bases of parabolic Hecke algebras and applications to Schur-Weyl duality", "comment": null, "summary": "With an eye to applications to type A and Schur-Weyl duality, we study Kazhdan-Lusztig bases for a general parabolic Hecke algebra. Parabolic Hecke algebras are idempotent subalgebras of Hecke algebras corresponding to parabolic subgroups, and for type A they coincide with the fused Hecke algebras appearing in a generalisation of the Schur-Weyl duality with the quantum group of GL(N). In this paper we investigate two different Kazhdan-Lusztig bases for parabolic Hecke algebras, together with the associated cells and the corresponding representations. We quickly specialise to type A, for which we describe the cells in terms of the RSK correspondence generalising thus the well-known description for the symmetric group. As a first application we recover the classification of irreducible representations of parabolic Hecke algebras of type A and provide a new construction of these representations. Next we turn to the Schur-Weyl duality and describe the kernel in terms of one the basis studied precedently. Moreover, we formulate some conjectures about a generator of these kernels in terms of Kazhdan-Lusztig basis elements, give some evidence and prove these conjectures in some special cases."}
{"id": "2602.20737", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.20737", "abs": "https://arxiv.org/abs/2602.20737", "authors": ["Shaunak V. Deo", "Bharathwaj Palvannan"], "title": "On local characterizations of Hida families of Siegel modular forms", "comment": "73 pages, comments are welcome!", "summary": "We provide new local characterizations of Hida families of Siegel modular forms with genus two arising from automorphic inductions (stable Yoshida lifts), analogous to the characterizations of Hida families of CM modular forms provided by Ghate--Vatsal. Our characterizations involve (i) density of de Rham at $p$ specializations at the singular weights $(k,2)$ and (ii) local decomposability at $p$ of the associated $Λ$-adic Galois representation. Our approach is similar to that of Castella--Wang-Erickson who provided an alternate strategy to reproving the main results of Ghate--Vatsal by applying Ribet's method when an anti-cyclotomic class group is assumed to be pseudo-null and cyclic as a $Λ$-module. Along these lines, one key input to our methods involves an assumption of pseudo-nullity of Selmer groups that are defined by imposing stricter conditions at $p$ than those imposed for the usual Greenberg Selmer groups appearing in the Asai main conjectures over real quadratic fields. Following Genestier--Tilouine and Pilloni, we also prove a minimal $R=\\mathbb{T}$ theorem that is essential to establishing our results at various stages."}
{"id": "2602.20801", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.20801", "abs": "https://arxiv.org/abs/2602.20801", "authors": ["S. I. Dimitrov"], "title": "A Diophantine inequality with five squares of Piatetski-Shapiro primes", "comment": null, "summary": "Let $[\\,\\cdot\\,]$ denote the floor function. Assume that $λ_1, λ_2, λ_3, λ_4, λ_5$ are nonzero real numbers, not all of the same sign, that $λ_1/λ_2$ is irrational, and that $η$ is a real number. Let $\\frac{71}{72}<γ<1$ and $θ>0$. We prove that there exist infinitely many quintuples of primes $p_1,\\, p_2,\\, p_3,\\, p_4,\\, p_5$ satisfying the Diophantine inequality \\begin{equation*} \\big|λ_1p^2_1 + λ_2p^2_2 + λ_3p^2_3+ λ_4p^2_4 + λ_5p^2_5+η\\big|<\\big(\\max p_j\\big)^{\\frac{71-72γ}{29}+θ}\\,, \\end{equation*} where $p_i=[n_i^{1/γ}]$, $i=1,\\,2,\\,3,\\,4,\\,5$. We also prove analogous theorems by raising the last variable in the inequality to the third and fourth powers."}
{"id": "2602.20817", "categories": ["math.RT", "math.NT", "math.QA"], "pdf": "https://arxiv.org/pdf/2602.20817", "abs": "https://arxiv.org/abs/2602.20817", "authors": ["Valentin Buciumas", "Chun-Ju Lai"], "title": "Quantum wreath products and $p$-adic general linear group", "comment": "28 pages. Comments welcome", "summary": "We study the pro-$p$ Iwahori-Hecke algebra and its Gelfand-Graev modules for the $p$-adic general linear group and its metaplectic covers. We develop the theory of quantum wreath products of skew polynomial type and use it to provide transparent descriptions of these Hecke algebras and their modules that were previously inaccessible through standard $p$-adic methods. We introduce the notion of (anti)spherical and Kashiwara-Miwa-Stern modules for these quantum wreath products for the first time and interpret the $p$-adic Gelfand-Graev modules in terms of these new modules. As an application, we study the structure theory for the corresponding $p$-adic pro-$p$ Schur algebras and obtain an explicit basis and multiplication rules. Moreover, we give algebraic (re)proofs of several results of $p$-adic interest including the existence of PBW basis for the pro-$p$ metaplectic and Iwahori-Hecke algebras, identification of the Iwahori-Schur algebra with the quantum affine Schur algebra, and failure of the local Shimura correspondence at the pro-$p$ level."}
