{"id": "2602.15905", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.15905", "abs": "https://arxiv.org/abs/2602.15905", "authors": ["Andrew MacArevey"], "title": "On the Lagarias Inequality and Superabundant Numbers", "comment": "7 pages", "summary": "We study the Lagarias inequality, an elementary criterion equivalent to the Riemann Hypothesis. Using a continuous extension of the harmonic numbers, we show that the sequence $B_n=\\frac{H_n+e^{H_n}\\log(H_n)}{n}$ is strictly increasing for $n\\ge 1$. As a consequence, if the Lagarias inequality has counterexamples, then the least counterexample must be a superabundant number; equivalently, it suffices to verify the inequality on the superabundant numbers."}
{"id": "2602.15941", "categories": ["math.NT", "math.AG", "math.QA"], "pdf": "https://arxiv.org/pdf/2602.15941", "abs": "https://arxiv.org/abs/2602.15941", "authors": ["Alain Connes", "Caterina Consani"], "title": "On the Jacobian of $\\overline{{{\\rm Spec}\\,\\mathbb Z}}$", "comment": "48 pages", "summary": "We interpret the structure of the adele class space of the rationals--and specifically its Riemann sector--as the natural monoidal extension of the Picard group of the arithmetic curve $\\overline{\\operatorname{Spec} \\mathbb Z}$. We identify the elements of this space with torsion-free rank-1 abelian groups $L$ endowed with rigidifying data. In the Riemann sector, this data corresponds to a norm, extending the classical notion of metrized line bundles in Arakelov geometry. For the full adele class space, we replace the norm with a group morphism to $\\mathbb R$ and a combinatorial datum: a parametrization of the roots of unity associated with the character dual of $L$. We show that the product of adeles is represented geometrically by the tensor product of these rank-1 groups and their rigidifying structures. The resulting monoid space generalizes the Picard group to the full adelic context by incorporating the singular strata required for the spectral realization of $L$-functions."}
{"id": "2602.16027", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.16027", "abs": "https://arxiv.org/abs/2602.16027", "authors": ["Mihoub Bouderbala"], "title": "On the Mean Value of a Weighted Composite Arithmetic Function", "comment": "6 pages", "summary": "The primary objective of this paper is to employ methods from analytic number theory to investigate the mean value properties of a composite function involving the Dirichlet divisor function and a generalized minimal power function. Specifically, we study the weighted summatory function where the divisor function is normalized by the number of distinct prime factors. We establish a rigorous asymptotic formula for this sum, detailing the analytic properties of the associated Dirichlet series and the contour integration process."}
{"id": "2602.16096", "categories": ["math.NT", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.16096", "abs": "https://arxiv.org/abs/2602.16096", "authors": ["Laid Elkhiri", "Miloud Mihoubi", "Meriem Moulay"], "title": "Binomial sums and properties of the Bernoulli transform", "comment": "16 pages, 0 Figures", "summary": "In this paper, we study the binomial sum $S_{n}(q):=% \\overset{n}{\\underset{k=0}{\\sum }}a_{k}\\binom{n}{k}\\left( 1-q\\right) ^{k}q^{n-k}$ for a given sequence $\\left( a_{n}\\right) $ of real or complex numbers. We express $S_{n}(q)$ in function of the powers of $q,$ and, we explicit it when the sequence $\\left( a_{n}\\right) $ is the sequence of Fibonacci numbers, Laguerre Polynomials, Meixner Polynomials, binomial coefficients and the sequence $\\left[ n\\right] _{p}.$ We establish later some properties, relations, probabilistic interpretations and generating functions between $S_{n}(q)$ and $S_{n}(x+q-xq).$ Further identities related to Appell polynomials are also given in the last of the paper."}
{"id": "2602.15982", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.15982", "abs": "https://arxiv.org/abs/2602.15982", "authors": ["William M. McGovern"], "title": "$G_2$ representations and semistandard tableaux", "comment": "5 pages", "summary": "Continuing earlier work, we show how to realize irreducible finite-dimensional representations of the complex group of type $G_2$ via tableaux, along the way exhibiting explicit generators of the defining ideal of the flag variety"}
{"id": "2602.16159", "categories": ["math.NT", "math.GT"], "pdf": "https://arxiv.org/pdf/2602.16159", "abs": "https://arxiv.org/abs/2602.16159", "authors": ["Yuya Murakami"], "title": "Quantum modularity of signatures in TQFT and generalized Dedekind sums", "comment": "26 pages, 6 arfigures", "summary": "We prove the quantum modularity of the signature of $ \\mathrm{SU}(2) $-TQFT for a genus 2 surface, which was conjectured by Marché--Masbaum in 2025. Our approach is based on a quantum modularity of generalized Dedekind sums associated with general modular forms. In the case of Eisenstein series for $ Γ(N) $, these generalized Dedekind sums admit trigonometric sum expressions, which coincide with the formula for the $ \\mathrm{SU}(2) $-TQFT signature. Furthermore, we express both the $ \\mathrm{SU}(2) $-TQFT and generalized Dedekind sums as radial limits of Eichler integrals."}
{"id": "2602.16332", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.16332", "abs": "https://arxiv.org/abs/2602.16332", "authors": ["Andrew Hubery"], "title": "The invariance of the Auslander-Reiten Formula for hereditary algebras", "comment": null, "summary": "We show that the Auslander-Reiten Formula for a finite dimensional hereditary algebra is invariant under the Auslander-Reiten translate."}
{"id": "2602.16248", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.16248", "abs": "https://arxiv.org/abs/2602.16248", "authors": ["Jan Hendrik Bruinier", "Yingkun Li", "Martin Möller"], "title": "Intersections of special cycles on Shimura curves and Siegel Maass forms", "comment": null, "summary": "We show that the generating series of the number of pairs of geodesics on a compact Shimura curve with given discriminants and intersection angle are coefficients of a non-holomorphic Siegel modular form, a theta lift of the constant function. This retrieves and generalizes counting results of Rickards via the Siegel-Weil formula.\n  More generally, we study the genus two theta lift of Maass forms on this Shimura curve and prove a Fourier-Taylor expansion in terms of some generalized Whittaker functions. We also provide a geometric interpretation of all Fourier coefficients of these theta lifts in terms of averages of geodesic Taylor coefficients over special cycles."}
{"id": "2602.16389", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.16389", "abs": "https://arxiv.org/abs/2602.16389", "authors": ["Avraham Aizenbud", "Dmitry Gourevitch", "David Kazhdan", "Eitan Sayag", "Itay Glazer", "Yotam Hendel"], "title": "On Harish-Chandra's integrability theorem in positive characteristic", "comment": "Body of the paper by Avraham Aizenbud, Dmitry Gourevitch, David Kazhdan, and Eitan Sayag. Apendix A by Itay Glazer and Yotam Hendel. 60p", "summary": "The celebrated Harish-Chandra's integrability theorem states that the distributional character of an irreducible smooth representation of a p-adic group $G(F)$ is integrable, that is represented by an $L^1_{loc}(G(F))$ function. Here $F$ is a non-Archimedean local field of characteristic $0$ and $G$ is a reductive algebraic group defined over $F$. In this paper we focus on cuspidal representations of $GL_n(F)$ for a field $F$ of positive characteristic. We show that in this case the integrability holds under the hypothesis of existence of desingularization of (certain) algebraic varieties in positive characteristics.\n  Furthermore, in the case $char(F)>n/2$ we establish the regularity of such characters unconditionally."}
{"id": "2602.16258", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.16258", "abs": "https://arxiv.org/abs/2602.16258", "authors": ["Andreas Strömbergsson", "Shucheng Yu"], "title": "A zero-one law for improvements to Dirichlet's theorem in arbitrary dimension", "comment": "22 pages", "summary": "Let $ψ$ be a continuous decreasing function defined on all large positive real numbers. We say that a real $m\\times n$ matrix $A$ is $ψ$-Dirichlet if for every sufficiently large real number $t$ one can find $\\mathbf{p} \\in \\mathbb{Z}^m$, $\\mathbf{q} \\in \\mathbb{Z}^n\\setminus\\{\\mathbf{0}\\}$ satisfying $\\|A\\mathbf{q}-\\mathbf{p}\\|^m< ψ(t)$ and $\\|\\mathbf{q}\\|^n<t$. By removing a technical condition from a partial zero-one law proved by Kleinbock-Strömbergsson-Yu, we prove a zero-one law for the Lebesgue measure of the set of $ψ$-Dirichlet matrices provided that $ψ(t)<1/t$ and $tψ(t)$ is increasing. In fact, we prove the zero-one law in a more general situation with the monotonicity assumption on $tψ(t)$ replaced by a weaker condition. Our proof follows the dynamical approach of Kleinbock-Strömbergsson-Yu in reducing the question to a shrinking target problem in the space of lattices. The key new ingredient is a family of carefully chosen subsets of the shrinking targets studied by Kleinbock-Strömbergsson-Yu, together with a short-range mixing estimate for the associated hitting events. Our method also works for the analogous weighted problem where the relevant supremum norms are replaced by certain weighted quasi-norms."}
{"id": "2602.16393", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.16393", "abs": "https://arxiv.org/abs/2602.16393", "authors": ["Avraham Aizenbud", "Dmitry Gourevitch", "David Kazhdan", "Eitan Sayag"], "title": "Orbital integral bounds the character for cuspidal representations of $GL_n(\\mathbb{F}_{\\ell}((t)))$", "comment": "40p", "summary": "We prove that the character of an irreducible cuspidal representation of $GL_n(\\mathbb{F}_{\\ell}((t)))$ is locally bounded up to a logarithmic factor by the orbital integral of a matrix coefficient of this representation.\n  The characteristic $0$ analog of this result is part of the proof of the celebrated Harish-Chandra's integrability theorem.\n  In a sequel work [AGKS] we use this result in order to prove a positive characteristic analog of Harish-Chandra's integrability theorem under some additional assumptions."}
{"id": "2602.16452", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.16452", "abs": "https://arxiv.org/abs/2602.16452", "authors": ["Gebhard Böckle", "Chun-Yin Hui"], "title": "On coefficients, potentially abelian quotients, and residual irreducibility of compatible systems", "comment": null, "summary": "Let $\\{ρ_λ:G_K\\rightarrow GL_n(\\overline E_λ)\\}$ be a semisimple E-rational compatible system of a number field K. In a first step, building upon the theory of pseudocharacters [Ro96],[Ch14], we attach to each $ρ_λ$ an algebraic monodromy group $G_λ$ defined over $E_λ$ and also prove that the compatible system can be descended to a strongly E'-rational compatible system $\\{ρ_{λ'}: G_K\\rightarrow GL_n(E'_{λ'})\\}$ for some finite extension E'/E. Secondly, we demonstrate that the maximal potentially abelian quotient of $G_λ$ is independent of $λ$ in a strong sense. Finally, as an application, we generalize a result of Patrikis--Snowden--Wiles on residual irreducibility of compatible systems."}
{"id": "2602.16452", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.16452", "abs": "https://arxiv.org/abs/2602.16452", "authors": ["Gebhard Böckle", "Chun-Yin Hui"], "title": "On coefficients, potentially abelian quotients, and residual irreducibility of compatible systems", "comment": null, "summary": "Let $\\{ρ_λ:G_K\\rightarrow GL_n(\\overline E_λ)\\}$ be a semisimple E-rational compatible system of a number field K. In a first step, building upon the theory of pseudocharacters [Ro96],[Ch14], we attach to each $ρ_λ$ an algebraic monodromy group $G_λ$ defined over $E_λ$ and also prove that the compatible system can be descended to a strongly E'-rational compatible system $\\{ρ_{λ'}: G_K\\rightarrow GL_n(E'_{λ'})\\}$ for some finite extension E'/E. Secondly, we demonstrate that the maximal potentially abelian quotient of $G_λ$ is independent of $λ$ in a strong sense. Finally, as an application, we generalize a result of Patrikis--Snowden--Wiles on residual irreducibility of compatible systems."}
{"id": "2602.16482", "categories": ["math.NT", "math.CA", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.16482", "abs": "https://arxiv.org/abs/2602.16482", "authors": ["Thomas F. Bloom", "Ben Green"], "title": "Remarks on the inverse Littlewood conjecture", "comment": "12 pages", "summary": "The Littlewood conjecture, proven by Konyagin and McGehee-Pigno-Smith in the 1980s, states that if $A\\subset \\mathbb{Z}$ is a finite set of integers with $\\lvert A\\rvert=N$ then $\\| \\widehat{1_A}\\|_1\\geq c\\log N$ for some absolute constant $c > 0$. We explore what structure $A$ must have if $\\| \\widehat{1_A}\\|_1\\leq K\\log N$ for some constant $K$. Under such an assumption we prove, for instance, that $A$ contains a subset $A'\\subseteq A$ with $\\lvert A\\rvert \\geq N^{0.99}$ such that $\\lvert A'+A'\\rvert \\ll K^{O(1)}\\lvert A'\\rvert$. As a consequence, for any $k\\geq 3$, if $N$ is sufficiently large depending on $k$ and $K$, then $A$ must contain an arithmetic progression of length $k$. A byproduct of our analysis is a (slightly) improved bound for the constant $c$."}
