{"id": "2602.21417", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.21417", "abs": "https://arxiv.org/abs/2602.21417", "authors": ["Cristian Cobeli", "The Nguyen", "Alexandru Zaharescu"], "title": "A statistical model for points expanding in higher dimensions while being tied to bijective involutions", "comment": "20 pages", "summary": "Let $\\mathcal{M}$ be a set with $M$ elements, let $ψ:\\mathcal{M}\\to\\mathcal{M}$ be a bijective involution, and let~$\\boldsymbol{\\mathcal{X}}_ψ$ be the set of sequences $(x_1,\\dots,x_M)\\in\\mathcal{M}^M$ with the property that $x_{M+1-j} = ψ(x_j)$ for $1\\le j\\le M$. This framework can be used to infer the possible distribution of sequences, such as the modular ones, that pose challenges for conventional methods.\n  We prove that when $M$ is even, there exists a limit probability density function that weighs the parameter $k$ that counts the appearances of the elements of $\\mathcal{M}$ among the terms of sequences $\\textbf{x}\\in\\boldsymbol{\\mathcal{X}}_ψ$. It turns out that the number of fixed points of $ψ$ influences the probability density function, which decomposes into two pieces, each multiplied by complementary factors, and the smaller of the two pieces appears only when $k$ is even.\n  Applying the model, we find a threshold from which almost all sequences contain related terms with prescribed frequencies."}
{"id": "2602.21719", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.21719", "abs": "https://arxiv.org/abs/2602.21719", "authors": ["Jouni J. Takalo"], "title": "Prime-Weighted Interference Patterns Inspired by the Euler Product", "comment": "7 page, 2 figures", "summary": "We study a prime-weighted oscillatory model inspired by structural aspects of the Euler product of the Riemann zeta function. The model defines finite superpositions of prime-frequency modes and exhibits zero-like crossings produced by destructive interference. We analyze how the weight exponent $x$ controls amplitude growth, slope scaling, and stability of crossings. A heuristic asymptotic argument identifies $x=\\tfrac12$ as a distinguished balance regime separating high-energy and over-damped behavior. The results concern the defined model itself."}
{"id": "2602.21840", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2602.21840", "abs": "https://arxiv.org/abs/2602.21840", "authors": ["Alejandra Alcantarilla Sánchez", "Jolijn Cottaar", "Tanja Lange", "Benne de Weger"], "title": "Ours go to 211: Euler pseudoprimes to 47 prime bases (from Carmichael numbers)", "comment": "21 pages, 2 figures", "summary": "In this paper we show that a certain subset of the Carmichael numbers contains good Euler pseudoprimes, composite numbers that for many bases survive the Solovay-Strassen primality test. We present a classification of Carmichael numbers, and use the knowledge gained from this to create a fast algorithm to compute new Euler pseudoprimes, by multiplying already found Euler pseudoprimes. We use this algorithm to find many Euler pseudoprimes that are pseudoprimes for several consecutive prime bases starting at 2, hence for all integer bases up to that number. The best Euler pseudoprime we find survives up to 211, i.e., survives the first 47 prime bases."}
{"id": "2602.21861", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.21861", "abs": "https://arxiv.org/abs/2602.21861", "authors": ["Giorgio Navone", "Katerina Santicola", "Harry C. Shaw", "Haowen Zhang"], "title": "Quartic del Pezzo surfaces over $\\mathbb{F}_p(t)$ without quadratic points", "comment": "21 pages. Comments welcome!", "summary": "We construct an infinite family of quartic del Pezzo surfaces over $\\mathbb{F}_p(t)$ with no quadratic points, for all primes $p\\neq 2$. This answers a question of Colliot--Thélène, Creutz and Viray in the negative, which asks whether every quartic del Pezzo surface has quadratic points over $C_2$ fields. We exhibit a Brauer--Manin obstruction on the variety parametrising lines associated to the quartic del Pezzo surface."}
{"id": "2602.21805", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2602.21805", "abs": "https://arxiv.org/abs/2602.21805", "authors": ["Wen-Wei Li"], "title": "Harish-Chandra D-modules for bi-Whittaker reduction", "comment": "40 pages. Comments are welcome", "summary": "Let $D(G)$ be the algebra of algebraic differential operators on a complex reductive group $G$. Denote by $\\mathbb{W}$ the bi-Whittaker quantum Hamiltonian reduction of $D(G)$, also known as the quantum Toda lattice. In this article we define the admissible $\\mathbb{W}$-modules and the special case of Harish-Chandra modules, the latter being bi-Whittaker variants of the invariant holonomic systems of Hotta-Kashiwara. We then study their torsion properties up to completion relative to the Kazhdan filtration, which in general is unbounded in both directions, through the geometry of universal centralizer. In the case of regular infinitesimal characters, the corresponding $D(G)$-module is shown to be the minimal extension of an irregular connection on the open Bruhat cell. Certain ring-theoretic properties of the completion of $\\mathbb{W}$ are also obtained."}
{"id": "2602.21878", "categories": ["math.NT", "math.AG"], "pdf": "https://arxiv.org/pdf/2602.21878", "abs": "https://arxiv.org/abs/2602.21878", "authors": ["Beat Zurbuchen"], "title": "Equidistribution for Tannakian monodromy groups", "comment": null, "summary": "We prove that a perverse sheaf on a connected commutatitve algebraic group over a finite is generically unramified. This implies an equidistribution theorem for Tannakian monodromy groups in previously unavailable generality. We also prove a stratification theorem for exponential sums in families indexed by a scheme and the characters of a connected commutative algebraic group. Our method is based on Tannakian categories introduced by Gabber and Loeser. This method naturally yields fiber functors. We also prove vanishing theorems over a connected commutative algebraic group, classify the negligible sheaves, and prove relative weak propagation theorems for tori."}
{"id": "2602.21870", "categories": ["math.RT", "math.GR"], "pdf": "https://arxiv.org/pdf/2602.21870", "abs": "https://arxiv.org/abs/2602.21870", "authors": ["G. Lusztig"], "title": "Strata of Weyl groups", "comment": "14 pages", "summary": "A Weyl group W is a union of strata (certain subsets which are unions of conjugacy classes) which are the nonempty fibres of a map from W to the set of irreducible representations of W. We give an explicit description of strata in terms of a certain modified centralizer group. We also define superstrata of a connected reductive group and state a conjecture about them."}
{"id": "2602.21894", "categories": ["math.NT", "math.AG", "math.KT"], "pdf": "https://arxiv.org/pdf/2602.21894", "abs": "https://arxiv.org/abs/2602.21894", "authors": ["Tess Bouis", "Quentin Gazda"], "title": "The cyclosyntomic regulator of a number field", "comment": "29 pages", "summary": "We construct a q-deformation of the p-adic regulator of a number field, called the cyclosyntomic regulator, building on the Habiro ring of Garoufalidis-Scholze-Wheeler-Zagier. The key new ingredient in our construction is a refinement of Sulyma's norm maps in prismatic cohomology, which interpolate between classical powers and Frobenius maps at various prime numbers p. Furthermore, we compute the values of the cyclosyntomic regulator at units of the form $1-ζ$, where $ζ$ is a root of unity."}
{"id": "2602.22189", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.22189", "abs": "https://arxiv.org/abs/2602.22189", "authors": ["Ruishen Zhao"], "title": "Perfectoid unitary Shimura varieties and $p$-adic Eichler-Shimura map I", "comment": "Part I of a series. Comments are welcome!", "summary": "We investigate $p$-adic automorphic forms on unitary groups through the geometry of infinite-level unitary Shimura varieties and the Hodge-Tate period map. We first develop a perfectoid construction of overconvergent automorphic forms. Building on this, we establish a canonical overconvergent Eichler-Shimura map linking overconvergent cohomology to these $p$-adic automorphic forms. This map induces a comparison between the corresponding coherent sheaves on the eigenvariety, with applications to the study of its geometry and to $p$-adic $L$-functions."}
{"id": "2602.22189", "categories": ["math.NT", "math.AG", "math.RT"], "pdf": "https://arxiv.org/pdf/2602.22189", "abs": "https://arxiv.org/abs/2602.22189", "authors": ["Ruishen Zhao"], "title": "Perfectoid unitary Shimura varieties and $p$-adic Eichler-Shimura map I", "comment": "Part I of a series. Comments are welcome!", "summary": "We investigate $p$-adic automorphic forms on unitary groups through the geometry of infinite-level unitary Shimura varieties and the Hodge-Tate period map. We first develop a perfectoid construction of overconvergent automorphic forms. Building on this, we establish a canonical overconvergent Eichler-Shimura map linking overconvergent cohomology to these $p$-adic automorphic forms. This map induces a comparison between the corresponding coherent sheaves on the eigenvariety, with applications to the study of its geometry and to $p$-adic $L$-functions."}
