{"id": "2601.02542", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.02542", "abs": "https://arxiv.org/abs/2601.02542", "authors": ["Paul Boisseau"], "title": "The fine spectral expansion of the Rankin-Selberg period", "comment": null, "summary": "We state and prove the spectral expansion of the theta series attached to the Rankin-Selberg spherical variety $(\\mathrm{GL}_{n+1} \\times \\mathrm{GL}_n)/\\mathrm{GL}_n$. This is a key result towards the fine spectral expansion of the Jacquet-Rallis trace formula. Our expansion is written in terms of regularized Rankin--Selberg periods for non-tempered automorphic representations, which we show compute special values of $L$-functions. The proof relies on shifts of contours of integration à la Langlands. We also establish two technical but crucial results on bounds and singularities for discrete Eisenstein series of $\\mathrm{GL}_n$ in the positive Weyl chamber."}
{"id": "2601.02623", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.02623", "abs": "https://arxiv.org/abs/2601.02623", "authors": ["Qiyu Yang", "Shengbo Zhao"], "title": "Joint extreme values of the Riemann zeta function at harmonic points", "comment": null, "summary": "Using the resonance method, we obtain refined estimates for joint extreme values of the Riemann zeta function at harmonic points, improving upon Levinson's 1972 results and providing new insight into the behavior of the Riemann zeta function. Our proof is primarily based on Dirichlet series theory and the truncated Euler product for the Riemann zeta function. As a corollary, we can recover some previously known extreme value results for the zeta function."}
{"id": "2601.02664", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.02664", "abs": "https://arxiv.org/abs/2601.02664", "authors": ["Graeme Bates", "Ryan Jesubalan", "Seewoo Lee", "Jane Lu", "Hyewon Shim"], "title": "Powerful Fibonacci polynomials over finite fields", "comment": "14 pages, 5 tables", "summary": "Bugeaud, Mignotte, and Siksek proved that the only perfect powers in Fibonacci sequence are 0, 1, 8, and 144. In this paper, we study the polynomial analogue of the problem. Especially, we give a complete characterization of the Fibonacci polynomials that are perfect powers or powerful over finite fields, where there are infinitely many of them. We also give similar characterizations for some of Horadam's generalized Lucas polynomial sequences, which include Fibonacci, Lucas, Chebyshev, and Jacobsthal polynomials."}
{"id": "2601.02743", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.02743", "abs": "https://arxiv.org/abs/2601.02743", "authors": ["Chen Lin", "Kaihan Tang"], "title": "Counting Polynomial-type Exceptional Units on Algebraic Varieties over Number Fields", "comment": "12 pages", "summary": "Previous research on exceptional units has primarily focused on the ring of rational integers or abstract finite rings, often restricted to linear or quadratic constraints. In this paper, we extend the concept of polynomial-type exceptional units to the ring of integers of an arbitrary algebraic number field. We investigate the number of these polynomial-type exceptional units on general algebraic varieties. By employing the Chinese Remainder Theorem and Hensel's lifting technique, we derive an exact counting formula for the number of these exceptional units on a smooth closed subscheme under the assumption of good reduction. Furthermore, using the Lang-Weil inequality, we establish an asymptotic estimate for the counting function. In particular, we prove that for varieties of degree at most two, the error term can be significantly improved, yielding a sharper asymptotic bound."}
{"id": "2601.03049", "categories": ["math.RT"], "pdf": "https://arxiv.org/pdf/2601.03049", "abs": "https://arxiv.org/abs/2601.03049", "authors": ["Kazushi Maeda"], "title": "Classification of reductive homogeneous spaces satisfying strict inequality for Benoist-Kobayashi's $ρ$ functions", "comment": null, "summary": "Let $G$ be a real reductive Lie group and $H$ a reductive subgroup of $G$. Benoist-Kobayashi studied when $L^2(G/H)$ is a tempered representation of $G$. They introduced the functions $ρ$ on Lie algebras and gave a necessary and sufficient condition for the temperedness of $L^2(G/H)$ in terms of an inequality on $ρ$. In a joint work with Y. Oshima, we considered when $L^2(G/H)$ is equivalent to a unitary subrepresentation of $L^2(G)$ and gave a sufficient condition for this in terms of a strict inequality of $ρ$. In this paper, we will classify the pairs $(\\mathfrak{g}, \\mathfrak{h})$ with $\\mathfrak{g}$ complex reductive and $\\mathfrak{h}$ complex semisimple which satisfy that strict inequality of $ρ$."}
{"id": "2601.02781", "categories": ["math.NT", "math.PR"], "pdf": "https://arxiv.org/pdf/2601.02781", "abs": "https://arxiv.org/abs/2601.02781", "authors": ["Po-Han Hsu", "Peng-Jie Wong"], "title": "On rates of convergence in central limit theorems of Selberg and Bourgade", "comment": "49 pages; comments welcome", "summary": "Based on the recent works of Radziwill-Soundararajan and Roberts, we establish a rate of convergence in Bourgade's central limit theorem for shifted Dirichlet $L$-functions. Our results also indicate that the dependence structure in the components of a random vector could have a dramatic impact on the rate of convergence in such a multivariate central limit theorem."}
{"id": "2601.03128", "categories": ["math.RT", "math.CT"], "pdf": "https://arxiv.org/pdf/2601.03128", "abs": "https://arxiv.org/abs/2601.03128", "authors": ["Jing Yu"], "title": "On derived categories of module categories over multiring categories", "comment": "18 pages, comments welcome", "summary": "Let $\\mathcal{A}$ and $\\mathcal{B}$ be subcategories of tensor categories $\\mathcal{C}$ and $\\mathcal{D}$, respectively, both of which are abelian categories with finitely many isomorphism classes of simple objects. We prove that if their derived categories $\\mathbf{D}^b(\\mathcal{A})$ and $\\mathbf{D}^b(\\mathcal{B})$ are left triangulated tensor ideals and are equivalent as triangulated $\\mathbf{D}^b(\\mathcal{C})$-module categories via an equivalence induced by a monoidal triangulated functor $F:\\mathbf{D}^b(\\mathcal{C})\\rightarrow \\mathbf{D}^b(\\mathcal{D})$, then the original module categories $\\mathcal{A}$ and $\\mathcal{B}$ are themselves equivalent. We then apply this result to smash product algebras. Furthermore, the localization theory of module categories and triangulated module categories is investigated."}
{"id": "2601.02919", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.02919", "abs": "https://arxiv.org/abs/2601.02919", "authors": ["Rajesh P. Singh", "Dinesh Kumar", "Jitendra Prakash"], "title": "The compositional inverses of some permutation polynomials of the form $x+γ\\operatorname{Tr}_q^{q^2}(h(x))$", "comment": null, "summary": "Recently, Jiang et al. \\cite{JIANG2025102522} obtained several classes of Permutation Polynomial of the form $x+γ\\operatorname{Tr}_q^{q^2}(h(x))$ over finite fields $\\mathbb{F}_{q^2},q=2^n$. In this paper, we find the compositional inverse of six classes of permutation polynomials of this form."}
{"id": "2601.02542", "categories": ["math.NT", "math.RT"], "pdf": "https://arxiv.org/pdf/2601.02542", "abs": "https://arxiv.org/abs/2601.02542", "authors": ["Paul Boisseau"], "title": "The fine spectral expansion of the Rankin-Selberg period", "comment": null, "summary": "We state and prove the spectral expansion of the theta series attached to the Rankin-Selberg spherical variety $(\\mathrm{GL}_{n+1} \\times \\mathrm{GL}_n)/\\mathrm{GL}_n$. This is a key result towards the fine spectral expansion of the Jacquet-Rallis trace formula. Our expansion is written in terms of regularized Rankin--Selberg periods for non-tempered automorphic representations, which we show compute special values of $L$-functions. The proof relies on shifts of contours of integration à la Langlands. We also establish two technical but crucial results on bounds and singularities for discrete Eisenstein series of $\\mathrm{GL}_n$ in the positive Weyl chamber."}
{"id": "2601.02921", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.02921", "abs": "https://arxiv.org/abs/2601.02921", "authors": ["Pawan Singh Mehta", "Biswajyoti Saha"], "title": "Ramaswami Type translation formulae for the polylogarithm functions", "comment": null, "summary": "In 1934, Ramaswami proved a number of curious translation formulae satisfied by the Riemann zeta function. Such translation formulae, in turn give the meromorphic extension of the Riemann zeta function. In 1954, Apostol extended those identities to establish a family of such similar translation formulae. In this article, we establish many such Ramaswami and Apostol type translation formulae for the Dirichlet series defining the polylogarithm functions. This extended set up has many interesting applications, for example, it allows us to also find some (seemingly new) recurrence relations between the Bernoulli numbers, and use them to deduce some congruence properties of the tangent numbers."}
{"id": "2601.03029", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.03029", "abs": "https://arxiv.org/abs/2601.03029", "authors": ["Jonas Bergström", "Sjoerd de Vries"], "title": "Periodicity of traces of Hecke operators modulo prime powers", "comment": "24 pages, comments welcome!", "summary": "We study traces of Hecke operators on spaces of elliptic cusp forms and Drinfeld cusp forms and show that, modulo any prime power, these traces are periodic in the weight."}
{"id": "2601.03209", "categories": ["math.NT", "math-ph", "math.DS"], "pdf": "https://arxiv.org/pdf/2601.03209", "abs": "https://arxiv.org/abs/2601.03209", "authors": ["Wooyeon Kim", "Jens Marklof", "Matthew Welsh"], "title": "Values of ternary quadratic forms at integers and the Berry-Tabor conjecture for 3-tori", "comment": "29 pages", "summary": "Berry and Tabor conjectured in 1977 that spectra of generic integrable quantum systems have the same local statistics as a Poisson point process. We verify their conjecture in the case of the two-point spectral density for a quantum particle in a three-dimensional box, subject to a Diophantine condition on the domain's proportions. A permissible choice of width, height and depth is for example $1,2^{1/3},2^{-1/3}$. This extends previous work of Eskin, Margulis and Mozes (Annals of Math., 2005) in dimension two, where the problem reduces to the quantitative Oppenheim conjecture for quadratic forms of signature $(2,2)$. The difficulty in three and higher dimensions is that we need to consider the distribution of indefinite forms in shrinking rather than fixed intervals, which we are able to resolve for special diagonal forms of signature $(3,3)$ in various scalings, including a rate of convergence. A key step of our approach is to represent the relevant counting problem as an average of a theta function on $\\mathrm{SL}(2,\\mathbb{Z})^3\\backslash\\mathrm{SL}(2,\\mathbb{R})^3$ over an expanding family of one-parameter unipotent orbits. The asymptotic behaviour of these unipotent averages follows from Ratner's measure classification theorem and subtle escape of mass estimates."}
{"id": "2601.03212", "categories": ["math.NT"], "pdf": "https://arxiv.org/pdf/2601.03212", "abs": "https://arxiv.org/abs/2601.03212", "authors": ["J. E. Cremona", "P. Koymans"], "title": "Lattice coverings and homogeneous covering congruences", "comment": null, "summary": "We consider the problem of covering $\\mathbb{Z}^2$ with a finite number of sublattices of finite index, satisfying a simple minimality or non-degeneracy condition. We show how this problem may be viewed as a projective (or homogeneous) version of the well-known problem of covering systems of congruences. We give a construction of minimal coverings which produces many, but not all, minimal coverings, and determine all minimal coverings with at most $8$ sublattices."}
